#define MSL_PPC_EABI_CRITICAL_REGIONS_GAMECUBE_H
#define RUNTIME_PLATFORM_H
/// @file
/// @todo Assumes @c __PPCGEKKO__.
#define STDBOOL_H
/// A signed integer used to contain boolean values
/// @todo Maybe some versions of MetroWerks support @c _Bool?
typedef int bool;
/// #bool true
/// @todo Make this and #false part of an @c enum. Fake usages, such as
/// assigning to a @c u32, will need to be addressed.
#define true 1
/// #bool false
#define false 0
/// @file
/// @todo Assumes @c __PPCGEKKO__.
#define __STDDEF_H__
typedef unsigned short wchar_t;
typedef signed int ssize_t;
/// @deprecated Use #usize_t.
typedef unsigned long size_t;
/// @todo Rename to @c size_t when #size_t is deleted.
typedef unsigned int usize_t;
typedef signed int intptr_t;
typedef unsigned int uintptr_t;
/// A null pointer
#define NULL ((void*) 0)
/// A signed 8-bit integer
typedef signed char s8;
/// A signed 16-bit integer
typedef signed short s16;
/// A signed 32-bit integer
typedef signed long s32;
/// A signed 64-bit integer
typedef signed long long s64;
/// An unsigned 8-bit integer
typedef unsigned char u8;
/// An unsigned 16-bit integer
typedef unsigned short u16;
/// An unsigned 32-bit integer
typedef unsigned long u32;
/// An unsigned 64-bit integer
typedef unsigned long long u64;
/// An unsigned short integer of platform-dependent size
typedef unsigned short ushort;
/// An unsigned integer of platform-dependent size
typedef unsigned int uint;
/// A volatile, unsigned 8-bit integer
typedef volatile u8 vu8;
/// A volatile, unsigned 16-bit integer
typedef volatile u16 vu16;
/// A volatile, unsigned 32-bit integer
typedef volatile u32 vu32;
/// A volatile, unsigned 64-bit integer
typedef volatile u64 vu64;
/// A volatile, signed 8-bit integer
typedef volatile s8 vs8;
/// A volatile, signed 16-bit integer
typedef volatile s16 vs16;
/// A volatile, signed 32-bit integer
typedef volatile s32 vs32;
/// A volatile, signed 64-bit integer
typedef volatile s64 vs64;
/// A 32-bit floating-point number
typedef float f32;
/// A 64-bit floating-point number
typedef double f64;
/// A volatile 32-bit floating-point number
typedef volatile f32 vf32;
/// A volatile 64-bit floating-point number
typedef volatile f64 vf64;
/// The underlying type of an @c enum, used as a placeholder
typedef int enum_t;
/// A @c void callback with no arguments.
typedef void (*Event)(void);
#define ATTRIBUTE_ALIGN(num) __attribute__((aligned(num)))
#define SECTION_INIT
#define ATTRIBUTE_NORETURN
#define ATTRIBUTE_RESTRICT
#define AT_ADDRESS(x)
#define U8_MAX 0xFF
#define U16_MAX 0xFFFF
#define U32_MAX 0xFFFFFFFF
#define S8_MAX 0x7F
#define S16_MAX 0x7FFF
#define S32_MAX 0x7FFFFFFF
#define F32_MAX 3.4028235e38f
#define SQ(x) ((x) * (x))
#define MIN(a, b) (((a) > (b)) ? (b) : (a))
#define MAX(a, b) (((a) > (b)) ? (a) : (b))
#define ARRAY_SIZE(arr) (sizeof(arr) / sizeof((arr)[0]))
#define STATIC_ASSERT(cond) struct { int x[1 - 2 * !(cond)]; };
#define RETURN_IF(cond) do { if ((cond)) { return; } } while (0)
#define SDATA
#define WEAK
void __kill_critical_regions(void);
#define MSL_ABORT_EXIT_H
void exit(int code);
#define _MSL_COMMON_ANSI_FILES_H
#define SEEK_SET 0
#define SEEK_CUR 1
#define SEEK_END 2
typedef unsigned long __file_handle;
typedef unsigned long fpos_t;
#define set_error(file) do { (file)->file_state.error = 1; (file)->buffer_length = 0; } while (0)
enum __file_kinds {
    __closed_file,
    __disk_file,
    __console_file,
    __unavailable_file,
};
enum __file_orientation {
    /* 0x0 */ UNORIENTED,
    /* 0x1 */ CHAR_ORIENTED,
    /* 0x2 */ WIDE_ORIENTED,
};
typedef struct _file_modes {
    unsigned int open_mode : 2;
    unsigned int io_mode : 3;
    unsigned int buffer_mode : 2;
    unsigned int file_kind : 3;
    unsigned int file_orientation : 2;
    unsigned int binary_io : 1;
} file_modes;
enum __io_modes {
    __read = 1,
    __write = 2,
    __read_write = 3,
    __append = 4,
};
enum __io_states {
    __neutral,
    __writing,
    __reading,
    __rereading,
};
enum __io_results {
    __no_io_error,
    __io_error,
    __io_EOF,
};
typedef struct _file_states {
    unsigned int io_state : 3;
    unsigned int free_buffer : 1;
    unsigned char eof;
    unsigned char error;
} file_states;
typedef void (*__idle_proc)(void);
typedef int (*__pos_proc)(__file_handle file, fpos_t* position, int mode,
                          __idle_proc idle_proc);
typedef int (*__io_proc)(__file_handle file, unsigned char* buff,
                         size_t* count, __idle_proc idle_proc);
typedef int (*__close_proc)(__file_handle file);
typedef struct _FILE {
    /* 0x00 */ __file_handle handle;
    /* 0x04 */ file_modes file_mode;
    /* 0x08 */ file_states file_state;
    /* 0x0C */ unsigned char is_dynamically_allocated;
    /* 0x0D */ char char_buffer;
    /* 0x0E */ char char_buffer_overflow;
    /* 0x0F */ char ungetc_buffer[2];
    /* 0x12 */ wchar_t ungetc_wide_buffer[2];
    /* 0x18 */ unsigned long position;
    /* 0x1C */ unsigned char* buffer;
    /* 0x20 */ unsigned long buffer_size;
    /* 0x24 */ unsigned char* buffer_ptr;
    /* 0x28 */ unsigned long buffer_length;
    /* 0x2C */ unsigned long buffer_alignment;
    /* 0x30 */ unsigned long save_buffer_length;
    /* 0x34 */ unsigned long buffer_position;
    /* 0x38 */ __pos_proc position_fn;
    /* 0x3C */ __io_proc read_fn;
    /* 0x40 */ __io_proc write_fn;
    /* 0x44 */ __close_proc close_fn;
    /* 0x48 */ __idle_proc idle_fn;
    /* 0x4C */ struct _FILE* next_file;
} FILE;
typedef struct _files {
    FILE _stdin;
    FILE _stdout;
    FILE _stderr;
    FILE empty;
} files;
#define _IONBF 0
#define _IOLBF 1
#define _IOFBF 2
extern files __files;
unsigned int __flush_all(void);
void __close_all(void);
#define _BUFFER_IO_H_
typedef struct _BufferIoUnkFlagStruct {
    /* 0x00 */ struct {
        u8 b0 : 1;
        u8 b1 : 1;
        u8 b2 : 1;
        u8 b3 : 1;
        u8 b4 : 1;
        u8 b5 : 1;
        u8 b6 : 1;
        u8 b7 : 1;
    } bits;
} BufferIoUnkFlagStruct;
typedef struct _BufferIoUnkStruct {
    /* 0x00 */ s32 x00;
    /* 0x04 */ BufferIoUnkFlagStruct x04;
    /* 0x05 */ BufferIoUnkFlagStruct x05;
    /* 0x06 */ BufferIoUnkFlagStruct x06;
    /* 0x07 */ BufferIoUnkFlagStruct x07;
    /* 0x08 */ s32 x08_filler[3];
    /* 0x14 */ s32 x14;
    /* 0x18 */ s32 x18;
    /* 0x1C */ s32 x1C;
    /* 0x20 */ s32 x20;
    /* 0x24 */ s32 x24;
    /* 0x28 */ s32 x28;
    /* 0x2C */ s32 x2C_filler;
    /* 0x30 */ s32 x30;
    /* 0x34 */ s32 x34_filler[2];
    /* 0x3C */ s32 (*x3C)(s32 x3C_arg0, s32 x3C_arg1, s32* x3C_arg2,
                          s32 x3C_arg3);
    /* 0x40 */ s32 x40_filler;
    /* 0x44 */ s32 x44;
} BufferIoUnkStruct;
void __prep_buffer(BufferIoUnkStruct* arg0);
s32 __flush_buffer(BufferIoUnkStruct* arg0, s32* arg1);
#define MSL_CONSOLE_IO_H
s32 MSL_ConsoleIo_80325F18(void);
s32 __write_console(s32, s32 arg1, s32* arg2);
u8 __read_console(u32, u8* buf, u32* n);
#define __CSTRING_H__
int wcstombs(void* dst, const void* src, size_t len);
int memcmp(const void* str1, const void* str2, size_t len);
void* memchr(const void* str, int c, size_t len);
void* memmove(void* dst, const void* src, size_t len);
#define MSL_CTYPE_H
extern const unsigned char __ctype_map[];
extern const unsigned char __lower_map[];
extern const unsigned char __upper_map[];
#define EOF -1L
#define __control_char 0x01
#define __motion_char 0x02
#define __space_char 0x04
#define __punctuation 0x08
#define __digit 0x10
#define __hex_digit 0x20
#define __lower_case 0x40
#define __upper_case 0x80
#define __letter (__lower_case | __upper_case)
#define __alphanumeric (__letter | __digit)
#define __graphic (__alphanumeric | __punctuation)
#define __printable (__graphic | __space_char)
#define __whitespace (__motion_char | __space_char)
#define __control (__motion_char | __control_char)
#define __zero_fill(c) ((int) (unsigned char) (c))
inline int isalpha(int c)
{
    return (int) (__ctype_map[(unsigned char) c] & (0x40 | 0x80));
}
inline int isdigit(int c)
{
    return (int) (__ctype_map[(unsigned char) c] & 0x10);
}
inline int isspace(int c)
{
    return (int) (__ctype_map[(unsigned char) c] & (0x02 | 0x04));
}
inline int isupper(int c)
{
    return (int) (__ctype_map[(unsigned char) c] & 0x80);
}
inline int isxdigit(int c)
{
    return (int) (__ctype_map[(unsigned char) c] & 0x20);
}
int toupper(int c);
int tolower(int c);
#define MSL_COMMON_SRC_ERRNO_H
#define ENOERR 0
#define EDOM 33
#define ERANGE 34
#define EFPOS 40
#define ESIGPARM 36
extern int errno;
#define _STD_LIMITS_H
#define CHAR_BIT 8
#define SCHAR_MIN (-0x7F - 1)
#define SCHAR_MAX 0x7F
#define UCHAR_MAX 0xFF
#define CHAR_MIN 0
#define CHAR_MAX SCHAR_MAX
#define SHRT_MIN (-0x7FFF - 1)
#define SHRT_MAX 0x7FFF
#define USHRT_MAX 0xFFFF
#define INT_MIN (-0x7FFFFFFF - 1)
#define INT_MAX 0x7FFFFFFF
#define UINT_MAX 0xFFFFFFFF
#define LONG_MIN (-0x7FFFFFFFL - 1)
#define LONG_MAX 0x7FFFFFFFL
#define ULONG_MAX 0xFFFFFFFFUL
#define LLONG_MIN (-0x7FFFFFFFFFFFFFFFLL - 1)
#define LLONG_MAX 0x7FFFFFFFFFFFFFFFLL
#define ULLONG_MAX 0xFFFFFFFFFFFFFFFFULL
#define MSL_MATH_H
#define METROTRK_INTRINSICS_H
void __sync(void);
void __isync(void);
int __cntlzw(unsigned int);
float sqrtf__Ff(float);
float __fnmsubs(float, float, float);
double __fabs(double);
float __fabsf(float);
double __frsqrte(double);
void* __memcpy(void* dst, const void* src, unsigned long n);
#define MSL_HI(x) *(int*) &x
#define MSL_LO(x) *(1 + (int*) &x)
#define M_PI 3.14159265358979323846
#define M_PI_2 (M_PI / 2)
#define M_PI_3 (M_PI / 3)
static float const deg_to_rad = 3.14159265358979323846 / 180;
static float const rad_to_deg = 180 / 3.14159265358979323846;
#pragma push
#pragma cplusplus on
#define FLT_EPSILON 1.00000001335e-10F
#pragma pop
enum FloatType {
    FP_NAN = 1,
    FP_INFINITE = 2,
    FP_ZERO = 3,
    FP_NORMAL = 4,
    FP_SUBNORMAL = 5
};
static inline s32 __fpclassifyf(float x)
{
    const s32 exp_mask = 0b01111111100000000000000000000000; // = 0x7F800000
    const s32 mantissa_mask =
        0b00000000011111111111111111111111; // = 0x007fffff
    switch ((*(s32*) &x) & exp_mask) {
    case exp_mask:
        return ((*(s32*) &x) & mantissa_mask) ? FP_NAN : FP_INFINITE;
    case 0:
        return ((*(s32*) &x) & mantissa_mask) ? FP_SUBNORMAL : FP_ZERO;
    default:
        return FP_NORMAL;
    }
}
extern int __HI(double);
extern int __LO(double);
static inline s32 __fpclassifyd(double x)
{
    switch (__HI(x) & 0x7ff00000) {
    case 0x7ff00000:
        return ((__HI(x) & 0x000fffff) || (__LO(x) & 0xffffffff))
                   ? FP_NAN
                   : FP_INFINITE;
    case 0:
        return ((__HI(x) & 0x000fffff) || (__LO(x) & 0xffffffff))
                   ? FP_SUBNORMAL
                   : FP_ZERO;
    default:
        return FP_NORMAL;
    }
}
#define fpclassify(x) ((sizeof(x) == sizeof(float)) ? __fpclassifyf((float) (x)) : __fpclassifyd((double) (x)))
/// @todo Is #fabs_inline fake? See #ftCo_AttackS3_CheckInput.
#define ABS(x) ((x) < 0 ? -(x) : (x))
static inline f32 fabs_inline(f32 x)
{
    if (x < 0) {
        return -x;
    } else {
        return x;
    }
}
double frexp(double x, int* exponent);
double fabsf__Ff(double);
float tanf(float x);
float cos__Ff(float x);
float sin__Ff(float x);
float cosf(float x);
float sinf(float x);
void __sinit_trigf_c(void);
float logf(float);
#define _MATH_PPC_H_
#pragma push
#pragma cplusplus on
extern inline float sqrtf(float x)
{
    static const double _half = .5;
    static const double _three = 3.0;
    volatile float y;
    if (x > 0.0f) {
        double guess = __frsqrte((double) x); // returns an approximation to
        guess = _half * guess *
                (_three - guess * guess * x); // now have 12 sig bits
        guess = _half * guess *
                (_three - guess * guess * x); // now have 24 sig bits
        guess = _half * guess *
                (_three - guess * guess * x); // now have 32 sig bits
        y = (float) (x * guess);
        return y;
    }
    return x;
}
#pragma pop
inline float sqrtf_accurate(float x)
{
    volatile float y;
    if (x > 0.0f) {
        double guess = __frsqrte((double) x); // returns an approximation to
        guess =
            0.5 * guess * (3.0 - guess * guess * x); // now have 12 sig bits
        guess =
            0.5 * guess * (3.0 - guess * guess * x); // now have 24 sig bits
        guess =
            0.5 * guess * (3.0 - guess * guess * x); // now have 32 sig bits
        guess = 0.5 * guess * (3.0 - guess * guess * x); // extra iteration
        y = (float) (x * guess);
        return y;
    }
    return x;
}
#define __MEM_FUNCS_H__
void __copy_longs_aligned(void* dst, const void* src, size_t len);
void __copy_longs_rev_aligned(void* dst, const void* src, size_t len);
void __copy_longs_unaligned(void* dst, const void* src, size_t len);
void __copy_longs_rev_unaligned(void* dst, const void* src, size_t len);
#define _RAND_H_
void srand(unsigned int seed);
int rand(void);
#define _MSL_COMMON_SCANF_H
enum __ReadProcActions {
    __GetAChar,
    __UngetAChar,
    __TestForError
};
enum __WReadProcActions {
    __GetAwChar,
    __UngetAwChar,
    __TestForwcsError
};
typedef struct {
    char* CharStr;
    size_t MaxCharCount;
    size_t CharsWritten;
} __OutStrCtrl;
typedef struct {
    char* NextChar;
    int NullCharDetected;
} __InStrCtrl;
typedef struct {
    wchar_t* wCharStr;
    size_t MaxCharCount;
    size_t CharsWritten;
} __wOutStrCtrl;
typedef struct {
    wchar_t* wNextChar;
    int wNullCharDetected;
} __wInStrCtrl;
#define MSL_STRING_H
char* strncpy(char* dst, const char* src,
              unsigned long n);
int __StringRead(void* isc, int ch, int Action);
char* strchr(const char* str, int chr);
int strncmp(const char* str1, const char* str2, unsigned long n);
int strcmp(const char* str1, const char* str2);
char* strcpy(char* dst, const char* src);
size_t strlen(const char* s);
#define _MSL_COMMON_STRTOUL_H
long strtol(const char* str, char** end, int base);
unsigned long strtoul(const char* str, char** end, int base);
unsigned long __strtoul(int base, int max_width,
                        int (*ReadProc)(void*, int, int), void* ReadProcArg,
                        int* chars_scanned, int* negative, int* overflow);
#define MSL_TRIGF_H
float acosf(float);
float asinf(float);
float atan2f(float y, float x);
float atanf(float);
float cosf(float);
float sinf(float);
float tanf(float);
#define _WCHAR_IO_H_
/// @file
/// @todo Delete this.
#define _common_structs_h_
#define DOLPHIN_GX_FORWARD_H
#define DOLPHIN_GXENUM_H
typedef u8 GXBool;
#define GX_FALSE ((GXBool) 0)
#define GX_TRUE ((GXBool) 1)
#define GX_ENABLE ((GXBool) 1)
#define GX_DISABLE ((GXBool) 0)
typedef enum {
    GX_PERSPECTIVE,
    GX_ORTHOGRAPHIC,
} GXProjectionType;
typedef enum {
    GX_NEVER,
    GX_LESS,
    GX_EQUAL,
    GX_LEQUAL,
    GX_GREATER,
    GX_NEQUAL,
    GX_GEQUAL,
    GX_ALWAYS,
} GXCompare;
typedef enum {
    GX_AOP_AND,
    GX_AOP_OR,
    GX_AOP_XOR,
    GX_AOP_XNOR,
    GX_MAX_ALPHAOP,
} GXAlphaOp;
typedef enum {
    GX_ZC_LINEAR,
    GX_ZC_NEAR,
    GX_ZC_MID,
    GX_ZC_FAR,
} GXZFmt16;
typedef enum {
    GX_GM_1_0,
    GX_GM_1_7,
    GX_GM_2_2,
} GXGamma;
typedef enum {
    GX_PF_RGB8_Z24,
    GX_PF_RGBA6_Z24,
    GX_PF_RGB565_Z16,
    GX_PF_Z24,
    GX_PF_Y8,
    GX_PF_U8,
    GX_PF_V8,
    GX_PF_YUV420,
} GXPixelFmt;
typedef enum {
    GX_QUADS = 0x80,
    GX_TRIANGLES = 0x90,
    GX_TRIANGLESTRIP = 0x98,
    GX_TRIANGLEFAN = 0xA0,
    GX_LINES = 0xA8,
    GX_LINESTRIP = 0xB0,
    GX_POINTS = 0xB8,
} GXPrimitive;
typedef enum {
    GX_VTXFMT0,
    GX_VTXFMT1,
    GX_VTXFMT2,
    GX_VTXFMT3,
    GX_VTXFMT4,
    GX_VTXFMT5,
    GX_VTXFMT6,
    GX_VTXFMT7,
    GX_MAX_VTXFMT,
} GXVtxFmt;
typedef enum GXAttr {
    GX_VA_PNMTXIDX,
    GX_VA_TEX0MTXIDX,
    GX_VA_TEX1MTXIDX,
    GX_VA_TEX2MTXIDX,
    GX_VA_TEX3MTXIDX,
    GX_VA_TEX4MTXIDX,
    GX_VA_TEX5MTXIDX,
    GX_VA_TEX6MTXIDX,
    GX_VA_TEX7MTXIDX,
    GX_VA_POS,
    GX_VA_NRM,
    GX_VA_CLR0,
    GX_VA_CLR1,
    GX_VA_TEX0,
    GX_VA_TEX1,
    GX_VA_TEX2,
    GX_VA_TEX3,
    GX_VA_TEX4,
    GX_VA_TEX5,
    GX_VA_TEX6,
    GX_VA_TEX7,
    GX_POS_MTX_ARRAY,
    GX_NRM_MTX_ARRAY,
    GX_TEX_MTX_ARRAY,
    GX_LIGHT_ARRAY,
    GX_VA_NBT,
    GX_VA_MAX_ATTR,
    GX_VA_NULL = 0xFF,
} GXAttr;
typedef enum GXAttrType {
    GX_NONE,
    GX_DIRECT,
    GX_INDEX8,
    GX_INDEX16,
} GXAttrType;
#define _GX_TF_CTF 0x20
#define _GX_TF_ZTF 0x10
typedef enum {
    GX_TF_I4 = 0x0,
    GX_TF_I8 = 0x1,
    GX_TF_IA4 = 0x2,
    GX_TF_IA8 = 0x3,
    GX_TF_RGB565 = 0x4,
    GX_TF_RGB5A3 = 0x5,
    GX_TF_RGBA8 = 0x6,
    GX_TF_CMPR = 0xE,
    GX_CTF_R4 = 0x0 | 0x20,
    GX_CTF_RA4 = 0x2 | 0x20,
    GX_CTF_RA8 = 0x3 | 0x20,
    GX_CTF_YUVA8 = 0x6 | 0x20,
    GX_CTF_A8 = 0x7 | 0x20,
    GX_CTF_R8 = 0x8 | 0x20,
    GX_CTF_G8 = 0x9 | 0x20,
    GX_CTF_B8 = 0xA | 0x20,
    GX_CTF_RG8 = 0xB | 0x20,
    GX_CTF_GB8 = 0xC | 0x20,
    GX_TF_Z8 = 0x1 | 0x10,
    GX_TF_Z16 = 0x3 | 0x10,
    GX_TF_Z24X8 = 0x6 | 0x10,
    GX_CTF_Z4 = 0x0 | 0x10 | 0x20,
    GX_CTF_Z8M = 0x9 | 0x10 | 0x20,
    GX_CTF_Z8L = 0xA | 0x10 | 0x20,
    GX_CTF_Z16L = 0xC | 0x10 | 0x20,
    GX_TF_A8 = GX_CTF_A8,
} GXTexFmt;
typedef enum {
    GX_TF_C4 = 0x8,
    GX_TF_C8 = 0x9,
    GX_TF_C14X2 = 0xA,
} GXCITexFmt;
typedef enum {
    GX_CLAMP,
    GX_REPEAT,
    GX_MIRROR,
    GX_MAX_TEXWRAPMODE,
} GXTexWrapMode;
typedef enum {
    GX_NEAR,
    GX_LINEAR,
    GX_NEAR_MIP_NEAR,
    GX_LIN_MIP_NEAR,
    GX_NEAR_MIP_LIN,
    GX_LIN_MIP_LIN,
} GXTexFilter;
typedef enum {
    GX_ANISO_1,
    GX_ANISO_2,
    GX_ANISO_4,
    GX_MAX_ANISOTROPY,
} GXAnisotropy;
typedef enum {
    GX_TLUT0 = 0,
    GX_TLUT1,
    GX_TLUT2,
    GX_TLUT3,
    GX_TLUT4,
    GX_TLUT5,
    GX_TLUT6,
    GX_TLUT7,
    GX_TLUT8,
    GX_TLUT9,
    GX_TLUT10,
    GX_TLUT11,
    GX_TLUT12,
    GX_TLUT13,
    GX_TLUT14,
    GX_TLUT15,
    GX_BIGTLUT0,
    GX_BIGTLUT1,
    GX_BIGTLUT2,
    GX_BIGTLUT3
} GXTlut;
typedef enum {
    GX_TL_IA8 = 0x0,
    GX_TL_RGB565 = 0x1,
    GX_TL_RGB5A3 = 0x2,
    GX_MAX_TLUTFMT
} GXTlutFmt;
typedef enum {
    GX_TEXMAP0,
    GX_TEXMAP1,
    GX_TEXMAP2,
    GX_TEXMAP3,
    GX_TEXMAP4,
    GX_TEXMAP5,
    GX_TEXMAP6,
    GX_TEXMAP7,
    GX_MAX_TEXMAP,
    GX_TEXMAP_NULL = 0xFF,
    GX_TEX_DISABLE = 0x100,
} GXTexMapID;
typedef enum {
    GX_TEXCOORD0,
    GX_TEXCOORD1,
    GX_TEXCOORD2,
    GX_TEXCOORD3,
    GX_TEXCOORD4,
    GX_TEXCOORD5,
    GX_TEXCOORD6,
    GX_TEXCOORD7,
    GX_MAX_TEXCOORD,
    GX_TEXCOORD_NULL = 0xFF,
} GXTexCoordID;
typedef enum {
    GX_TEVSTAGE0,
    GX_TEVSTAGE1,
    GX_TEVSTAGE2,
    GX_TEVSTAGE3,
    GX_TEVSTAGE4,
    GX_TEVSTAGE5,
    GX_TEVSTAGE6,
    GX_TEVSTAGE7,
    GX_TEVSTAGE8,
    GX_TEVSTAGE9,
    GX_TEVSTAGE10,
    GX_TEVSTAGE11,
    GX_TEVSTAGE12,
    GX_TEVSTAGE13,
    GX_TEVSTAGE14,
    GX_TEVSTAGE15,
    GX_MAX_TEVSTAGE,
} GXTevStageID;
typedef enum {
    GX_MODULATE,
    GX_DECAL,
    GX_BLEND,
    GX_REPLACE,
    GX_PASSCLR,
} GXTevMode;
typedef enum {
    GX_MTX3x4,
    GX_MTX2x4,
} GXTexMtxType;
typedef enum {
    GX_TG_MTX3x4,
    GX_TG_MTX2x4,
    GX_TG_BUMP0,
    GX_TG_BUMP1,
    GX_TG_BUMP2,
    GX_TG_BUMP3,
    GX_TG_BUMP4,
    GX_TG_BUMP5,
    GX_TG_BUMP6,
    GX_TG_BUMP7,
    GX_TG_SRTG,
} GXTexGenType;
typedef enum {
    GX_PNMTX0 = 0,
    GX_PNMTX1 = 3,
    GX_PNMTX2 = 6,
    GX_PNMTX3 = 9,
    GX_PNMTX4 = 12,
    GX_PNMTX5 = 15,
    GX_PNMTX6 = 18,
    GX_PNMTX7 = 21,
    GX_PNMTX8 = 24,
    GX_PNMTX9 = 27,
} GXPosNrmMtx;
typedef enum {
    GX_TEXMTX0 = 30,
    GX_TEXMTX1 = 33,
    GX_TEXMTX2 = 36,
    GX_TEXMTX3 = 39,
    GX_TEXMTX4 = 42,
    GX_TEXMTX5 = 45,
    GX_TEXMTX6 = 48,
    GX_TEXMTX7 = 51,
    GX_TEXMTX8 = 54,
    GX_TEXMTX9 = 57,
    GX_IDENTITY = 60,
} GXTexMtx;
typedef enum {
    GX_COLOR0,
    GX_COLOR1,
    GX_ALPHA0,
    GX_ALPHA1,
    GX_COLOR0A0,
    GX_COLOR1A1,
    GX_COLOR_ZERO,
    GX_ALPHA_BUMP,
    GX_ALPHA_BUMPN,
    GX_COLOR_NULL = 0xFF,
} GXChannelID;
typedef enum {
    GX_TG_POS,
    GX_TG_NRM,
    GX_TG_BINRM,
    GX_TG_TANGENT,
    GX_TG_TEX0,
    GX_TG_TEX1,
    GX_TG_TEX2,
    GX_TG_TEX3,
    GX_TG_TEX4,
    GX_TG_TEX5,
    GX_TG_TEX6,
    GX_TG_TEX7,
    GX_TG_TEXCOORD0,
    GX_TG_TEXCOORD1,
    GX_TG_TEXCOORD2,
    GX_TG_TEXCOORD3,
    GX_TG_TEXCOORD4,
    GX_TG_TEXCOORD5,
    GX_TG_TEXCOORD6,
    GX_TG_COLOR0,
    GX_TG_COLOR1,
} GXTexGenSrc;
typedef enum {
    GX_BM_NONE,
    GX_BM_BLEND,
    GX_BM_LOGIC,
    GX_BM_SUBTRACT,
    GX_MAX_BLENDMODE,
} GXBlendMode;
typedef enum {
    GX_BL_ZERO,
    GX_BL_ONE,
    GX_BL_SRCCLR,
    GX_BL_INVSRCCLR,
    GX_BL_SRCALPHA,
    GX_BL_INVSRCALPHA,
    GX_BL_DSTALPHA,
    GX_BL_INVDSTALPHA,
    GX_BL_DSTCLR = GX_BL_SRCCLR,
    GX_BL_INVDSTCLR = GX_BL_INVSRCCLR,
} GXBlendFactor;
typedef enum {
    GX_LO_CLEAR,
    GX_LO_AND,
    GX_LO_REVAND,
    GX_LO_COPY,
    GX_LO_INVAND,
    GX_LO_NOOP,
    GX_LO_XOR,
    GX_LO_OR,
    GX_LO_NOR,
    GX_LO_EQUIV,
    GX_LO_INV,
    GX_LO_REVOR,
    GX_LO_INVCOPY,
    GX_LO_INVOR,
    GX_LO_NAND,
    GX_LO_SET,
} GXLogicOp;
typedef enum {
    GX_POS_XY = 0,
    GX_POS_XYZ = 1,
    GX_NRM_XYZ = 0,
    GX_NRM_NBT = 1,
    GX_NRM_NBT3 = 2,
    GX_CLR_RGB = 0,
    GX_CLR_RGBA = 1,
    GX_TEX_S = 0,
    GX_TEX_ST = 1,
} GXCompCnt;
typedef enum {
    GX_U8 = 0,
    GX_S8 = 1,
    GX_U16 = 2,
    GX_S16 = 3,
    GX_F32 = 4,
    GX_RGB565 = 0,
    GX_RGB8 = 1,
    GX_RGBX8 = 2,
    GX_RGBA4 = 3,
    GX_RGBA6 = 4,
    GX_RGBA8 = 5,
} GXCompType;
typedef enum {
    GX_PTTEXMTX0 = 64,
    GX_PTTEXMTX1 = 67,
    GX_PTTEXMTX2 = 70,
    GX_PTTEXMTX3 = 73,
    GX_PTTEXMTX4 = 76,
    GX_PTTEXMTX5 = 79,
    GX_PTTEXMTX6 = 82,
    GX_PTTEXMTX7 = 85,
    GX_PTTEXMTX8 = 88,
    GX_PTTEXMTX9 = 91,
    GX_PTTEXMTX10 = 94,
    GX_PTTEXMTX11 = 97,
    GX_PTTEXMTX12 = 100,
    GX_PTTEXMTX13 = 103,
    GX_PTTEXMTX14 = 106,
    GX_PTTEXMTX15 = 109,
    GX_PTTEXMTX16 = 112,
    GX_PTTEXMTX17 = 115,
    GX_PTTEXMTX18 = 118,
    GX_PTTEXMTX19 = 121,
    GX_PTIDENTITY = 125,
} GXPTTexMtx;
typedef enum {
    GX_TEVPREV,
    GX_TEVREG0,
    GX_TEVREG1,
    GX_TEVREG2,
    GX_MAX_TEVREG,
} GXTevRegID;
typedef enum {
    GX_DF_NONE,
    GX_DF_SIGN,
    GX_DF_CLAMP,
} GXDiffuseFn;
typedef enum {
    GX_SRC_REG,
    GX_SRC_VTX,
} GXColorSrc;
typedef enum {
    GX_AF_SPEC,
    GX_AF_SPOT,
    GX_AF_NONE,
} GXAttnFn;
typedef enum {
    GX_LIGHT0 = 0x001,
    GX_LIGHT1 = 0x002,
    GX_LIGHT2 = 0x004,
    GX_LIGHT3 = 0x008,
    GX_LIGHT4 = 0x010,
    GX_LIGHT5 = 0x020,
    GX_LIGHT6 = 0x040,
    GX_LIGHT7 = 0x080,
    GX_MAX_LIGHT = 9,
    GX_LIGHT_AMBIENT = 0x100,
    GX_LIGHT_NULL = 0,
} GXLightID;
typedef enum {
    GX_TO_ZERO,
    GX_TO_SIXTEENTH,
    GX_TO_EIGHTH,
    GX_TO_FOURTH,
    GX_TO_HALF,
    GX_TO_ONE,
    GX_MAX_TEXOFFSET,
} GXTexOffset;
typedef enum {
    GX_SP_OFF,
    GX_SP_FLAT,
    GX_SP_COS,
    GX_SP_COS2,
    GX_SP_SHARP,
    GX_SP_RING1,
    GX_SP_RING2,
} GXSpotFn;
typedef enum {
    GX_DA_OFF,
    GX_DA_GENTLE,
    GX_DA_MEDIUM,
    GX_DA_STEEP,
} GXDistAttnFn;
typedef enum {
    GX_CULL_NONE,
    GX_CULL_FRONT,
    GX_CULL_BACK,
    GX_CULL_ALL
} GXCullMode;
typedef enum {
    GX_TEV_SWAP0 = 0,
    GX_TEV_SWAP1,
    GX_TEV_SWAP2,
    GX_TEV_SWAP3,
    GX_MAX_TEVSWAP
} GXTevSwapSel;
typedef enum {
    GX_CH_RED = 0,
    GX_CH_GREEN,
    GX_CH_BLUE,
    GX_CH_ALPHA
} GXTevColorChan;
typedef enum _GXFogType {
    GX_FOG_NONE = 0,
    GX_FOG_LIN = 2,
    GX_FOG_EXP = 4,
    GX_FOG_EXP2 = 5,
    GX_FOG_REVEXP = 6,
    GX_FOG_REVEXP2 = 7
} GXFogType;
typedef enum {
    GX_CC_CPREV,
    GX_CC_APREV,
    GX_CC_C0,
    GX_CC_A0,
    GX_CC_C1,
    GX_CC_A1,
    GX_CC_C2,
    GX_CC_A2,
    GX_CC_TEXC,
    GX_CC_TEXA,
    GX_CC_RASC,
    GX_CC_RASA,
    GX_CC_ONE,
    GX_CC_HALF,
    GX_CC_KONST,
    GX_CC_ZERO
} GXTevColorArg;
typedef enum {
    GX_CA_APREV,
    GX_CA_A0,
    GX_CA_A1,
    GX_CA_A2,
    GX_CA_TEXA,
    GX_CA_RASA,
    GX_CA_KONST,
    GX_CA_ZERO
} GXTevAlphaArg;
typedef enum {
    GX_TEV_ADD = 0,
    GX_TEV_SUB = 1,
    GX_TEV_COMP_R8_GT = 8,
    GX_TEV_COMP_R8_EQ = 9,
    GX_TEV_COMP_GR16_GT = 10,
    GX_TEV_COMP_GR16_EQ = 11,
    GX_TEV_COMP_BGR24_GT = 12,
    GX_TEV_COMP_BGR24_EQ = 13,
    GX_TEV_COMP_RGB8_GT = 14,
    GX_TEV_COMP_RGB8_EQ = 15,
    GX_TEV_COMP_A8_GT = GX_TEV_COMP_RGB8_GT,
    GX_TEV_COMP_A8_EQ = GX_TEV_COMP_RGB8_EQ
} GXTevOp;
typedef enum {
    GX_TB_ZERO,
    GX_TB_ADDHALF,
    GX_TB_SUBHALF,
    GX_MAX_TEVBIAS
} GXTevBias;
typedef enum {
    GX_CS_SCALE_1,
    GX_CS_SCALE_2,
    GX_CS_SCALE_4,
    GX_CS_DIVIDE_2,
    GX_MAX_TEVSCALE
} GXTevScale;
typedef enum {
    GX_TEV_KCSEL_1 = 0x00,
    GX_TEV_KCSEL_7_8 = 0x01,
    GX_TEV_KCSEL_3_4 = 0x02,
    GX_TEV_KCSEL_5_8 = 0x03,
    GX_TEV_KCSEL_1_2 = 0x04,
    GX_TEV_KCSEL_3_8 = 0x05,
    GX_TEV_KCSEL_1_4 = 0x06,
    GX_TEV_KCSEL_1_8 = 0x07,
    GX_TEV_KCSEL_K0 = 0x0C,
    GX_TEV_KCSEL_K1 = 0x0D,
    GX_TEV_KCSEL_K2 = 0x0E,
    GX_TEV_KCSEL_K3 = 0x0F,
    GX_TEV_KCSEL_K0_R = 0x10,
    GX_TEV_KCSEL_K1_R = 0x11,
    GX_TEV_KCSEL_K2_R = 0x12,
    GX_TEV_KCSEL_K3_R = 0x13,
    GX_TEV_KCSEL_K0_G = 0x14,
    GX_TEV_KCSEL_K1_G = 0x15,
    GX_TEV_KCSEL_K2_G = 0x16,
    GX_TEV_KCSEL_K3_G = 0x17,
    GX_TEV_KCSEL_K0_B = 0x18,
    GX_TEV_KCSEL_K1_B = 0x19,
    GX_TEV_KCSEL_K2_B = 0x1A,
    GX_TEV_KCSEL_K3_B = 0x1B,
    GX_TEV_KCSEL_K0_A = 0x1C,
    GX_TEV_KCSEL_K1_A = 0x1D,
    GX_TEV_KCSEL_K2_A = 0x1E,
    GX_TEV_KCSEL_K3_A = 0x1F
} GXTevKColorSel;
typedef enum {
    GX_TEV_KASEL_1 = 0x00,
    GX_TEV_KASEL_7_8 = 0x01,
    GX_TEV_KASEL_3_4 = 0x02,
    GX_TEV_KASEL_5_8 = 0x03,
    GX_TEV_KASEL_1_2 = 0x04,
    GX_TEV_KASEL_3_8 = 0x05,
    GX_TEV_KASEL_1_4 = 0x06,
    GX_TEV_KASEL_1_8 = 0x07,
    GX_TEV_KASEL_K0_R = 0x10,
    GX_TEV_KASEL_K1_R = 0x11,
    GX_TEV_KASEL_K2_R = 0x12,
    GX_TEV_KASEL_K3_R = 0x13,
    GX_TEV_KASEL_K0_G = 0x14,
    GX_TEV_KASEL_K1_G = 0x15,
    GX_TEV_KASEL_K2_G = 0x16,
    GX_TEV_KASEL_K3_G = 0x17,
    GX_TEV_KASEL_K0_B = 0x18,
    GX_TEV_KASEL_K1_B = 0x19,
    GX_TEV_KASEL_K2_B = 0x1A,
    GX_TEV_KASEL_K3_B = 0x1B,
    GX_TEV_KASEL_K0_A = 0x1C,
    GX_TEV_KASEL_K1_A = 0x1D,
    GX_TEV_KASEL_K2_A = 0x1E,
    GX_TEV_KASEL_K3_A = 0x1F
} GXTevKAlphaSel;
typedef enum {
    GX_KCOLOR0 = 0,
    GX_KCOLOR1,
    GX_KCOLOR2,
    GX_KCOLOR3,
    GX_MAX_KCOLOR
} GXTevKColorID;
typedef enum {
    GX_ZT_DISABLE,
    GX_ZT_ADD,
    GX_ZT_REPLACE,
    GX_MAX_ZTEXOP,
} GXZTexOp;
typedef enum {
    GX_ITF_8,
    GX_ITF_5,
    GX_ITF_4,
    GX_ITF_3,
    GX_MAX_ITFORMAT,
} GXIndTexFormat;
typedef enum {
    GX_ITB_NONE,
    GX_ITB_S,
    GX_ITB_T,
    GX_ITB_ST,
    GX_ITB_U,
    GX_ITB_SU,
    GX_ITB_TU,
    GX_ITB_STU,
    GX_MAX_ITBIAS,
} GXIndTexBiasSel;
typedef enum {
    GX_ITBA_OFF,
    GX_ITBA_S,
    GX_ITBA_T,
    GX_ITBA_U,
    GX_MAX_ITBALPHA,
} GXIndTexAlphaSel;
typedef enum {
    GX_ITM_OFF,
    GX_ITM_0,
    GX_ITM_1,
    GX_ITM_2,
    GX_ITM_S0 = 5,
    GX_ITM_S1,
    GX_ITM_S2,
    GX_ITM_T0 = 9,
    GX_ITM_T1,
    GX_ITM_T2,
} GXIndTexMtxID;
typedef enum {
    GX_ITW_OFF,
    GX_ITW_256,
    GX_ITW_128,
    GX_ITW_64,
    GX_ITW_32,
    GX_ITW_16,
    GX_ITW_0,
    GX_MAX_ITWRAP,
} GXIndTexWrap;
typedef enum {
    GX_INDTEXSTAGE0,
    GX_INDTEXSTAGE1,
    GX_INDTEXSTAGE2,
    GX_INDTEXSTAGE3,
    GX_MAX_INDTEXSTAGE,
} GXIndTexStageID;
typedef enum {
    GX_CLIP_ENABLE = 0,
    GX_CLIP_DISABLE = 1,
} GXClipMode;
typedef enum {
    GX_TC_LINEAR,
    GX_TC_GE,
    GX_TC_EQ,
    GX_TC_LE,
    GX_MAX_TEVCLAMPMODE,
} GXTevClampMode;
// todo: clean up invocations via defines or inlines
/* for example,
static inline void WriteBP(u32 i) {
   WGPIPE.u8 = GX_LOAD_BP_REG;
   WGPIPE.u32 = i;
} */
// most or all GX commands follow a pattern of fixed args
typedef enum {
    GX_NOP = 0x00,
    GX_DRAW_QUADS = 0x80,
    GX_DRAW_TRIANGLES = 0x90,
    GX_DRAW_TRIANGLE_STRIP = 0x98,
    GX_DRAW_TRIANGLE_FAN = 0xA0,
    GX_DRAW_LINES = 0xA8,
    GX_DRAW_LINE_STRIP = 0xB0,
    GX_DRAW_POINTS = 0xB8,
    GX_LOAD_BP_REG = 0x61,
    GX_LOAD_CP_REG = 0x08,
    GX_LOAD_XF_REG = 0x10,
    GX_LOAD_INDX_A = 0x20,
    GX_LOAD_INDX_B = 0x28,
    GX_LOAD_INDX_C = 0x30,
    GX_LOAD_INDX_D = 0x38,
    GX_CMD_CALL_DL = 0x40,
    GX_CMD_INVL_VC = 0x48,
    GX_OPCODE_MASK = 0xF8,
    GX_VAT_MASK = 0x07,
} GXCommand;
typedef enum {
    GX_CLAMP_NONE,
    GX_CLAMP_TOP,
    GX_CLAMP_BOTTOM
} GXFBClamp;
typedef struct GXTexObj GXTexObj;
typedef struct GXTlutObj GXTlutObj;
typedef struct GXColor GXColor;
typedef struct GXColorS10 GXColorS10;
typedef struct GXRenderModeObj GXRenderModeObj;
typedef struct GXContexts GXContexts;
typedef struct GXGPFifo GXGPFifo;
typedef struct GXSettings GXSettings;
typedef struct GXContext GXContext;
typedef struct GXFifoObj GXFifoObj;
typedef void (*GXDrawDoneCallback)(void);
/// @todo Signature unknown.
typedef void* (*GXTexRegionCallback)(void);
static inline void GXEnd(void) {}
#define DOLPHIN_GX_TYPES_H
#define GX_FIFO_OBJSIZE 128
struct GXFifoObj {
    u8 pad[128];
};
struct GXRenderModeObj {
    u32 viTVMode;
    u16 fbWidth;
    u16 efbHeight;
    u16 xfbHeight;
    u16 viXOrigin;
    u16 viYOrigin;
    u16 viWidth;
    u16 viHeight;
    u32 xfbMode;
    u8 field_rendering;
    u8 aa;
    u8 sample_pattern[12][2];
    u8 vfilter[7];
};
struct GXColor {
    u8 r, g, b, a;
};
struct GXColorS10 {
    s16 r, g, b, a;
};
#define GX_MAX_Z24 0x00ffffff
#define DOLPHIN_MTX_TYPES_H
#define DOLPHIN_MTX_FORWARD_H
typedef f32 Mtx[3][4];
typedef f32 (*MtxPtr)[4];
typedef f32 Mtx44[4][4];
typedef f32 (*Mtx44Ptr)[4];
typedef struct IntVec2 IntVec2;
typedef struct IntVec3 IntVec3;
typedef struct S16Vec3 S16Vec3;
typedef struct S32Vec2 S32Vec2;
typedef struct S32Vec3 S32Vec3;
typedef struct S8Vec3 S8Vec3;
typedef struct U8Vec4 U8Vec4;
typedef struct Vec2 Vec2;
typedef struct Vec3 Vec3;
typedef struct Vec4 Quaternion, Vec4;
struct Vec2 {
    f32 x, y;
};
struct Vec3 {
    f32 x, y, z;
};
struct Vec4 {
    f32 x, y, z, w;
};
struct U8Vec4 {
    u8 x, y, z, w;
};
struct S8Vec3 {
    s8 x, y, z;
};
struct S16Vec3 {
    s16 x, y, z;
};
struct S32Vec2 {
    s32 x, y;
};
struct S32Vec3 {
    s32 x, y, z;
};
struct IntVec2 {
    int x, y;
};
struct IntVec3 {
    int x, y, z;
};
// Most of these should be moved to independent headers once they are created
// SOUND EFFECTS
#define SFX_VOLUME_MAX 0x7FU
#define SFX_PAN_MID 0x40U
// HSD_PAD
/// @todo @c PascalCase members
typedef u32 HSD_Pad;
#define HSD_PAD_DPADLEFT (1 << 0)
#define HSD_PAD_DPADRIGHT (1 << 1)
#define HSD_PAD_DPADDOWN (1 << 2)
#define HSD_PAD_DPADUP (1 << 3)
#define HSD_PAD_Z (1 << 4)
#define HSD_PAD_R (1 << 5)
#define HSD_PAD_L (1 << 6)
#define HSD_PAD_7 (1 << 7)
/// @remarks Also covers Z-Button macro in-game.
#define HSD_PAD_A (1 << 8)
#define HSD_PAD_B (1 << 9)
#define HSD_PAD_X (1 << 10)
#define HSD_PAD_Y (1 << 11)
#define HSD_PAD_START (1 << 12)
/// Digital input of either L or R
#define HSD_PAD_LR (1 << 31)
#define HSD_PAD_AB (HSD_PAD_A | HSD_PAD_B)
#define HSD_PAD_XY (HSD_PAD_X | HSD_PAD_Y)
// COLLISION FLAGS
// From Ness's Yo-Yo collision check
/// @todo These (and #CollData::env_flags) should be a bitfield struct
#define MPCOLL_RIGHTWALL 0x3F ///< Bits 0-5
#define MPCOLL_FLAGS_B05 (1 << 5)
#define MPCOLL_LEFTWALL 0xFC0 ///< Bits 6-11
#define MPCOLL_FLAGS_B11 (1 << 11)
#define MPCOLL_CEIL 0x6000 ///< Bits 13-14
#define MPCOLL_FLAGS_B14 (1 << 14)
#define MPCOLL_GRPUSH (1 << 15)
#define MPCOLL_FLAGS_B16 (1 << 16)
#define MPCOLL_FLAGS_B23 (1 << 23)
#define MPCOLL_FLAGS_B24 (1 << 24)
#define MPCOLL_FLAGS_B25 (1 << 25)
typedef union _UnkFlagStruct {
    u8 u8;
    struct {
        u8 b0 : 1;
        u8 b1 : 1;
        u8 b2 : 1;
        u8 b3 : 1;
        u8 b4 : 1;
        u8 b5 : 1;
        u8 b6 : 1;
        u8 b7 : 1;
    } bits;
} UnkFlagStruct;
typedef struct ColorOverlay {
    s32 x0_timer; // 0x0
    s32 x4_pri; // 0x4  this colanims priority, lower = will persist
    s32* x8_ptr1; // 0x8
    s32 xC_loop; // 0xc
    s32* x10_ptr2; // 0x10
    s32 x14; // 0x14
    s32* x18_alloc; // 0x18
    s32 x1c; // 0x1c
    s32 x20; // 0x20
    s32 x24; // 0x24
    s32 x28_colanim; // 0x28, id for the color animation in effect
    GXColor x2C_hex; // 0x2C
    f32 x30_color_red; // 0x30
    f32 x34_color_green; // 0x34
    f32 x38_color_blue; // 0x38
    f32 x3C_color_alpha; // 0x3C
    f32 x40_colorblend_red; // 0x40
    f32 x44_colorblend_green; // 0x44
    f32 x48_colorblend_blue; // 0x48
    f32 x4C_colorblend_alpha; // 0x4C
    GXColor x50_light_color; // 0x50
    f32 x54_light_red; // 0x54
    f32 x58_light_green; // 0x58
    f32 x5C_light_blue; // 0x5C
    f32 x60_light_alpha; // 0x60
    f32 x64_lightblend_red; // 0x64
    f32 x68_lightblend_green; // 0x68
    f32 x6C_lightblend_blue; // 0x6c
    f32 x70_lightblend_alpha; // 0x70
    f32 x74_light_angle; // 0x74
    f32 x78_light_unk; // 0x78
    u8 x7C_color_enable : 1; // 0x7c, 0x80
    u8 x7C_flag2 : 1; // 0x7c, 0x40
    u8 x7C_light_enable : 1; // 0x7c, 0x20
    u8 x7C_flag4 : 1; // 0x7c, 0x10
    u8 x7C_flag5 : 1; // 0x7c, 0x08
    u8 x7C_flag6 : 1; // 0x7c, 0x04
    u8 x7C_flag7 : 1; // 0x7c, 0x02
    u8 x7C_flag8 : 1; // 0x7c, 0x01
} ColorOverlay;
struct r13_ColAnimStruct {
    u32 x0_unk;
    u8 x4_unk;
    u8 x5_unk;
    u8 x6_unk;
    u8 x7_unk;
};
typedef enum GroundOrAir {
    GA_Ground,
    GA_Air,
} GroundOrAir;
#define _STDIO_H_
#define STDARG_H
#define PLACEHOLDER_H
/** @file
 * This header contains macros emitted by m2c in "valid syntax" mode,
 * which can be enabled by passing `--valid-syntax` on the command line.
 *
 * In this mode, unhandled types and expressions are emitted as macros so
 * that the output is compilable without human intervention.
 */
#define M2C_MACROS_H
/* Unknown types */
typedef s32 M2C_UNK;
typedef s8 M2C_UNK8;
typedef s16 M2C_UNK16;
typedef s32 M2C_UNK32;
typedef s64 M2C_UNK64;
/* Unknown field access, like `*(type_ptr) &expr->unk_offset` */
#define M2C_FIELD(expr, type_ptr, offset) (*(type_ptr) ((s8*) (expr) + (offset)))
/* Bitwise (reinterpret) cast */
#define M2C_BITWISE(type, expr) ((type) (expr))
/* Unaligned reads */
#define M2C_LWL(expr) (expr)
#define M2C_FIRST3BYTES(expr) (expr)
#define M2C_UNALIGNED32(expr) (expr)
/* Unhandled instructions */
#define M2C_ERROR(desc) (0)
#define M2C_TRAP_IF(cond) (0)
#define M2C_BREAK() (0)
#define M2C_SYNC() (0)
/* Carry bit from partially-implemented instructions */
#define M2C_CARRY 0
/* Memcpy patterns */
#define M2C_MEMCPY_ALIGNED memcpy
#define M2C_MEMCPY_UNALIGNED memcpy
/// A label in a jump table
typedef void (*jmp_t)(void);
/// A jump table
typedef jmp_t jtbl_t[];
#define NOT_IMPLEMENTED asm { nop }
#define UNK_T M2C_UNK
#define UNK_RET M2C_UNK
#define UNK_PARAMS
#define UNK_SIZE_ARRAY [0]
#define U32_TO_F32 4503599627370496.0
#define S32_TO_F32 4503601774854144.0
#define ASM
#define UNUSED
#define PAD_STACK(bytes) do { UNUSED unsigned char _[(bytes)]; } while (0)
/// @warning Creates fake @c .rodata entries!
#define FORCE_PAD_STACK(bytes) do { UNUSED unsigned char _[(bytes)] = { 0 }; } while (0)
#define FORCE_PAD_STACK_8 do { UNUSED u64 _0 = 0; } while (0)
#define FORCE_PAD_STACK_16 do { UNUSED u64 _0 = 0, _1 = 0; } while (0)
#define FORCE_PAD_STACK_32 do { UNUSED u64 _0 = 0, _1 = 0, _2 = 0, _3 = 0; } while (0)
typedef struct {
    char gpr;
    char fpr;
    char reserved[2];
    char* input_arg_area;
    char* reg_save_area;
} __va_list[1];
typedef __va_list va_list;
void* __va_arg(va_list v_list, unsigned char type);
#define va_start(ap, fmt) ((void) fmt, __builtin_va_info(&ap))
#define va_arg(ap, t) (*((t*) __va_arg(ap, _var_arg_typeof(t))))
#define va_end(ap) (void) 0
typedef struct {
    uint open_mode : 2;
    uint io_mode : 3;
    uint buffer_mode : 2;
    uint file_kind : 3;
    uint file_orientation : 2;
    uint binary_io : 1;
} __file_modes;
int puts(const char* s);
int printf(const char*, ...);
int sprintf(char* s, const char* format, ...);
int vprintf(const char* format, va_list arg);
int vsprintf(char* s, const char* format, va_list arg);
int fwide(FILE* stream, int mode);
#define METROTRK_DOLPHIN_TRK_H
void EnableMetroTRKInterrupts(void);
#define __MEM_TRK_H__
 void* TRK_memcpy(void* dst, const void* src, unsigned long n);
 void* TRK_memset(void* dst, int val, unsigned long n);
#define RUNTIME_GECKO_EXCEPTIONPPC_H
typedef struct __eti_init_info {
    void* eti_start;
    void* eti_end;
    void* code_start;
    unsigned long code_size;
} __eti_init_info;
int __register_fragment(__eti_init_info*, char* TOC);
void __unregister_fragment(int fragmentID);
#define RUNTIME_GECKO_SETJMP_H
typedef struct __jmp_buf {
    unsigned long pc; /*	0: saved PC			*/
    unsigned long cr; /*	4: saved CR			*/
    unsigned long sp; /*  8: saved SP			*/
    unsigned long rtoc; /* 12: saved RTOC		*/
    unsigned long reserved; /* 16: not used			*/
    unsigned long gprs[19]; /* 20: saved R13-R31	*/
    double fp14; /* 96: saved FP14-FP31	 */
    double fp15;
    double fp16;
    double fp17;
    double fp18;
    double fp19;
    double fp20;
    double fp21;
    double fp22;
    double fp23;
    double fp24;
    double fp25;
    double fp26;
    double fp27;
    double fp28;
    double fp29;
    double fp30;
    double fp31;
    double fpscr; /* 240: saved FPSCR		*/
} __jmp_buf;
int __setjmp(register __jmp_buf*);
void longjmp(register __jmp_buf* env, register int val);
#define RUNTIME___INIT_CPP_EXCEPTIONS_H
void __fini_cpp_exceptions(void);
void __init_cpp_exceptions(void);
#define ___mem_
 void* memset(void* dst, int val, unsigned long n);
 void __fill_mem(void* dst, int val, unsigned long n);
 void* memcpy(void* dst, const void* src, unsigned long n);
#define RUNTIME_GLOBAL_DESTRUCTOR_CHAIN_H
void __destroy_global_chain(void);
#define RUNTIME_RUNTIME_H
u64 __shl2i(void*, bool, s8);
void __cvt_sll_flt(void);
void __cvt_dbl_usll(void);
void __cvt_fp2unsigned(void);
#define DOLPHIN_AI_AI
typedef void (*AISCallback)(u32 count);
typedef void (*AIDCallback)(void);
extern vu32 __AIRegs[8] ;
AIDCallback AIRegisterDMACallback(AIDCallback);
void AIInitDMA(u32 addr, u32 length);
void AIStartDMA(void);
void AISetStreamPlayState(u32 state);
u32 AIGetStreamPlayState(void);
void AISetDSPSampleRate(u32 rate);
u32 AIGetDSPSampleRate(void);
void AISetStreamSampleRate(u32 rate);
u32 AIGetStreamSampleRate(void);
void AISetStreamVolLeft(u8 volume);
u8 AIGetStreamVolLeft(void);
void AISetStreamVolRight(u8 volume);
u8 AIGetStreamVolRight(void);
void AIInit(u8* stack);
void AIResetStreamSampleCount(void);
void AISetStreamTrigger(u32 trigger);
#define _AMCEXI2STUBS_H_
void EXI2_Init(void);
void EXI2_EnableInterrupts(void);
bool EXI2_Poll(void);
bool EXI2_ReadN(void);
bool EXI2_WriteN(void);
void EXI2_Reserve(void);
void EXI2_Unreserve(void);
bool AMC_IsStub(void);
#define DOLPHIN_AR_AR_H
// offsets for __DSPRegs[i]
#define DSP_MAILBOX_IN_HI (0)
#define DSP_MAILBOX_IN_LO (1)
#define DSP_MAILBOX_OUT_HI (2)
#define DSP_MAILBOX_OUT_LO (3)
#define DSP_CONTROL_STATUS (5)
#define DSP_ARAM_SIZE (9)
#define DSP_ARAM_MODE (11)
#define DSP_ARAM_REFRESH (13)
#define DSP_ARAM_DMA_MM_HI (16) // Main mem address
#define DSP_ARAM_DMA_MM_LO (17)
#define DSP_ARAM_DMA_ARAM_HI (18) // ARAM address
#define DSP_ARAM_DMA_ARAM_LO (19)
#define DSP_ARAM_DMA_SIZE_HI (20) // DMA buffer size
#define DSP_ARAM_DMA_SIZE_LO (21)
#define DSP_DMA_START_HI (24) // DMA start address
#define DSP_DMA_START_LO (25)
#define DSP_DMA_CONTROL_LEN (27)
#define DSP_DMA_BYTES_LEFT (29)
#define DSP_DMA_START_FLAG (0x8000) // set to start DSP
void ARStartDMA(u32 type, u32 source, u32 dest, u32 length);
Event ARRegisterDMACallback(Event callback);
void __ARChecksize(void);
u32 ARGetBaseAddress(void);
u32 ARGetSize(void);
u32 ARGetDMAStatus(void);
u32 ARAlloc(u32 length);
u32 ARFree(u32* length);
bool ARCheckInit(void);
u32 ARInit(u32* stack_index_addr, u32 num_entries);
#define DOLPHIN_AR_ARQ_H
#define ARQ_CHUNK_SIZE_DEFAULT 4096
typedef enum ARQType {
    ARQ_TYPE_MRAM_TO_ARAM,
    ARQ_TYPE_ARAM_TO_MRAM,
} ARQType;
typedef enum ARQPrio {
    ARQ_PRIORITY_LOW,
    ARQ_PRIORITY_HIGH,
} ARQPrio;
typedef struct ARQRequest ARQRequest;
typedef void (*ARQCallback)(ARQRequest*);
struct ARQRequest {
    ARQRequest* next;
    u32 owner;
    u32 type;
    ARQPrio priority;
    u32 source;
    u32 dest;
    size_t length;
    ARQCallback callback;
};
void ARQInit(void);
void ARQReset(void);
void ARQPostRequest(ARQRequest* task, u32 owner, ARQType type,
                    ARQPrio priority, u32 source, u32 dest, size_t length,
                    ARQCallback callback);
void __ARQServiceQueueLo(void);
void __ARQCallbackHack(ARQRequest*);
void __ARQInitTempQueue(void);
void __ARQPushTempQueue(ARQRequest* task);
void __ARQInterruptServiceRoutine(void);
#define _DOLPHIN_AX_H_
#define __DOLPHIN_DSP_H_
#define DOLPHIN_OS_OSCONTEXT_H
#define __OS_CONTEXT_FRAME 768
#define OS_CONTEXT_R0 0
#define OS_CONTEXT_R1 4
#define OS_CONTEXT_R2 8
#define OS_CONTEXT_R3 12
#define OS_CONTEXT_R4 16
#define OS_CONTEXT_R5 20
#define OS_CONTEXT_R6 24
#define OS_CONTEXT_R7 28
#define OS_CONTEXT_R8 32
#define OS_CONTEXT_R9 36
#define OS_CONTEXT_R10 40
#define OS_CONTEXT_R11 44
#define OS_CONTEXT_R12 48
#define OS_CONTEXT_R13 52
#define OS_CONTEXT_R14 56
#define OS_CONTEXT_R15 60
#define OS_CONTEXT_R16 64
#define OS_CONTEXT_R17 68
#define OS_CONTEXT_R18 72
#define OS_CONTEXT_R19 76
#define OS_CONTEXT_R20 80
#define OS_CONTEXT_R21 84
#define OS_CONTEXT_R22 88
#define OS_CONTEXT_R23 92
#define OS_CONTEXT_R24 96
#define OS_CONTEXT_R25 100
#define OS_CONTEXT_R26 104
#define OS_CONTEXT_R27 108
#define OS_CONTEXT_R28 112
#define OS_CONTEXT_R29 116
#define OS_CONTEXT_R30 120
#define OS_CONTEXT_R31 124
#define OS_CONTEXT_CR 128
#define OS_CONTEXT_LR 132
#define OS_CONTEXT_CTR 136
#define OS_CONTEXT_XER 140
#define OS_CONTEXT_FPR0 144
#define OS_CONTEXT_FPR1 152
#define OS_CONTEXT_FPR2 160
#define OS_CONTEXT_FPR3 168
#define OS_CONTEXT_FPR4 176
#define OS_CONTEXT_FPR5 184
#define OS_CONTEXT_FPR6 192
#define OS_CONTEXT_FPR7 200
#define OS_CONTEXT_FPR8 208
#define OS_CONTEXT_FPR9 216
#define OS_CONTEXT_FPR10 224
#define OS_CONTEXT_FPR11 232
#define OS_CONTEXT_FPR12 240
#define OS_CONTEXT_FPR13 248
#define OS_CONTEXT_FPR14 256
#define OS_CONTEXT_FPR15 264
#define OS_CONTEXT_FPR16 272
#define OS_CONTEXT_FPR17 280
#define OS_CONTEXT_FPR18 288
#define OS_CONTEXT_FPR19 296
#define OS_CONTEXT_FPR20 304
#define OS_CONTEXT_FPR21 312
#define OS_CONTEXT_FPR22 320
#define OS_CONTEXT_FPR23 328
#define OS_CONTEXT_FPR24 336
#define OS_CONTEXT_FPR25 344
#define OS_CONTEXT_FPR26 352
#define OS_CONTEXT_FPR27 360
#define OS_CONTEXT_FPR28 368
#define OS_CONTEXT_FPR29 376
#define OS_CONTEXT_FPR30 384
#define OS_CONTEXT_FPR31 392
#define OS_CONTEXT_FPSCR 400
#define OS_CONTEXT_SRR0 408
#define OS_CONTEXT_SRR1 412
#define OS_CONTEXT_MODE 416
#define OS_CONTEXT_STATE 418
#define OS_CONTEXT_GQR0 420
#define OS_CONTEXT_GQR1 424
#define OS_CONTEXT_GQR2 428
#define OS_CONTEXT_GQR3 432
#define OS_CONTEXT_GQR4 436
#define OS_CONTEXT_GQR5 440
#define OS_CONTEXT_GQR6 444
#define OS_CONTEXT_GQR7 448
#define __OSCONTEXT_PADDING 452
#define OS_CONTEXT_PSF0 456
#define OS_CONTEXT_PSF1 464
#define OS_CONTEXT_PSF2 472
#define OS_CONTEXT_PSF3 480
#define OS_CONTEXT_PSF4 488
#define OS_CONTEXT_PSF5 496
#define OS_CONTEXT_PSF6 504
#define OS_CONTEXT_PSF7 512
#define OS_CONTEXT_PSF8 520
#define OS_CONTEXT_PSF9 528
#define OS_CONTEXT_PSF10 536
#define OS_CONTEXT_PSF11 544
#define OS_CONTEXT_PSF12 552
#define OS_CONTEXT_PSF13 560
#define OS_CONTEXT_PSF14 568
#define OS_CONTEXT_PSF15 576
#define OS_CONTEXT_PSF16 584
#define OS_CONTEXT_PSF17 592
#define OS_CONTEXT_PSF18 600
#define OS_CONTEXT_PSF19 608
#define OS_CONTEXT_PSF20 616
#define OS_CONTEXT_PSF21 624
#define OS_CONTEXT_PSF22 632
#define OS_CONTEXT_PSF23 640
#define OS_CONTEXT_PSF24 648
#define OS_CONTEXT_PSF25 656
#define OS_CONTEXT_PSF26 664
#define OS_CONTEXT_PSF27 672
#define OS_CONTEXT_PSF28 680
#define OS_CONTEXT_PSF29 688
#define OS_CONTEXT_PSF30 696
#define OS_CONTEXT_PSF31 704
#define OS_CONTEXT_STATE_EXC 0x02u
#define OS_CONTEXT_STATE_FPSAVED 0x01u
typedef struct OSContext {
    u32 gprs[32]; // at 0x0
    u32 cr; // at 0x80
    u32 lr; // at 0x84
    u32 ctr; // at 0x88
    u32 xer; // at 0x8C
    f64 fprs[32]; // at 0x90
    f64 fpscr; // at 0x190
    u32 srr0; // at 0x198
    u32 srr1; // at 0x19C
    u16 mode; // at 0x1A0
    u16 state; // at 0x1A2
    u32 gqrs[8]; // at 0x1A4
    f64 psfs[32]; // at 0x1C8
} OSContext;
extern OSContext* OS_CURRENT_CONTEXT ;
extern OSContext* OS_CURRENT_FPU_CONTEXT ;
void OSSaveFPUContext(OSContext*);
void OSSetCurrentContext(OSContext*);
OSContext* OSGetCurrentContext(void);
bool OSSaveContext(OSContext*);
void OSLoadContext(OSContext*);
void* OSGetStackPointer(void);
void OSSwitchFiber(void*, void*);
void OSSwitchFiberEx(u32, u32, u32, u32, void*, void*);
void OSClearContext(OSContext*);
void OSInitContext(OSContext* ctx, u32 pc, u32 newsp);
void OSDumpContext(const OSContext*);
void __OSContextInit(void);
void __OSLoadFPUContext(u32 _, OSContext* fpuctx);
void OSLoadFPUContext(OSContext* fpuctx);
void __OSSaveFPUContext(u32 unused1, u32 unused2, OSContext* fpuctx);
// https://github.com/kiwi515/open_rvl/blob/605e2a99ad053441f0ebb9b322a18433f92025e2/include/OS/OSInterrupt.h
#define _OS_INTERRUPT_H_
#define _DOLPHIN_OS_EXCEPTION_
typedef enum OSException {
    OS_EXCEPTION_FLOATING_POINT = 7,
    OS_EXCEPTION_COUNT = 15,
} OSException;
typedef u8 __OSException;
typedef void (*__OSExceptionHandler)(__OSException exception,
                                     OSContext* context);
#define OS_EXCEPTION_SAVE_GPRS(context) stw r0, OS_CONTEXT_R0(context); stw r1, OS_CONTEXT_R1(context); stw r2, OS_CONTEXT_R2(context); stmw r6, OS_CONTEXT_R6(context); mfspr r0, GQR1; stw r0, OS_CONTEXT_GQR1(context); mfspr r0, GQR2; stw r0, OS_CONTEXT_GQR2(context); mfspr r0, GQR3; stw r0, OS_CONTEXT_GQR3(context); mfspr r0, GQR4; stw r0, OS_CONTEXT_GQR4(context); mfspr r0, GQR5; stw r0, OS_CONTEXT_GQR5(context); mfspr r0, GQR6; stw r0, OS_CONTEXT_GQR6(context); mfspr r0, GQR7; stw r0, OS_CONTEXT_GQR7(context);
#define OS_INTRMASK_MEM_0 (0x80000000U >> OS_INTR_MEM_0)
#define OS_INTRMASK_MEM_1 (0x80000000U >> OS_INTR_MEM_1)
#define OS_INTRMASK_MEM_2 (0x80000000U >> OS_INTR_MEM_2)
#define OS_INTRMASK_MEM_3 (0x80000000U >> OS_INTR_MEM_3)
#define OS_INTRMASK_MEM_ADDRESS (0x80000000U >> OS_INTR_MEM_ADDRESS)
#define OS_INTRMASK_DSP_AI (0x80000000U >> OS_INTR_DSP_AI)
#define OS_INTRMASK_DSP_ARAM (0x80000000U >> OS_INTR_DSP_ARAM)
#define OS_INTRMASK_DSP_DSP (0x80000000U >> OS_INTR_DSP_DSP)
#define OS_INTRMASK_AI_AI (0x80000000U >> OS_INTR_AI_AI)
#define OS_INTRMASK_EXI_0_EXI (0x80000000U >> OS_INTR_EXI_0_EXI)
#define OS_INTRMASK_EXI_0_TC (0x80000000U >> OS_INTR_EXI_0_TC)
#define OS_INTRMASK_EXI_0_EXT (0x80000000U >> OS_INTR_EXI_0_EXT)
#define OS_INTRMASK_EXI_1_EXI (0x80000000U >> OS_INTR_EXI_1_EXI)
#define OS_INTRMASK_EXI_1_TC (0x80000000U >> OS_INTR_EXI_1_TC)
#define OS_INTRMASK_EXI_1_EXT (0x80000000U >> OS_INTR_EXI_1_EXT)
#define OS_INTRMASK_EXI_2_EXI (0x80000000U >> OS_INTR_EXI_2_EXI)
#define OS_INTRMASK_EXI_2_TC (0x80000000U >> OS_INTR_EXI_2_TC)
#define OS_INTRMASK_PI_CP (0x80000000U >> OS_INTR_PI_CP)
#define OS_INTRMASK_PI_PE_TOKEN (0x80000000U >> OS_INTR_PI_PE_TOKEN)
#define OS_INTRMASK_PI_PE_FINISH (0x80000000U >> OS_INTR_PI_PE_FINISH)
#define OS_INTRMASK_PI_SI (0x80000000U >> OS_INTR_PI_SI)
#define OS_INTRMASK_PI_DI (0x80000000U >> OS_INTR_PI_DI)
#define OS_INTRMASK_PI_RSW (0x80000000U >> OS_INTR_PI_RSW)
#define OS_INTRMASK_PI_ERROR (0x80000000U >> OS_INTR_PI_ERROR)
#define OS_INTRMASK_PI_VI (0x80000000U >> OS_INTR_PI_VI)
#define OS_INTRMASK_PI_DEBUG (0x80000000U >> OS_INTR_PI_DEBUG)
#define OS_INTRMASK_PI_HSP (0x80000000U >> OS_INTR_PI_HSP)
#define OS_INTRMASK_MEM (OS_INTRMASK_MEM_0 | OS_INTRMASK_MEM_1 | OS_INTRMASK_MEM_2 | OS_INTRMASK_MEM_3 | OS_INTRMASK_MEM_ADDRESS)
#define OS_INTRMASK_AI (OS_INTRMASK_AI_AI)
#define OS_INTRMASK_DSP (OS_INTRMASK_DSP_AI | OS_INTRMASK_DSP_ARAM | OS_INTRMASK_DSP_DSP)
#define OS_INTRMASK_EXI_0 (OS_INTRMASK_EXI_0_EXI | OS_INTRMASK_EXI_0_TC | OS_INTRMASK_EXI_0_EXT)
#define OS_INTRMASK_EXI_1 (OS_INTRMASK_EXI_1_EXI | OS_INTRMASK_EXI_1_TC | OS_INTRMASK_EXI_1_EXT)
#define OS_INTRMASK_EXI_2 (OS_INTRMASK_EXI_2_EXI | OS_INTRMASK_EXI_2_TC)
#define OS_INTRMASK_EXI (OS_INTRMASK_EXI_0_EXI | OS_INTRMASK_EXI_0_TC | OS_INTRMASK_EXI_0_EXT | OS_INTRMASK_EXI_1_EXI | OS_INTRMASK_EXI_1_TC | OS_INTRMASK_EXI_1_EXT | OS_INTRMASK_EXI_2_EXI | OS_INTRMASK_EXI_2_TC)
#define OS_INTRMASK_PI (OS_INTRMASK_PI_CP | OS_INTRMASK_PI_SI | OS_INTRMASK_PI_DI | OS_INTRMASK_PI_RSW | OS_INTRMASK_PI_ERROR | OS_INTRMASK_PI_VI | OS_INTRMASK_PI_PE_TOKEN | OS_INTRMASK_PI_PE_FINISH | OS_INTRMASK_PI_DEBUG | OS_INTRMASK_PI_HSP)
#define OS_INTRMASK_PI_PE (OS_INTRMASK_PI_PE_TOKEN | OS_INTRMASK_PI_PE_FINISH)
typedef enum OSInterruptType {
    OS_INTR_MEM_0,
    OS_INTR_MEM_1,
    OS_INTR_MEM_2,
    OS_INTR_MEM_3,
    OS_INTR_MEM_ADDRESS,
    OS_INTR_DSP_AI,
    OS_INTR_DSP_ARAM,
    OS_INTR_DSP_DSP,
    OS_INTR_AI_AI,
    OS_INTR_EXI_0_EXI,
    OS_INTR_EXI_0_TC,
    OS_INTR_EXI_0_EXT,
    OS_INTR_EXI_1_EXI,
    OS_INTR_EXI_1_TC,
    OS_INTR_EXI_1_EXT,
    OS_INTR_EXI_2_EXI,
    OS_INTR_EXI_2_TC,
    OS_INTR_PI_CP,
    OS_INTR_PI_PE_TOKEN,
    OS_INTR_PI_PE_FINISH,
    OS_INTR_PI_SI,
    OS_INTR_PI_DI,
    OS_INTR_PI_RSW,
    OS_INTR_PI_ERROR,
    OS_INTR_PI_VI,
    OS_INTR_PI_DEBUG,
    OS_INTR_PI_HSP,
    OS_INTR_PI_ACR,
    OS_INTR_28,
    OS_INTR_29,
    OS_INTR_30,
    OS_INTR_31,
    OS_INTR_MAX
} OSInterruptType;
typedef s16 __OSInterrupt;
typedef void (*__OSInterruptHandler)(__OSInterrupt interrupt,
                                     OSContext* context);
typedef u32 OSInterruptMask;
extern volatile u32 __OSLastInterruptSrr0;
extern volatile s16 __OSLastInterrupt;
extern volatile s64 __OSLastInterruptTime;
/// @sz{4}
extern M2C_UNK lbl_804D738C;
void __RAS_OSDisableInterrupts_begin(void);
void __RAS_OSDisableInterrupts_end(void);
bool OSDisableInterrupts(void);
bool OSEnableInterrupts(void);
bool OSRestoreInterrupts(bool);
__OSInterruptHandler __OSSetInterruptHandler(__OSInterrupt,
                                             __OSInterruptHandler);
__OSInterruptHandler __OSGetInterruptHandler(__OSInterrupt);
void __OSInterruptInit(void);
u32 __OSMaskInterrupts(u32);
u32 __OSUnmaskInterrupts(u32);
u32 SetInterruptMask(OSInterruptMask mask, OSInterruptMask current);
void __OSDispatchInterrupt(__OSException exception, OSContext* context);
#define __DOLPHIN_OSTIME_H_
typedef s64 OSTime;
typedef u32 OSTick;
typedef struct OSCalendarTime {
    int sec; // seconds after the minute [0, 61]
    int min; // minutes after the hour [0, 59]
    int hour; // hours since midnight [0, 23]
    int mday; // day of the month [1, 31]
    int mon; // month since January [0, 11]
    int year; // years in AD [1, ...]
    int wday; // days since Sunday [0, 6]
    int yday; // days since January 1 [0, 365]
    int msec; // milliseconds after the second [0,999]
    int usec; // microseconds after the millisecond [0,999]
} OSCalendarTime;
void OSTicksToCalendarTime(OSTime ticks, OSCalendarTime* td);
OSTime OSGetTime(void);
OSTick OSGetTick(void);
OSTime __OSTimeToSystemTime(OSTime);
OSTime __OSGetSystemTime(void);
extern u32 __OSBusClock ;
#define OS_BUS_CLOCK __OSBusClock
#define OS_TIMER_CLOCK (OS_BUS_CLOCK / 4)
#define OSTicksToSeconds(ticks) ((ticks) / (OS_TIMER_CLOCK))
#define OSTicksToMilliseconds(ticks) ((ticks) / (OS_TIMER_CLOCK / 1000))
#define OSTicksToMicroseconds(ticks) (((ticks) * 8) / (OS_TIMER_CLOCK / 125000))
#define OSSecondsToTicks(sec) ((sec) * (OS_TIMER_CLOCK))
#define OSMillisecondsToTicks(msec) ((msec) * (OS_TIMER_CLOCK / 1000))
#define OSMicrosecondsToTicks(usec) (((usec) * (OS_TIMER_CLOCK / 125000)) / 8)
#define OSNanosecondsToTicks(nsec) (((nsec) * (OS_TIMER_CLOCK / 125000)) / 8000)
#define HW_REG(reg, type) *(volatile type*) (uintptr_t) (reg)
extern volatile u16 __DSPRegs[] ;
typedef void (*DSPCallback)(void* task);
typedef struct _DSPTaskInfo {
    /*0x00*/ volatile u32 state;
    /*0x04*/ volatile u32 priority;
    /*0x08*/ volatile u32 flags;
    /*0x0C*/ u16* iram_mmem_addr;
    /*0x10*/ u32 iram_length;
    /*0x14*/ u32 iram_addr;
    /*0x18*/ u16* dram_mmem_addr;
    /*0x1C*/ u32 dram_length;
    /*0x20*/ u32 dram_addr;
    /*0x24*/ u16 dsp_init_vector;
    /*0x26*/ u16 dsp_resume_vector;
    /*0x28*/ DSPCallback init_cb;
    /*0x2C*/ DSPCallback res_cb;
    /*0x30*/ DSPCallback done_cb;
    /*0x34*/ DSPCallback req_cb;
    /*0x38*/ struct _DSPTaskInfo* next;
    /*0x3C*/ struct _DSPTaskInfo* prev;
    OSTime t_context;
    OSTime t_task;
} DSPTaskInfo;
u32 DSPCheckMailToDSP(void);
u32 DSPCheckMailFromDSP(void);
u32 DSPReadMailFromDSP(void);
void DSPSendMailToDSP(u32 mail);
void DSPInit(void);
bool DSPCheckInit(void);
void __DSP_debug_printf(const char* fmt, ...);
void __DSPHandler(__OSInterrupt intr, OSContext* ctx);
void __DSP_boot_task(DSPTaskInfo* task);
void __DSP_insert_task(DSPTaskInfo* task);
void __DSP_remove_task(DSPTaskInfo* task);
DSPTaskInfo* DSPAddTask(DSPTaskInfo* task);
void __DSP_exec_task(DSPTaskInfo*, DSPTaskInfo*);
void DSPCancelTask(void);
void* DSPAssertTask(DSPTaskInfo* task);
typedef struct _AXPBMIX {
    /* 0x00 */ u16 vL;
    /* 0x02 */ u16 vDeltaL;
    /* 0x04 */ u16 vR;
    /* 0x06 */ u16 vDeltaR;
    /* 0x08 */ u16 vAuxAL;
    /* 0x0A */ u16 vDeltaAuxAL;
    /* 0x0C */ u16 vAuxAR;
    /* 0x0E */ u16 vDeltaAuxAR;
    /* 0x10 */ u16 vAuxBL;
    /* 0x12 */ u16 vDeltaAuxBL;
    /* 0x14 */ u16 vAuxBR;
    /* 0x16 */ u16 vDeltaAuxBR;
    /* 0x18 */ u16 vAuxBS;
    /* 0x1A */ u16 vDeltaAuxBS;
    /* 0x1C */ u16 vS;
    /* 0x1E */ u16 vDeltaS;
    /* 0x20 */ u16 vAuxAS;
    /* 0x22 */ u16 vDeltaAuxAS;
} AXPBMIX;
typedef struct _AXPBITD {
    /* 0x00 */ u16 flag;
    /* 0x02 */ u16 bufferHi;
    /* 0x04 */ u16 bufferLo;
    /* 0x06 */ u16 shiftL;
    /* 0x08 */ u16 shiftR;
    /* 0x0A */ u16 targetShiftL;
    /* 0x0C */ u16 targetShiftR;
} AXPBITD;
typedef struct _AXPBUPDATE {
    /* 0x00 */ u16 updNum[5];
    /* 0x0A */ u16 dataHi;
    /* 0x0C */ u16 dataLo;
} AXPBUPDATE;
typedef struct _AXPBDPOP {
    /* 0x00 */ s16 aL;
    /* 0x02 */ s16 aAuxAL;
    /* 0x04 */ s16 aAuxBL;
    /* 0x06 */ s16 aR;
    /* 0x08 */ s16 aAuxAR;
    /* 0x0A */ s16 aAuxBR;
    /* 0x0C */ s16 aS;
    /* 0x0E */ s16 aAuxAS;
    /* 0x10 */ s16 aAuxBS;
} AXPBDPOP;
typedef struct _AXPBVE {
    /* 0x00 */ u16 currentVolume;
    /* 0x02 */ s16 currentDelta;
} AXPBVE;
typedef struct _AXPBFIR {
    /* 0x00 */ u16 numCoefs;
    /* 0x02 */ u16 coefsHi;
    /* 0x04 */ u16 coefsLo;
} AXPBFIR;
typedef struct _AXPBADDR {
    /* 0x00 */ u16 loopFlag;
    /* 0x02 */ u16 format;
    /* 0x04 */ u16 loopAddressHi;
    /* 0x06 */ u16 loopAddressLo;
    /* 0x08 */ u16 endAddressHi;
    /* 0x0A */ u16 endAddressLo;
    /* 0x0C */ u16 currentAddressHi;
    /* 0x0E */ u16 currentAddressLo;
} AXPBADDR;
typedef struct _AXPBADPCM {
    /* 0x00 */ u16 a[8][2];
    /* 0x20 */ u16 gain;
    /* 0x22 */ u16 pred_scale;
    /* 0x24 */ u16 yn1;
    /* 0x26 */ u16 yn2;
} AXPBADPCM;
typedef struct _AXPBSRC {
    /* 0x00 */ u16 ratioHi;
    /* 0x02 */ u16 ratioLo;
    /* 0x04 */ u16 currentAddressFrac;
    /* 0x06 */ u16 last_samples[4];
} AXPBSRC;
typedef struct _AXPBADPCMLOOP {
    /* 0x00 */ u16 loop_pred_scale;
    /* 0x02 */ u16 loop_yn1;
    /* 0x04 */ u16 loop_yn2;
} AXPBADPCMLOOP;
typedef struct _AXPB {
    /* 0x00 */ u16 nextHi;
    /* 0x02 */ u16 nextLo;
    /* 0x04 */ u16 currHi;
    /* 0x06 */ u16 currLo;
    /* 0x08 */ u16 srcSelect;
    /* 0x0A */ u16 coefSelect;
    /* 0x0C */ u16 mixerCtrl;
    /* 0x0E */ u16 state;
    /* 0x10 */ u16 type;
    /* 0x12 */ AXPBMIX mix;
    /* 0x36 */ AXPBITD itd;
    /* 0x44 */ AXPBUPDATE update;
    /* 0x52 */ AXPBDPOP dpop;
    /* 0x64 */ AXPBVE ve;
    /* 0x68 */ AXPBFIR fir;
    /* 0x6E */ AXPBADDR addr;
    /* 0x7E */ AXPBADPCM adpcm;
    /* 0xA6 */ AXPBSRC src;
    /* 0xB4 */ AXPBADPCMLOOP adpcmLoop;
    /* 0xBA */ u16 pad[3];
} AXPB;
typedef struct _AXVPB {
    /* 0x000 */ void* next;
    /* 0x004 */ void* prev;
    /* 0x008 */ void* next1;
    /* 0x00C */ u32 priority;
    /* 0x010 */ void (*callback)(void*);
    /* 0x014 */ u32 userContext;
    /* 0x018 */ u32 index;
    /* 0x01C */ u32 sync;
    /* 0x020 */ u32 depop;
    /* 0x024 */ u32 updateMS;
    /* 0x028 */ u32 updateCounter;
    /* 0x02C */ u32 updateTotal;
    /* 0x030 */ u16* updateWrite;
    /* 0x034 */ u16 updateData[128];
    /* 0x134 */ void* itdBuffer;
    /* 0x138 */ AXPB pb;
} AXVPB;
typedef struct _AXPBITDBUFFER {
    /* 0x00 */ s16 data[32];
} AXPBITDBUFFER;
typedef struct _AXPBU {
    /* 0x00 */ u16 data[128];
} AXPBU;
typedef struct _AXSPB {
    /* 0x00 */ u16 dpopLHi;
    /* 0x02 */ u16 dpopLLo;
    /* 0x04 */ s16 dpopLDelta;
    /* 0x06 */ u16 dpopRHi;
    /* 0x08 */ u16 dpopRLo;
    /* 0x0A */ s16 dpopRDelta;
    /* 0x0C */ u16 dpopSHi;
    /* 0x0E */ u16 dpopSLo;
    /* 0x10 */ s16 dpopSDelta;
    /* 0x12 */ u16 dpopALHi;
    /* 0x14 */ u16 dpopALLo;
    /* 0x16 */ s16 dpopALDelta;
    /* 0x18 */ u16 dpopARHi;
    /* 0x1A */ u16 dpopARLo;
    /* 0x1C */ s16 dpopARDelta;
    /* 0x1E */ u16 dpopASHi;
    /* 0x20 */ u16 dpopASLo;
    /* 0x22 */ s16 dpopASDelta;
    /* 0x24 */ u16 dpopBLHi;
    /* 0x26 */ u16 dpopBLLo;
    /* 0x28 */ s16 dpopBLDelta;
    /* 0x2A */ u16 dpopBRHi;
    /* 0x2C */ u16 dpopBRLo;
    /* 0x2E */ s16 dpopBRDelta;
    /* 0x30 */ u16 dpopBSHi;
    /* 0x32 */ u16 dpopBSLo;
    /* 0x34 */ s16 dpopBSDelta;
} AXSPB;
typedef struct _AXPROFILE {
    /* 0x00 */ u64 axFrameStart;
    /* 0x08 */ u64 auxProcessingStart;
    /* 0x10 */ u64 auxProcessingEnd;
    /* 0x18 */ u64 userCallbackStart;
    /* 0x20 */ u64 userCallbackEnd;
    /* 0x28 */ u64 axFrameEnd;
    /* 0x30 */ u32 axNumVoices;
} AXPROFILE;
struct AX_AUX_DATA {
    /* 0x00 */ long* l;
    /* 0x00 */ long* r;
    /* 0x00 */ long* s;
};
#define AX_DSP_SLAVE_LENGTH 3264
#define AX_MAX_VOICES 64
#define AX_SRC_TYPE_NONE 0
#define AX_SRC_TYPE_LINEAR 1
#define AX_SRC_TYPE_4TAP_8K 2
#define AX_SRC_TYPE_4TAP_12K 3
#define AX_SRC_TYPE_4TAP_16K 4
// sync flags
#define AX_SYNC_FLAG_COPYALL (1 << 31)
#define AX_SYNC_FLAG_UNK1 (1 << 30) // reserved, unused?
#define AX_SYNC_FLAG_UNK2 (1 << 29) // reserved, unused?
#define AX_SYNC_FLAG_UNK3 (1 << 28) // reserved, unused?
#define AX_SYNC_FLAG_UNK4 (1 << 27) // reserved, unused?
#define AX_SYNC_FLAG_UNK5 (1 << 26) // reserved, unused?
#define AX_SYNC_FLAG_UNK6 (1 << 25) // reserved, unused?
#define AX_SYNC_FLAG_UNK7 (1 << 24) // reserved, unused?
#define AX_SYNC_FLAG_UNK8 (1 << 23) // reserved, unused?
#define AX_SYNC_FLAG_UNK9 (1 << 22) // reserved, unused?
#define AX_SYNC_FLAG_UNK10 (1 << 21) // reserved, unused?
#define AX_SYNC_FLAG_COPYADPCMLOOP (1 << 20)
#define AX_SYNC_FLAG_COPYRATIO (1 << 19)
#define AX_SYNC_FLAG_COPYSRC (1 << 18)
#define AX_SYNC_FLAG_COPYADPCM (1 << 17)
#define AX_SYNC_FLAG_COPYCURADDR (1 << 16)
#define AX_SYNC_FLAG_COPYENDADDR (1 << 15)
#define AX_SYNC_FLAG_COPYLOOPADDR (1 << 14)
#define AX_SYNC_FLAG_COPYLOOP (1 << 13)
#define AX_SYNC_FLAG_COPYADDR (1 << 12)
#define AX_SYNC_FLAG_COPYFIR (1 << 11)
#define AX_SYNC_FLAG_SWAPVOL (1 << 10)
#define AX_SYNC_FLAG_COPYVOL (1 << 9)
#define AX_SYNC_FLAG_COPYDPOP (1 << 8)
#define AX_SYNC_FLAG_COPYUPDATE (1 << 7)
#define AX_SYNC_FLAG_COPYTSHIFT (1 << 6)
#define AX_SYNC_FLAG_COPYITD (1 << 5)
#define AX_SYNC_FLAG_COPYAXPBMIX (1 << 4)
#define AX_SYNC_FLAG_COPYTYPE (1 << 3)
#define AX_SYNC_FLAG_COPYSTATE (1 << 2)
#define AX_SYNC_FLAG_COPYMXRCTRL (1 << 1)
#define AX_SYNC_FLAG_COPYSELECT (1 << 0)
#define AX_PRIORITY_STACKS 32
// AX.c
void AXInit(void);
void AXQuit(void);
// AXAlloc.c
void AXFreeVoice(AXVPB* p);
AXVPB* AXAcquireVoice(u32 priority, void (*callback)(void*), u32 userContext);
void AXSetVoicePriority(AXVPB* p, u32 priority);
// AXAux.c
void AXRegisterAuxACallback(void (*callback)(void*, void*), void* context);
void AXRegisterAuxBCallback(void (*callback)(void*, void*), void* context);
// AXCL.c
void AXSetMode(u32 mode);
u32 AXGetMode(void);
// AXOut.c
extern AXPROFILE __AXLocalProfile;
extern DSPTaskInfo task;
extern u16 ax_dram_image[8192];
// AXProf.c
void AXInitProfile(AXPROFILE* profile, u32 maxProfiles);
u32 AXGetProfile(void);
// AXVPB.c
void AXSetVoiceSrcType(AXVPB* p, u32 type);
void AXSetVoiceState(AXVPB* p, u16 state);
void AXSetVoiceType(AXVPB* p, u16 type);
void AXSetVoiceMix(AXVPB* p, AXPBMIX* mix);
void AXSetVoiceItdOn(AXVPB* p);
void AXSetVoiceItdTarget(AXVPB* p, u16 lShift, u16 rShift);
void AXSetVoiceUpdateIncrement(AXVPB* p);
void AXSetVoiceUpdateWrite(AXVPB* p, u16 param, u16 data);
void AXSetVoiceDpop(AXVPB* p, AXPBDPOP* dpop);
void AXSetVoiceVe(AXVPB* p, AXPBVE* ve);
void AXSetVoiceVeDelta(AXVPB* p, s16 delta);
void AXSetVoiceFir(AXVPB* p, AXPBFIR* fir);
void AXSetVoiceAddr(AXVPB* p, AXPBADDR* addr);
void AXSetVoiceLoop(AXVPB* p, u16 loop);
void AXSetVoiceLoopAddr(AXVPB* p, u32 addr);
void AXSetVoiceEndAddr(AXVPB* p, u32 addr);
void AXSetVoiceCurrentAddr(AXVPB* p, u32 addr);
void AXSetVoiceAdpcm(AXVPB* p, AXPBADPCM* adpcm);
void AXSetVoiceSrc(AXVPB* p, AXPBSRC* src_);
void AXSetVoiceSrcRatio(AXVPB* p, float ratio);
void AXSetVoiceAdpcmLoop(AXVPB* p, AXPBADPCMLOOP* adpcmloop);
void AXSetMaxDspCycles(u32 cycles);
u32 AXGetMaxDspCycles(void);
u32 AXGetDspCycles(void);
// DSPCode.c
extern u16 axDspSlaveLength;
extern u16 axDspSlave[3264];
#define DOLPHIN_AX_AX_H
void AXInitEx(void);
#define DOLPHIN_AX_AXALLOC_H
AXVPB* __AXGetStackHead(u32 priority);
void __AXServiceCallbackStack(void);
void __AXInitVoiceStacks(void);
void __AXAllocInit(void);
void __AXAllocQuit(void);
void __AXPushFreeStack(AXVPB* p);
AXVPB* __AXPopFreeStack(void);
void __AXPushCallbackStack(AXVPB* p);
AXVPB* __AXPopCallbackStack(void);
void __AXRemoveFromStack(AXVPB* p);
void __AXPushStackHead(AXVPB* p, u32 priority);
AXVPB* __AXPopStackFromBottom(u32 priority);
#define DOLPHIN_AX_AXAUX_H
void __AXAuxInit(void);
void __AXAuxQuit(void);
void __AXGetAuxAInput(u32* p);
void __AXGetAuxAOutput(u32* p);
void __AXGetAuxBInput(u32* p);
void __AXGetAuxBOutput(u32* p);
void __AXProcessAux(void);
#define DOLPHIN_AX_AXCL_H
void __AXClInit(void);
#define DOLPHIN_AX_AXINIT_H
void __AXAuxInit(void);
#define DOLPHIN_AX_AXOUT_H
void __AXOutInit(void);
#define DOLPHIN_AX_AXPROF_H
AXPROFILE* __AXGetCurrentProfile(void);
void AXInitProfile(AXPROFILE* profile, u32 maxProfiles);
u32 AXGetProfile(void);
#define DOLPHIN_AX_AXSPB_H
void __AXSPBInit(void);
#define DOLPHIN_AX_AXVPB_H
u32 __AXGetNumVoices(void);
void __AXServiceVPB(AXVPB* pvpb);
void __AXDumpVPB(AXVPB* pvpb);
void __AXSyncPBs(u32 lessDspCycles);
AXPB* __AXGetPBs(void);
void __AXSetPBDefault(AXVPB* p);
void __AXVPBInit(void);
void __AXVPBQuit(void);
#define DOLPHIN_AXFX_AXFX_H
void* AXFXAllocFunction(size_t size);
void AXFXFreeFunction(void* ptr);
void AXFXSetHooks(void* (*alloc_hook)(size_t), void (*free_hook)(void*));
#define DOLPHIN_BASE_PPCARCH_H
// Gekko registers
#define GQR0 0x390
#define GQR1 0x391
#define GQR2 0x392
#define GQR3 0x393
#define GQR4 0x394
#define GQR5 0x395
#define GQR6 0x396
#define GQR7 0x397
u32 PPCMfmsr(void);
void PPCMtmsr(u32);
u32 PPCMfhid0(void);
void PPCMthid0(u32);
u32 PPCMfl2cr(void);
void PPCMtl2cr(u32);
void PPCMtdec(u32);
void PPCSync(void);
 void PPCHalt(void);
u32 PPCMfhid2(void);
void PPCMtwpar(u32);
void PPCDisableSpeculation(void);
void PPCSetFpNonIEEEMode(void);
void PPCMthid2(u32);
#define DOLPHIN_CARD_H
#define DOLPHIN_CARD_FORWARD_H
#define _DOLPHIN_OS_H__
#define OS_SOUND_MODE_MONO 0
#define OS_SOUND_MODE_STEREO 1
#define OSRoundUp32B(x) (((u32) (x) + 32 - 1) & ~(32 - 1))
#define OSRoundDown32B(x) (((u32) (x)) & ~(32 - 1))
#define OS_CACHED_REGION_PREFIX 0x8000
#define OS_BASE_CACHED (OS_CACHED_REGION_PREFIX << 16)
#define OSPhysicalToCached(paddr) ((void*) ((u32) (paddr) + OS_BASE_CACHED))
#define OSPhysicalToUncached(paddr) ((void*) ((u32) (paddr) -0x40000000))
#define DOLPHIN_OS_OSALARM_H
typedef struct OSAlarm OSAlarm;
typedef void (*OSAlarmHandler)(OSAlarm* alarm, OSContext* context);
struct OSAlarm {
    OSAlarmHandler handler;
    u32 tag;
    OSTime fire;
    OSAlarm* prev;
    OSAlarm* next;
    OSTime period;
    OSTime start;
};
void OSSetAlarm(OSAlarm* alarm, OSTime tick, OSAlarmHandler handler);
void OSCancelAlarm(OSAlarm* alarm);
void OSInitAlarm(void);
void OSCreateAlarm(OSAlarm* alarm);
void OSSetPeriodicAlarm(OSAlarm* alarm, OSTime start, OSTime period,
                        OSAlarmHandler handler);
#define __DOLPHIN_OSALLOC_H_
typedef struct _HeapCell {
    struct _HeapCell* prev;
    struct _HeapCell* next;
    size_t size;
} HeapCell;
typedef struct _Heap {
    s32 size;
    struct _HeapCell* free; // linked list of free cells
    struct _HeapCell* allocated; // linked list of allocated cells
} Heap;
typedef int OSHeapHandle;
extern volatile OSHeapHandle __OSCurrHeap;
void* OSInitAlloc(void*, void*, int);
OSHeapHandle OSCreateHeap(void*, void*);
void OSDestroyHeap(size_t idx);
OSHeapHandle OSSetCurrentHeap(OSHeapHandle);
void* OSAllocFromHeap(OSHeapHandle heap, size_t size);
size_t OSCheckHeap(OSHeapHandle);
void OSFreeToHeap(OSHeapHandle heap, void* ptr);
#define OSAlloc(size) OSAllocFromHeap(__OSCurrHeap, (size))
#define OSFree(ptr) OSFreeToHeap(__OSCurrHeap, (ptr))
#define __DOLPHIN_OSARENA_H_
void* OSGetArenaHi(void);
void* OSGetArenaLo(void);
void OSSetArenaHi(void* addr);
void OSSetArenaLo(void* addr);
void* OSAllocFromArenaLo(u32 size, u32 align);
void* OSAllocFromArenaHi(u32 size, u32 align);
#define _OSCACHE_H_
void DCFlushRange(void* addr, size_t nbytes);
void DCStoreRange(void* addr, size_t nbytes);
void DCInvalidateRange(void* addr, size_t nbytes);
void DCFlushRangeNoSync(void* addr, size_t nbytes);
void ICFlashInvalidate(void);
void ICInvalidateRange(void* addr, size_t nbytes);
void LCDisable(void);
void __OSCacheInit(void);
void DCZeroRange(register void* addr, register size_t nbytes);
void ICEnable(void);
void __LCEnable(void);
void DCEnable(void);
void LCEnable(void);
u32 LCStoreData(void* destAddr, void* srcAddr, u32 nBytes);
void LCQueueWait(register u32 len);
void L2GlobalInvalidate(void);
void L2Enable(void);
void LCStoreBlocks(void* dst, void* src, u32 nblocks);
#define DOLPHIN_OS_OSERROR_H
#define OS_ERROR_SYSTEM_RESET 0
#define OS_ERROR_MACHINE_CHECK 1
#define OS_ERROR_DSI 2
#define OS_ERROR_ISI 3
#define OS_ERROR_EXTERNAL_INTERRUPT 4
#define OS_ERROR_ALIGNMENT 5
#define OS_ERROR_PROGRAM 6
#define OS_ERROR_FLOATING_POINT 7
#define OS_ERROR_DECREMENTER 8
#define OS_ERROR_SYSTEM_CALL 9
#define OS_ERROR_TRACE 10
#define OS_ERROR_PERFORMACE_MONITOR 11
#define OS_ERROR_BREAKPOINT 12
#define OS_ERROR_SYSTEM_INTERRUPT 13
#define OS_ERROR_THERMAL_INTERRUPT 14
#define OS_ERROR_PROTECTION 15
#define OS_ERROR_MAX (OS_ERROR_THERMAL_INTERRUPT + 1)
typedef u16 OSError;
typedef void (*OSErrorHandler)(OSError error, OSContext* context, ...);
OSErrorHandler OSSetErrorHandler(OSError error, OSErrorHandler handler);
void __OSUnhandledException(u8 error, OSContext* context, u32 dsisr, u32 dar);
 void OSPanic(char* file, int line, char* msg, ...);
void OSReport(char*, ...);
#define DOLPHIN_OS_OSEXI_H
typedef void (*EXICallback)(s32 chan, OSContext* context);
typedef enum {
    EXI_STATE_DMA_ACCESS = (1 << 0),
    EXI_STATE_IMM_ACCESS = (1 << 1),
    EXI_STATE_SELECTED = (1 << 2),
    EXI_STATE_ATTACHED = (1 << 3),
    EXI_STATE_LOCKED = (1 << 4),
    EXI_STATE_BUSY = EXI_STATE_DMA_ACCESS | EXI_STATE_IMM_ACCESS
} EXIState;
typedef enum {
    EXI_CHAN_0,
    EXI_CHAN_1,
    EXI_CHAN_2,
    EXI_MAX_CHAN
} EXIChannel;
typedef enum {
    EXI_READ,
    EXI_WRITE,
    EXI_TYPE_2,
    EXI_MAX_TYPE
} EXIType;
typedef struct EXIControl {
    EXICallback exiCallback;
    EXICallback tcCallback;
    EXICallback extCallback;
    vu32 state;
    int immLen;
    u8* immBuf;
    u32 dev;
    u32 id;
    s32 idTime;
    int items;
    struct {
        u32 dev;
        EXICallback callback;
    } queue[3];
} EXIControl;
#define EXI_REG_MAX 5
extern vu32 __EXIRegs[EXI_MAX_CHAN][5] ;
void SetExiInterruptMask(EXIChannel, volatile EXIControl*);
bool EXIImm(EXIChannel, void* buf, s32 len, u32 type, EXICallback);
bool EXIImmEx(EXIChannel, void* buf, s32 len, u32 mode);
bool EXIDma(EXIChannel, void* buf, s32 len, u32 type, EXICallback);
bool EXISync(EXIChannel);
u32 EXIClearInterrupts(EXIChannel, bool exi, bool tc, bool ext);
EXICallback EXISetExiCallback(EXIChannel, EXICallback exiCallback);
bool EXIProbe(EXIChannel);
s32 EXIProbeEx(EXIChannel);
bool EXIAttach(EXIChannel, EXICallback);
bool EXIDetach(EXIChannel);
bool EXISelect(s32, u32 dev, u32 freq);
bool EXIDeselect(EXIChannel);
void EXIInit(void);
bool EXILock(s32, u32 dev, EXICallback unlockedCallback);
bool EXIUnlock(EXIChannel);
u32 EXIGetState(EXIChannel);
s32 EXIGetID(EXIChannel, u32 dev, u32* id);
#define DOLPHIN_OS_OSFONT_H
u16 OSGetFontEncode(void);
#define DOLPHIN_OS_OSLINK_H
void __OSModuleInit(void);
#define __DOLPHIN_OSMEMORY_H_
extern volatile u16 __MEMRegs[64] ;
u32 OSGetPhysicalMemSize(void);
u32 OSGetConsoleSimulatedMemSize(void);
void Config48MB(void);
void RealMode(Event);
void __OSInitMemoryProtection(void);
void Config24MB(void);
#define DOLPHIN_OS_OSMUTEX_H
// https://github.com/kiwi515/open_rvl/blob/fe0742f3ed2090041d5a3c98b98da5ff3546338a/include/OS/OSThread.h
#define _OSTHREAD_H_
#define OS_PRIORITY_MIN 0
#define OS_PRIORITY_MAX 31
#define OS_THREAD_ATTR_DETACH 0x0001u
#define OS_THREAD_STACK_MAGIC 0xDEADBABE
#define OS_THREAD_SPECIFIC_MAX 2
typedef s32 OSPriority; //  0 highest, 31 lowest
typedef struct OSThread OSThread;
typedef struct OSThreadQueue OSThreadQueue;
typedef struct OSThreadLink OSThreadLink;
typedef struct OSMutex OSMutex;
typedef struct OSMutexQueue OSMutexQueue;
typedef struct OSMutexLink OSMutexLink;
typedef struct OSCond OSCond;
typedef enum {
    OS_THREAD_STATE_EXITED = 0,
    OS_THREAD_STATE_READY = 1,
    OS_THREAD_STATE_RUNNING = 2,
    OS_THREAD_STATE_WAITING = 4,
    OS_THREAD_STATE_MORIBUND = 8
} OSThreadState;
typedef enum {
    OS_THREAD_DETACHED = (1 << 0)
} OSThreadFlag;
struct OSThreadQueue {
    OSThread* head; // at 0x0
    OSThread* tail; // at 0x4
};
struct OSThreadLink {
    OSThread* next;
    OSThread* prev;
};
struct OSMutexQueue {
    OSMutex* head; // at 0x0
    OSMutex* tail; // at 0x4
};
struct OSMutexLink {
    OSMutex* next; // at 0x0
    OSMutex* prev; // at 0x4
};
struct OSThread {
    OSContext context;
    u16 state;
    u16 attr;
    s32 suspend;
    OSPriority priority;
    OSPriority base;
    void* val;
    OSThreadQueue* queue;
    OSThreadLink link;
    OSThreadQueue queueJoin;
    OSMutex* mutex;
    OSMutexQueue queueMutex;
    OSThreadLink linkActive;
    u8* stackBase;
    u32* stackEnd;
    s32 error;
    void* specific[2];
};
typedef void (*OSSwitchThreadCallback)(OSThread* from, OSThread* to);
extern OSThreadQueue OS_THREAD_QUEUE ;
extern OSThread* OS_CURRENT_THREAD ;
OSSwitchThreadCallback OSSetSwitchThreadCallback(OSSwitchThreadCallback);
void __OSThreadInit(void);
void OSSetCurrentThread(OSThread*);
void OSInitMutexQueue(OSMutexQueue*);
void OSInitThreadQueue(OSThreadQueue*);
OSThread* OSGetCurrentThread(void);
bool OSIsThreadTerminated(OSThread*);
s32 OSDisableScheduler(void);
s32 OSEnableScheduler(void);
s32 __OSGetEffectivePriority(OSThread*);
void __OSPromoteThread(OSThread*, s32);
void __OSReschedule(void);
void OSYieldThread(void);
bool OSCreateThread(OSThread* thread, void* (*func)(void*), void* param,
                    void* stack, u32 stackSize, OSPriority priority, u16 attr);
void OSExitThread(OSThread*);
void OSCancelThread(OSThread*);
bool OSJoinThread(OSThread*, void*);
void OSDetachThread(OSThread*);
s32 OSResumeThread(OSThread*);
s32 OSSuspendThread(OSThread*);
void OSSleepThread(OSThreadQueue*);
void OSWakeupThread(OSThreadQueue*);
bool OSSetThreadPriority(OSThread*, s32);
void OSClearStack(u8);
void OSSleepTicks(s64);
void CheckThreadQueue(void);
void UnsetRun(OSThread* thread);
void OSCheckActiveThreads(void);
void SetEffectivePriority(void);
typedef struct OSMutex {
    OSThreadQueue queue; // at 0x00
    OSThread* thread; // at 0x08
    s32 count; // at 0x0C
    OSMutexLink link; // at 0x10
} OSMutex;
void OSInitMutex(OSMutex*);
void OSLockMutex(OSMutex*);
void OSUnlockMutex(OSMutex*);
void __OSUnlockAllMutex(OSThread*);
bool OSTryLockMutex(OSMutex*);
bool __OSCheckDeadLock(OSThread* thread);
bool __OSCheckMutexes(OSThread* thread);
bool __OSCheckMutex(OSMutex* mutex);
#define DOLPHIN_OS_OSRESET_H
typedef bool (*OSResetFunction)(bool);
typedef struct OSResetFunctionInfo OSResetFunctionInfo;
struct OSResetFunctionInfo {
    OSResetFunction func;
    u32 priority;
    OSResetFunctionInfo* next;
    OSResetFunctionInfo* prev;
};
void OSResetSystem(int reset, u32 resetCode, bool forceMenu);
void OSRegisterResetFunction(OSResetFunctionInfo* func);
void __OSDoHotReset(s32 arg0);
/// @todo @c enum
#define OS_RESET_RESTART 0
#define OS_RESET_HOTRESET 1
#define OS_RESET_SHUTDOWN 2
bool __OSCallResetFunctions(bool funcs_arg);
u32 OSGetResetCode(void);
#define DOLPHIN_OS_OSRESETSW_H
struct _OSResetSW_Unk1;
typedef bool (*OSResetSW_Predicate)(struct _OSResetSW_Unk1*);
typedef union {
    OSResetSW_Predicate predicate;
    struct {
        u8 x0_addr_prefix;
        u8 x1_addr_suffix;
    } bytes;
} OSResetSW_Predicate_Union;
typedef enum {
    OSRESETSW_ENUM1_UNK0,
    OSRESETSW_ENUM1_UNK1,
    OSRESETSW_ENUM1_UNK2,
    OSRESETSW_ENUM1_UNK3,
    OSRESETSW_ENUM1_UNK4,
    OSRESETSW_ENUM1_UNK5,
    OSRESETSW_ENUM1_UNK6,
} OSResetSW_Enum1;
typedef struct _OSResetSW_Unk1 {
    OSResetSW_Predicate_Union x0_predicate_union;
    s32 x4;
    s32 x8;
    u8* xC_buffer;
    u8 x10_pad[0x14 - 0x10];
    OSResetSW_Enum1 x14_enum;
    u8 x18_pad[0x54 - 0x18];
    u8* x54_buffer;
    u8 x58_pad[0x5E - 0x58];
    u8 x5E;
    u8 x5F_pad[0x8E - 0x5F];
    u8 x8E;
    u8 x8F_pad[0x9A - 0x8F];
    u8 x9A;
    u8 x9B_pad[0xB4 - 0x9B];
    u8* xB4_buffer;
    u8 xB8_pad[0xBC - 0xB8];
    u32 xBC_flags;
    u8 xC0_pad[0xC4 - 0xC0];
    bool xC4;
    u8 xCC_pad[0xD0 - 0xCC];
    bool xD0;
    OSResetSW_Predicate xD4_predicate;
} OSResetSW_Unk1;
typedef bool (*OSResetSW_MulticastPredicate)(OSResetSW_Predicate*);
bool OSGetResetSwitchState(void);
void __OSResetSWInterruptHandler(__OSInterrupt interrupt, OSContext* context);
bool OSGetResetButtonState(void);
#define DOLPHIN_OS_OSSERIAL_H
#define _DOLPHIN_SIPRIV
typedef void (*SICallback)(s32 chan, u32 sr, OSContext* context);
typedef void (*SITypeAndStatusCallback)(s32 chan, u32 type);
typedef struct SIPacket {
    s32 chan;
    void* output;
    u32 outputBytes;
    void* input;
    u32 inputBytes;
    SICallback callback;
    OSTime fire;
} SIPacket;
void SIInit(void);
u32 SIGetStatus(s32 chan);
bool SIBusy(void);
bool SIIsChanBusy(s32 chan);
bool SITransfer(s32 chan, void* output, u32 outputBytes, void* input,
                u32 inputBytes, SICallback callback, OSTime delay);
u32 SISync(void);
void SISetCommand(s32 chan, u32 command);
u32 SIGetCommand(s32 chan);
void SITransferCommands(void);
u32 SISetXY(u32 x, u32 y);
u32 SIEnablePolling(u32 poll);
u32 SIDisablePolling(u32 poll);
bool SIGetResponse(s32 chan, void* data);
bool SIRegisterPollingHandler(__OSInterruptHandler handler);
bool SIUnregisterPollingHandler(__OSInterruptHandler handler);
u32 SIGetType(s32 chan);
u32 SIGetTypeAsync(s32 chan, SITypeAndStatusCallback callback);
u32 SIDecodeType(u32 type);
#define SI_MAX_CHAN 4
#define SI_MAX_COMCSR_INLNGTH 128
#define SI_MAX_COMCSR_OUTLNGTH 128
#define SI_ERROR_UNDER_RUN 0x0001
#define SI_ERROR_OVER_RUN 0x0002
#define SI_ERROR_COLLISION 0x0004
#define SI_ERROR_NO_RESPONSE 0x0008
#define SI_ERROR_WRST 0x0010
#define SI_ERROR_RDST 0x0020
#define SI_ERROR_UNKNOWN 0x0040
#define SI_ERROR_BUSY 0x0080
#define SI_CHAN0 0
#define SI_CHAN1 1
#define SI_CHAN2 2
#define SI_CHAN3 3
#define SI_CHAN0_BIT 0x80000000
#define SI_CHAN1_BIT 0x40000000
#define SI_CHAN2_BIT 0x20000000
#define SI_CHAN3_BIT 0x10000000
#define SI_CHAN_BIT(chan) (SI_CHAN0_BIT >> (chan))
#define SI_TYPE_MASK 0x18000000u
#define SI_TYPE_N64 0x00000000u
#define SI_TYPE_DOLPHIN 0x08000000u
#define SI_TYPE_GC SI_TYPE_DOLPHIN
#define SI_GC_WIRELESS 0x80000000
#define SI_GC_NOMOTOR 0x20000000
#define SI_GC_STANDARD 0x01000000
#define SI_WIRELESS_RECEIVED 0x40000000
#define SI_WIRELESS_IR 0x04000000
#define SI_WIRELESS_STATE 0x02000000
#define SI_WIRELESS_ORIGIN 0x00200000
#define SI_WIRELESS_FIX_ID 0x00100000
#define SI_WIRELESS_TYPE 0x000f0000
#define SI_WIRELESS_LITE_MASK 0x000c0000
#define SI_WIRELESS_LITE 0x00040000
#define SI_WIRELESS_CONT_MASK 0x00080000
#define SI_WIRELESS_CONT 0x00000000
#define SI_WIRELESS_ID 0x00c0ff00
#define SI_WIRELESS_TYPE_ID (SI_WIRELESS_TYPE | SI_WIRELESS_ID)
#define SI_N64_CONTROLLER (SI_TYPE_N64 | 0x05000000)
#define SI_N64_MIC (SI_TYPE_N64 | 0x00010000)
#define SI_N64_KEYBOARD (SI_TYPE_N64 | 0x00020000)
#define SI_N64_MOUSE (SI_TYPE_N64 | 0x02000000)
#define SI_GBA (SI_TYPE_N64 | 0x00040000)
#define SI_GC_CONTROLLER (SI_TYPE_GC | SI_GC_STANDARD)
#define SI_GC_RECEIVER (SI_TYPE_GC | SI_GC_WIRELESS)
#define SI_GC_WAVEBIRD (SI_TYPE_GC | SI_GC_WIRELESS | SI_GC_STANDARD | SI_WIRELESS_STATE | SI_WIRELESS_FIX_ID)
#define SI_GC_KEYBOARD (SI_TYPE_GC | 0x00200000)
#define SI_GC_STEERING (SI_TYPE_GC | 0x00000000)
#define DOLPHIN_OS_OSSYNC_H
void __OSSystemCallVector(void);
void __OSInitSystemCall(void);
typedef struct CARDFileInfo CARDFileInfo;
typedef struct CARDStat CARDStat;
typedef void (*CARDCallback)(EXIChannel chan, s32 result);
#define __DOLPHIN_DVD_H_
#define DOLPHIN_DVD_FORWARD_H
typedef struct DVDCommandBlock DVDCommandBlock;
typedef void (*DVDCBCallback)(s32 result, DVDCommandBlock* block);
struct bb2struct {
    u32 _00;
    u32 _04;
    s32 _08; // size?
    u32 FSTMaxLength;
    void* FSTLocationInRam;
};
typedef struct DVDDiskID {
    char gameName[4];
    char company[2];
    u8 diskNumber;
    u8 gameVersion;
    u8 streaming;
    u8 streamingBufSize;
    u8 padding[22];
} DVDDiskID;
typedef struct DVDBuffer {
    void* bootFilePosition;
    u32 FSTPosition;
    u32 FSTLength;
    u32 FSTMaxLength;
    void* FSTAddress;
    u32 userPosition;
    u32 userLength;
    u32 padding0;
} DVDBuffer;
struct DVDCommandBlock {
    /*0x00*/ DVDCommandBlock* next;
    /*0x04*/ DVDCommandBlock* prev;
    /*0x08*/ u32 command;
    /*0x0C*/ s32 state;
    /*0x10*/ u32 offset;
    /*0x14*/ u32 length;
    /*0x18*/ void* addr;
    /*0x1C*/ u32 currTransferSize;
    /*0x20*/ u32 transferredSize;
    /*0x24*/ DVDDiskID* id;
    /*0x28*/ DVDCBCallback callback;
    /*0x2C*/ void* userData;
};
typedef struct DVDFileInfo DVDFileInfo;
typedef void (*DVDCallback)(s32 result, DVDFileInfo* fileInfo);
struct DVDFileInfo {
    /*0x00*/ DVDCommandBlock cb;
    /*0x30*/ u32 startAddr;
    /*0x34*/ u32 length;
    /*0x38*/ DVDCallback callback;
};
typedef struct DVDDriveInfo {
    u16 revisionLevel;
    u16 deviceCode;
    u32 releaseDate;
    u8 padding[24];
} DVDDriveInfo;
// Minimum transfer size.
#define DVD_MIN_TRANSFER_SIZE 32
// DVD states.
#define DVD_STATE_FATAL_ERROR -1
#define DVD_STATE_END 0
#define DVD_STATE_BUSY 1
#define DVD_STATE_WAITING 2
#define DVD_STATE_COVER_CLOSED 3
#define DVD_STATE_NO_DISK 4
#define DVD_STATE_COVER_OPEN 5
#define DVD_STATE_WRONG_DISK 6
#define DVD_STATE_MOTOR_STOPPED 7
#define DVD_STATE_PAUSING 8
#define DVD_STATE_IGNORED 9
#define DVD_STATE_CANCELED 10
#define DVD_STATE_RETRY 11
// File info states.
#define DVD_FILEINFO_READY 0
#define DVD_FILEINFO_BUSY 1
// DVD results.
#define DVD_RESULT_GOOD 0
#define DVD_RESULT_FATAL_ERROR -1
#define DVD_RESULT_IGNORED -2
#define DVD_RESULT_CANCELED -3
#define DVD_AIS_SUCCESS 0
extern OSThreadQueue __DVDThreadQueue;
typedef void (*DVDLowCallback)(u32 intType);
DVDLowCallback DVDLowClearCallback(void);
void DVDInit(void);
bool DVDOpen(char*, DVDFileInfo*);
bool DVDClose(DVDFileInfo*);
bool DVDChangeDir(char*);
bool DVDFastOpen(s32 entrynum, DVDFileInfo* fileInfo);
bool DVDReadAsyncPrio(DVDFileInfo* fileInfo, void* addr, s32 length,
                      s32 offset, DVDCallback callback, s32 prio);
s32 DVDConvertPathToEntrynum(const char* pathPtr);
void DVDReset(void);
s32 DVDCancel(DVDCommandBlock* block);
s32 DVDGetDriveStatus(void);
void __CARDSetDiskID(const DVDDiskID* id);
bool DVDReadAbsAsyncForBS(DVDCommandBlock* block, void* addr, s32 length,
                          s32 offset, DVDCBCallback callback);
bool DVDReadDiskID(DVDCommandBlock* block, DVDDiskID* diskID,
                   DVDCBCallback callback);
bool DVDCheckDisk(void);
void __DVDPrepareResetAsync(DVDCBCallback callback);
bool DVDSetAutoInvalidation(bool autoInval);
#define DVDReadAsync(fileInfo, addr, length, offset, callback) DVDReadAsyncPrio((fileInfo), (addr), (length), (offset), (callback), 2)
s32 DVDGetCommandBlockStatus(const DVDCommandBlock* block);
bool DVDCancelAsync(DVDCommandBlock* block, DVDCBCallback callback);
int DVDCancelAll(void);
DVDDiskID* DVDGetCurrentDiskID(void);
u32 CategorizeError(u32 error);
bool DVDCancelStreamAsync(DVDCommandBlock* block, DVDCBCallback callback);
int DVDCancelStream(DVDCommandBlock* block);
bool DVDStopStreamAtEndAsync(DVDCommandBlock* block, DVDCBCallback callback);
bool DVDInquiryAsync(DVDCommandBlock* block, void* addr,
                     DVDCBCallback callback);
bool DVDReadAbsAsyncPrio(DVDCommandBlock* block, void* addr, s32 length,
                         s32 offset, DVDCBCallback callback, s32 prio);
bool DVDSeekAbsAsyncPrio(DVDCommandBlock* block, u32 offset,
                         DVDCBCallback callback, s32 prio);
bool DVDPrepareStreamAbsAsync(DVDCommandBlock* block, u32 length, u32 offset,
                              DVDCBCallback callback);
#define CARD_FAT_CHECKSUM 0
#define CARD_FAT_CHECKSUMINV 1
#define CARD_FAT_CHECKCODE 2
#define CARD_FAT_FREEBLOCKS 3
#define CARD_FAT_LASTSLOT 4
#define CARD_FAT_AVAIL 0
#define CARD_RESULT_UNLOCKED 1
#define CARD_RESULT_READY 0
#define CARD_RESULT_BUSY -1
#define CARD_RESULT_WRONGDEVICE -2
#define CARD_RESULT_NOCARD -3
#define CARD_RESULT_NOFILE -4
#define CARD_RESULT_IOERROR -5
#define CARD_RESULT_BROKEN -6
#define CARD_RESULT_EXIST -7
#define CARD_RESULT_NOENT -8
#define CARD_RESULT_INSSPACE -9
#define CARD_RESULT_NOPERM -10
#define CARD_RESULT_LIMIT -11
#define CARD_RESULT_NAMETOOLONG -12
#define CARD_RESULT_ENCODING -13
#define CARD_RESULT_CANCELED -14
#define CARD_RESULT_FATAL_ERROR -128
#define CARD_NUM_SYSTEM_BLOCK 5
#define CARD_WORKAREA_SIZE (5 * 8 * 1024)
#define CARD_SYSTEM_BLOCK_SIZE (8 * 1024)
#define CARD_READ_SIZE 512
#define CARD_MAX_FILE 127
#define CARD_COMMENT_SIZE 64
#define CARD_FILENAME_MAX 32
#define CARD_ICON_MAX 8
#define CARD_ICON_WIDTH 32
#define CARD_ICON_HEIGHT 32
#define CARD_BANNER_WIDTH 96
#define CARD_BANNER_HEIGHT 32
#define CARD_STAT_ICON_NONE 0
#define CARD_STAT_ICON_C8 1
#define CARD_STAT_ICON_RGB5A3 2
#define CARD_STAT_ICON_MASK 3
#define CARD_STAT_BANNER_NONE 0
#define CARD_STAT_BANNER_C8 1
#define CARD_STAT_BANNER_RGB5A3 2
#define CARD_STAT_BANNER_MASK 3
#define CARD_STAT_ANIM_LOOP 0x00
#define CARD_STAT_ANIM_BOUNCE 0x04
#define CARD_STAT_ANIM_MASK 0x04
#define CARD_STAT_SPEED_END 0
#define CARD_STAT_SPEED_FAST 1
#define CARD_STAT_SPEED_MIDDLE 2
#define CARD_STAT_SPEED_SLOW 3
#define CARD_STAT_SPEED_MASK 3
#define CARD_MAX_MOUNT_STEP (CARD_NUM_SYSTEM_BLOCK + 2)
#define CARD_PAGE_SIZE 128
#define CARD_SEG_SIZE 512
#define CARD_STAT_SPEED_END 0
#define CARD_STAT_SPEED_FAST 1
#define CARD_STAT_SPEED_MIDDLE 2
#define CARD_STAT_SPEED_SLOW 3
#define CARD_STAT_SPEED_MASK 3
#define CARD_ATTR_PUBLIC 0x04
#define CARD_ATTR_NO_COPY 0x08
#define CARD_ATTR_NO_MOVE 0x10
#define CARD_ATTR_GLOBAL 0x20
#define CARD_ATTR_COMPANY 0x40
struct CARDFileInfo {
    s32 chan;
    s32 fileNo;
    s32 offset;
    s32 length;
    u16 iBlock;
    u16 __padding;
};
typedef struct CARDDir {
    u8 gameName[4];
    u8 company[2];
    u8 _padding0;
    u8 bannerFormat;
    u8 fileName[32];
    u32 time; // seconds since 01/01/2000 midnight
    u32 iconAddr; // 0xffffffff if not used
    u16 iconFormat;
    u16 iconSpeed;
    u8 permission;
    u8 copyTimes;
    u16 startBlock;
    u16 length;
    u8 _padding1[2];
    u32 commentAddr; // 0xffffffff if not used
} CARDDir;
typedef struct CARDDirCheck {
    u8 padding0[64 - 2 * 4];
    u16 padding1;
    s16 checkCode;
    u16 checkSum;
    u16 checkSumInv;
} CARDDirCheck;
typedef struct CARDControl {
    bool attached;
    s32 result;
    u16 size;
    u16 pageSize;
    s32 sectorSize;
    u16 cBlock;
    u16 vendorID;
    s32 latency;
    u8 id[12];
    union {
        int mountStep;
        int formatStep;
    };
    u32 scramble;
    DSPTaskInfo task;
    void* workArea;
    CARDDir* currentDir;
    u16* currentFat;
    OSThreadQueue threadQueue;
    u8 cmd[9];
    s32 cmdlen;
    vu32 mode;
    int retry;
    int repeat;
    u32 addr;
    void* buffer;
    u32 xferred;
    u16 freeNo;
    u16 startBlock;
    CARDFileInfo* fileInfo;
    CARDCallback extCallback;
    CARDCallback txCallback;
    CARDCallback exiCallback;
    CARDCallback apiCallback;
    CARDCallback xferCallback;
    CARDCallback eraseCallback;
    CARDCallback unlockCallback;
    OSAlarm alarm;
    u32 cid;
    const DVDDiskID* diskID;
} CARDControl;
extern CARDControl __CARDBlock[2];
typedef struct CARDID {
    u8 serial[32]; // flashID[12] + timebase[8] + counterBias[4] + language[4]
                   // +
                   // XXX[4]
    u16 deviceID;
    u16 size;
    u16 encode; // character set -- 0: S-JIS, 1: ANSI
    u8 padding[512 - 32 - 5 * 2];
    u16 checkSum;
    u16 checkSumInv;
} CARDID;
s32 CARDClose(CARDFileInfo*);
int CARDWrite(CARDFileInfo*, void* buf, s32 length, s32 offset);
int CARDRead(CARDFileInfo*, void* buf, u32 length, u32 offset);
s32 __CARDClearStatus(s32 chan);
s32 __CARDReadStatus(s32 chan, u8* status);
static s32 Retry(s32 chan);
CARDDir* __CARDGetDirBlock(CARDControl*);
u16* __CARDGetFatBlock(CARDControl* card);
s32 __CARDUpdateFatBlock(s32 chan, u16* fat, CARDCallback);
void __CARDDefaultApiCallback(s32 chan, s32 result);
void __CARDSyncCallback(s32, s32);
#define __CARDGetDirCheck(dir) ((CARDDirCheck*) &(dir)[CARD_MAX_FILE])
#define CARDIsValidBlockNo(card, iBlock) (CARD_NUM_SYSTEM_BLOCK <= (iBlock) && (iBlock) < (card)->cBlock)
#define DOLPHIN_CARD_CARDBIOS_H
s32 __CARDEnableInterrupt(s32 chan, bool enable);
s32 __CARDEraseSector(s32 chan, u32 addr, CARDCallback callback);
s32 __CARDGetControlBlock(s32 chan, CARDControl** pcard);
s32 __CARDPutControlBlock(struct CARDControl* card, s32 result);
s32 __CARDReadSegment(s32 chan, CARDCallback callback);
s32 __CARDSync(s32 i);
s32 __CARDWritePage(s32 chan, CARDCallback callback);
void __CARDExiHandler(s32 chan, OSContext* context);
void __CARDExtHandler(s32 chan, OSContext* context);
void CARDInit(void);
s32 __CARDStart(s32 chan, CARDCallback txCallback, CARDCallback exiCallback);
s32 CARDFreeBlocks(s32 chan, s32* byteNotUsed, s32* filesNotUsed);
s32 CARDGetResultCode(s32 chan);
s32 CARDGetSectorSize(s32 chan, u32* size);
void __CARDTxHandler(s32 chan, OSContext* context);
void __CARDUnlockedHandler(s32 chan, OSContext* context);
#define DOLPHIN_CARD_CARDBLOCK_H
s32 __CARDAllocBlock(s32 chan, u32 cBlock, CARDCallback callback);
s32 __CARDFreeBlock(s32 chan, u16 nBlock, CARDCallback callback);
s32 __CARDFreeBlock(s32 chan, u16 nBlock, CARDCallback callback);
s32 __CARDAllocBlock(s32 chan, u32 cBlock, CARDCallback callback);
#define DOLPHIN_CARD_CARDCHECK_H
void __CARDCheckSum(void* ptr, int length, u16* checksum, u16* checksumInv);
s32 __CARDVerify(CARDControl* card);
void __CARDCheckSum(void* ptr, int length, u16* checksum, u16* checksumInv);
s32 __CARDVerify(CARDControl* card);
s32 CARDCheckExAsync(s32 chan, s32* xferBytes, CARDCallback callback);
s32 CARDCheckAsync(s32 chan, CARDCallback callback);
#define DOLPHIN_CARD_CARDCREATE_H
s32 CARDCreateAsync(s32 chan, const char* fileName, u32 size,
                    CARDFileInfo* fileInfo, CARDCallback callback);
void CreateCallbackFat(s32 chan, s32 result);
#define DOLPHIN_CARD_CARDDELETE_H
s32 CARDFastDeleteAsync(s32 chan, s32 fileNo, CARDCallback callback);
s32 CARDDeleteAsync(s32 chan, const char* fileName, CARDCallback callback);
#define DOLPHIN_CARD_CARDDIR_H
s32 __CARDUpdateDir(s32 chan, CARDCallback callback);
s32 __CARDUpdateDir(s32 chan, CARDCallback callback);
#define DOLPHIN_CARD_CARDFORMAT_H
void FormatCallback(s32 chan, s32 result);
s32 CARDFormatAsync(s32 chan, CARDCallback callback);
s32 __CARDFormatRegionAsync(s32 chan, u16 encode, CARDCallback callback);
#define DOLPHIN_CARD_CARDMOUNT_H
s32 CARDUnmount(s32 chan);
void __CARDMountCallback(s32 chan, s32 result);
s32 CARDProbe(EXIChannel chan);
s32 CARDProbeEx(EXIChannel chan, s32* memSize, s32* sectorSize);
s32 DoMount(EXIChannel chan);
s32 CARDMountAsync(s32 chan, void* workArea, CARDCallback detachCallback,
                   CARDCallback attachCallback);
#define DOLPHIN_CARD_CARDOPEN_H
bool __CARDCompareFileName(CARDDir* ent, const char* filename);
s32 __CARDAccess(CARDControl* card, CARDDir* ent);
bool __CARDIsOpened(CARDControl* card, s32 fileno);
s32 __CARDGetFileNo(CARDControl* card, const char* filename, s32* pfileno);
s32 CARDFastOpen(EXIChannel chan, s32 fileno, CARDFileInfo* fileinfo);
s32 CARDOpen(EXIChannel chan, const char* filename, CARDFileInfo* fileInfo);
s32 __CARDIsPublic(CARDDir* ent);
s32 CARDOpen(EXIChannel chan, const char* filename, CARDFileInfo* fileinfo);
bool __CARDCompareFileName(CARDDir* ent, const char* filename);
bool __CARDIsOpened(CARDControl* card, s32 fileno);
s32 __CARDAccess(CARDControl* card, CARDDir* ent);
s32 __CARDIsPublic(CARDDir* ent);
s32 __CARDGetFileNo(CARDControl* card, const char* filename, s32* pfileno);
s32 CARDFastOpen(EXIChannel chan, s32 fileno, CARDFileInfo* fileinfo);
#define DOLPHIN_CARD_CARDRDWR_H
s32 __CARDWrite(s32 chan, u32 addr, u32 length, void* dst,
                CARDCallback callback);
s32 __CARDRead(s32 chan, u32 addr, u32 length, void* dst,
               CARDCallback callback);
u32 CARDGetXferredBytes(s32 chan);
#define DOLPHIN_CARD_CARDREAD_H
s32 __CARDSeek(CARDFileInfo* fileInfo, s32 length, s32 offset,
               CARDControl** pcard);
s32 CARDReadAsync(CARDFileInfo* fileInfo, void* buf, s32 length, s32 offset,
                  CARDCallback callback);
#define DOLPHIN_CARD_CARDRENAME_H
s32 CARDRenameAsync(s32 chan, const char* old, const char* new,
                    CARDCallback callback);
#define DOLPHIN_CARD_CARDSTAT_H
s32 CARDGetStatus(s32 chan, s32 fileNo, CARDStat* stat);
s32 CARDSetStatusAsync(s32 chan, s32 fileNo, CARDStat* stat,
                       CARDCallback callback);
#define DOLPHIN_CARD_CARDUNLOCK_H
s32 __CARDUnlock(s32 chan, u8 flashID[12]);
s32 DummyLen(void);
u32 bitrev(u32 data);
s32 ReadArrayUnlock(s32 chan, u32 data, void* rbuf, s32 rlen, s32 mode);
#define DOLPHIN_CARD_CARDWRITE_H
s32 CARDWriteAsync(CARDFileInfo* fileInfo, const void* buf, u32 length,
                   s32 offset, CARDCallback callback);
#define __DOLPHIN_DB_H__
typedef struct {
    u32 bPresent;
    u32 exceptionMask;
    void (*ExceptionDestination)(void);
    void* exceptionReturn;
} DBInterface;
void DBInit(void);
bool DBIsDebuggerPresent(void);
bool __DBIsExceptionMarked(u8 exception);
void DBPrintf(const char* str, ...);
int __DBIsExceptionMarked(u8 a);
#define DOLPHIN_DVD_DVDERROR_H
void __DVDStoreErrorCode(u32 error);
#define DOLPHIN_DVD_DVDFS_H
typedef struct FSTEntry {
    unsigned int isDirAndStringOff;
    unsigned int parentOrPosition;
    unsigned int nextEntryOrLength;
} FSTEntry;
void __DVDFSInit(void);
#define DOLPHIN_DVD_DVDLOW_H
void __DVDInitWA(void);
void __DVDInterruptHandler(__OSInterrupt, OSContext*);
bool DVDLowRead(void*, u32, u32, DVDLowCallback);
bool DVDLowStopMotor(DVDLowCallback callback);
bool DVDLowRequestError(DVDLowCallback callback);
bool DVDLowSeek(u32 offset, DVDLowCallback callback);
bool DVDLowAudioBufferConfig(bool enable, u32 size, DVDLowCallback callback);
bool DVDLowReadDiskID(DVDDiskID* diskID, DVDLowCallback callback);
bool DVDLowRequestAudioStatus(u32 subcmd, DVDLowCallback callback);
bool DVDLowAudioStream(u32 subcmd, u32 length, u32 offset,
                       DVDLowCallback callback);
bool DVDLowInquiry(DVDDriveInfo* info, DVDLowCallback callback);
bool DVDLowWaitCoverClose(DVDLowCallback callback);
void DVDLowReset(void);
bool DVDLowBreak(void);
#define DOLPHIN_DVD_DVDQUEUE_H
void __DVDClearWaitingQueue(void);
bool __DVDCheckWaitingQueue(void);
int __DVDPushWaitingQueue(int a, DVDCommandBlock* b);
bool __DVDDequeueWaitingQueue(DVDCommandBlock* a);
DVDCommandBlock* __DVDPopWaitingQueue(void);
#define DOLPHIN_DVD_FSTLOAD_H
void __fstLoad(void);
void cb(s32 param_1, DVDCommandBlock* block);
#define DOLPHIN_GX_GXATTR_H
#define GXSetTexCoordGen(dst_coord, func, src_param, mtx) GXSetTexCoordGen2(dst_coord, func, src_param, mtx, GX_DISABLE, GX_PTIDENTITY)
void GXSetNumTexGens(u8 num);
void GXSetTexCoordGen2(GXTexCoordID, GXTexGenType, GXTexGenSrc, u32, GXBool,
                       u32);
void GXInvalidateVtxCache(void);
void GXSetArray(GXAttr attr, s32 base_ptr, u8 stride);
void GXSetVtxAttrFmt(size_t vtxfmt, GXAttr attr, enum_t count, GXCompType type,
                     u8 frac);
void GXClearVtxDesc(void);
void GXSetVtxDesc(GXAttr attr, s32 type);
void __GXSetVCD(void);
void __GXSetVAT(void);
void __GXSetVCD(void);
void GXClearVtxDesc(void);
void __GXXfVtxSpecs(void);
void __GXSetVAT(void);
void GXInvalidateVtxCache(void);
#define DOLPHIN_GX_GXBUMP_H
void __GXUpdateBPMask(void);
void GXSetIndTexCoordScale(s32, s32, s32);
void GXSetIndTexMtx(s32, M2C_UNK, s32);
void XSetIndTexCoordScale(void);
void GXSetIndTexOrder(s32, s32, s32);
void GXSetNumIndStages(s32 arg0);
void GXSetTevDirect(void);
void __GXUpdateBPMask(void);
void __GXFlushTextureState(void);
void GXSetTevIndirect(s32, s32, u8, s32, s32, s32, s32, s32);
#define DOLPHIN_GX_GXDISPLAYLIST_H
void GXCallDisplayList(s32, s32);
#define DOLPHIN_GX_GXFRAMEBUF_H
extern GXRenderModeObj GXPal528IntDf;
extern GXRenderModeObj GXMpal480IntDf;
extern GXRenderModeObj GXFrameBuf_804011E0;
extern GXRenderModeObj GXFrameBuf_804011A4;
extern GXRenderModeObj GXNtsc480IntDf;
void GXClearBoundingBox(void);
void GXCopyDisp(void*, GXBool);
void GXCopyTex(void*, GXBool);
void GXSetCopyFilter(GXBool, u8[12][2], GXBool, u8[7]);
void GXSetDispCopyDst(u16, u16);
void GXSetDispCopyFrame2Field(s32 arg0);
void GXSetDispCopyFrame2Field(s32 arg0);
void GXSetDispCopyGamma(s32 arg0);
void GXSetDispCopySrc(u16, u16, u16, u16);
u32 GXSetDispCopyYScale(f32);
void GXSetTexCopyDst(u16, u16, GXTexFmt, GXBool);
void GXSetTexCopySrc(u16, u16, u16, u16);
void GXSetCopyClamp(s32);
void GXSetCopyClear(GXColor, u32);
#define DOLPHIN_GX_GXGEOMETRY_H
void GXBegin(GXPrimitive type, GXVtxFmt vtxfmt, u16 nverts);
void GXSetLineWidth(u8 width, GXTexOffset texOffsets);
void GXSetPointSize(u8 pointSize, GXTexOffset texOffsets);
void GXEnableTexOffsets(GXTexCoordID coord, GXBool line_enable,
                        GXBool point_enable);
void GXSetCullMode(GXCullMode mode);
void GXSetCoPlanar(GXBool enable);
void __GXSetDirtyState(void);
void __GXSendFlushPrim(void);
#define _GXINIT_H_
GXFifoObj* GXInit(GXFifoObj* fifo, u32 size);
void __GXDefaultTexRegionCallback(void);
M2C_UNK __GXDefaultTlutRegionCallback(u32 arg0);
#define DOLPHIN_GX_GXLIGHT_H
#define DOLPHIN_GX___TYPES_H
#define GX_WRITE_U8(ub) WGPIPE.u8 = ((u8*) &ub);
#define GX_WRITE_U16(us) WGPIPE.u16 = (*(u16*) &us);
#define GX_WRITE_U32(ui) WGPIPE.u32 = (*(u32*) &ui);
#define GX_WRITE_F32(f) WGPIPE.f32 = (*(f32*) &f);
#define INSERT_FIELD(reg, value, nbits, shift) (reg) = ((u32) (reg) & ~(((1 << (nbits)) - 1) << (shift))) | ((u32) (value) << (shift));
// GXFifoObj private fields
typedef struct __GXFifoObj {
    void* base; // at 0x00
    void* end; // at 0x04
    u32 size; // at 0x08
    u32 hiWaterMark; // at 0x0C
    u32 loWaterMark; // at 0x10
    void* readPtr; // at 0x14
    void* writePtr; // at 0x18
    s32 x1C; // at 0x1C
    u8 x20_pad[4]; // at 0x20
} __GXFifoObj;
struct GXContext {
    union {
        u32 u32;
        u16 u16[2];
    } x0; // at 0x000
    u16 x4; // at 0x004
    u16 x6; // at 0x006
    OSContext* x8; // at 0x008
    u32 xC; // at 0x00C
    u32 x10; // at 0x010
    u32 x14; // at 0x014
    u32 x18; // at 0x018
    s32 x1C_data[(0x3C - 0x1C) / 4]; // at 0x01C
    s32 x3C_data[(0x5C - 0x3C) / 4]; // at 0x03C
    s32 x5C_data[(0x7C - 0x5C) / 4]; // at 0x05C
    s32 x7C; // at 0x07C
    s32 x80; // at 0x080
    s32 x84; // at 0x084
    u32 x88_data[4]; // at 0x088
    u32 x98_data[4]; // at 0x098
    u32 ambColors[2]; // at 0x0A8
    u32 matColors[2]; // at 0x0B0
    s32 xB8[GX_MAX_TEXCOORD]; // at 0x0B8
    u8 xD8_pad[0xF8 - 0xD8]; // at 0x0D8
    s32 xF8; // at 0x0F8
    s32 xFC; // at 0x0FC
    u32 x100_data[(0x130 - 0x100) / 4]; // at 0x100
    u32 x130_data[(0x170 - 0x130) / 4]; // at 0x130
    u32 x170_data[(0x1AC - 0x170) / 4]; // at 0x170
    u8 x1AC_pad[0x1B0 - 0x1AC]; // at 0x1AC
    GXTexRegionCallback callbacks[(0x1D0 - 0x1B0) / 4]; // at 0x1B0
    u32 x1D0[(0x204 - 0x1D0) / 4]; // at 0x1D0
    u32 x204; // at 0x204
    u8 x208_pad[0x2D0 - 0x208]; // at 0x208
    struct {
        u32 unk[4];
    } x2D0[(0x410 - 0x2D0) / 16]; // at 0x2D0
    GXTexRegionCallback tex_region_cb; // at 0x410
    GXTexRegionCallback tlut_region_cb; // at 0x414
    u32 x418; // at 0x418
    GXBool x41C; // at 0x41C
    GXBool x41D; // at 0x41D
    u32 projection_type; // at 0x420
    f32 projection_v[6]; // at 0x424
    f32 viewport_v[6]; // at 0x43C
    u8 x454_pad[4]; // at 0x454
    f32 x458; // at 0x458
    s32 x45C_data[0x20 / 4]; // at 0x45C
    s32 x47C_data[0x20 / 4]; // at 0x47C
    u32 x49C_data[(0x4EC - 0x49C) / 4]; // at 0x49C
    u8 x4EC; // at 0x4EC
    GXBool x4ED; // at 0x4ED
    u8 x4EE; // at 0x4EE
    u32 x4F0_flags; // at 0x4F0
    GXFifoObj* fifo; // at 0x4F4
    u8 x4F8_pad[0x570 - 0x4F8]; // at 0x4F8
    u32 dirtyFlags; // at 0x570
};
struct GXSettings {
    u16 z_mode;
    u16 color_settings;
    u16 dst_alpha;
    u16 x6;
    u16 x8;
};
extern volatile u32* __piReg;
extern volatile u16* __peReg;
extern volatile u16* __cpReg;
extern volatile u32* __memReg;
extern volatile union WGPIPE_T {
    s8 s8;
    u8 u8;
    s16 s16;
    u16 u16;
    u32 u32;
    s32 s32;
    void* ptr;
    f32 f32;
} WGPIPE ;
typedef struct __GXGPFifo {
    u16 x0;
    s16 x2;
    s16 x4;
    s16 x6;
    u8 x8_pad[0x38 - 0x8];
} __GXGPFifo;
struct GXContexts {
    GXContext* main;
    GXContext* null;
};
struct GXTexObj {
    u8 x0_pad[0x8];
    u32 dimensions;
    u8 xC_pad[0x8];
    GXTexFmt tex_fmt; // at 0x14
    u8 x18_pad[8]; // at 0x18
};
struct GXTlutObj {
    u32 dummy[3];
};
typedef struct _GXLightObj {
    char x0[0xC]; // at 0x00
    GXColor color; // at 0x0C
    f32 aa; // at 0x10
    f32 ab; // at 0x14
    f32 ac; // at 0x18
    f32 ka; // at 0x1C
    f32 kb; // at 0x20
    f32 kc; // at 0x24
    Vec3 pos; // at 0x28
    Vec3 dir; // at 0x34
} GXLightObj;
void GXInitLightAttn(GXLightObj* light, f32 aa, f32 ab, f32 ac, f32 ka, f32 kb,
                     f32 kc);
void GXInitLightSpot(GXLightObj* light, f32 angle, GXSpotFn fn);
void GXInitLightDistAttn(GXLightObj* light, f32 ref_distance,
                         f32 ref_brightness, GXDistAttnFn dist_fn);
void GXInitLightPos(GXLightObj* light, f32 x, f32 y, f32 z);
void GXInitLightDir(GXLightObj* light, f32 x, f32 y, f32 z);
void GXInitLightColor(GXLightObj* light, GXColor color);
void GXLoadLightObjImm(GXLightObj* light, GXLightID light_id);
void GXSetChanAmbColor(GXChannelID chan, GXColor* color);
void GXSetChanMatColor(GXChannelID chan, GXColor* color);
void GXSetNumChans(u8 num_chans);
void GXSetChanCtrl(GXChannelID chan, GXBool enable, GXColorSrc amb_src,
                   GXColorSrc mat_src, u32 light_mask, GXDiffuseFn diff_fn,
                   GXAttnFn attn_fn);
#define DOLPHIN_GX_GXMISC_H
void GXPixModeSync(void);
void GXWaitDrawDone(void);
void GXSetDrawDone(void);
void GXSetMisc(s32, u32);
void GXPokeAlphaMode(GXCompare func, u8 threshold);
void GXPokeAlphaRead(s32 mode);
void GXPokeAlphaUpdate(bool update_enable);
void GXPokeColorUpdate(bool update_enable);
void GXPokeDstAlpha(bool enable, u8 alpha);
void GXPokeDither(s32 dither);
void GXPokeZMode(bool compare_enable, GXCompare func, bool update_enable);
void GXTokenInterruptHandler(__OSInterrupt _, OSContext* current_ctx);
GXDrawDoneCallback GXSetDrawDoneCallback(GXDrawDoneCallback cb);
void GXFinishInterruptHandler(__OSInterrupt _, OSContext* current_ctx);
void __GXPEInit(void);
void GXPokeBlendMode(GXBlendMode type, GXBlendFactor src_factor,
                     GXBlendFactor dst_factor, GXLogicOp op);
#define DOLPHIN_GX_GXPERF_H
void GXClearGPMetric(void);
void GXSetGPMetric(u32, u32);
#define DOLPHIN_GX_GXPIXEL_H
typedef struct _GXFogAdjTbl {
    u16 r[10];
} GXFogAdjTbl;
void GXSetFieldMode(int, int);
void GXInitFogAdjTable(GXFogAdjTbl*, u16, Mtx44);
void GXSetFogRangeAdj(s8, u16, GXFogAdjTbl*);
void GXSetPixelFmt(int, int);
void GXSetFieldMask(s32, s8);
void GXSetDstAlpha(u8, u8);
void GXSetDither(u8);
void GXSetZCompLoc(u8);
void GXSetZMode(u8, u32, u32);
void GXSetAlphaUpdate(u8);
void GXSetColorUpdate(u8);
void GXSetBlendMode(s32, s32, s32, s32);
void GXSetFog(s32, GXColor, f32, f32, f32, f32);
#define DOLPHIN_GX_GXSTUBS_H
void __GXSetRange(f32 nearz, f32);
#define DOLPHIN_GX_GXTEV_H
void GXSetTevOp(GXTevStageID id, GXTevMode mode);
void GXSetTevColorIn(GXTevStageID stage, GXTevColorArg a, GXTevColorArg b,
                     GXTevColorArg c, GXTevColorArg d);
void GXSetTevAlphaIn(GXTevStageID stage, GXTevAlphaArg a, GXTevAlphaArg b,
                     GXTevAlphaArg c, GXTevAlphaArg d);
void GXSetTevColorOp(GXTevStageID stage, GXTevOp op, GXTevBias bias,
                     GXTevScale scale, GXBool clamp, GXTevRegID out_reg);
void GXSetTevAlphaOp(GXTevStageID stage, GXTevOp op, GXTevBias bias,
                     GXTevScale scale, GXBool clamp, GXTevRegID out_reg);
void GXSetTevColor(GXTevRegID id, GXColor color);
void GXSetTevKColor(GXTevKColorID id, GXColor color);
void GXSetTevKColorSel(GXTevStageID stage, GXTevKColorSel sel);
void GXSetTevKAlphaSel(GXTevStageID stage, GXTevKAlphaSel sel);
void GXSetTevSwapMode(GXTevStageID stage, GXTevSwapSel ras_sel,
                      GXTevSwapSel tex_sel);
void GXSetTevSwapModeTable(GXTevSwapSel table, GXTevColorChan red,
                           GXTevColorChan green, GXTevColorChan blue,
                           GXTevColorChan alpha);
void GXSetAlphaCompare(GXCompare comp0, u8 ref0, GXAlphaOp op, GXCompare comp1,
                       u8 ref1);
void GXSetZTexture(GXZTexOp op, GXTexFmt fmt, u32 bias);
void GXSetTevOrder(GXTevStageID stage, GXTexCoordID coord, GXTexMapID map,
                   GXChannelID color);
void GXSetNumTevStages(u8 nStages);
void GXSetTevColorS10(s32, GXColorS10);
void GXSetTevClampMode(s32 arg0, s32 arg1);
#define DOLPHIN_GX_GXTEXTURE_H
void __GXSetSUTexSize(void);
void GXLoadTexObjPreLoaded(const GXTexObj*, M2C_UNK, GXTexMapID);
void GXInvalidateTexAll(void);
GXTexRegionCallback GXSetTlutRegionCallback(GXTexRegionCallback arg0);
void __SetSURegs(s32, s32);
void GXInitTexObj(GXTexObj*, void*, u16, u16, GXTexFmt, GXTexWrapMode,
                  GXTexWrapMode, GXBool);
s32 GXGetTexObjWidth(GXTexObj* tex_obj);
s32 GXGetTexObjHeight(GXTexObj* tex_obj);
GXTexFmt GXGetTexObjFmt(GXTexObj* tex_obj);
void GXLoadTexObj(const GXTexObj*, GXTexMapID);
void GXInitTlutRegion(s32* arg0, s32 arg1, s32 arg2);
s32 GXGetTexBufferSize(u16, u16, u32, u8, u8);
void GXInitTexObjCI(GXTexObj*, void*, u16, u16, GXCITexFmt, GXTexWrapMode,
                    GXTexWrapMode, GXBool, u32);
void GXInitTexObjLOD(GXTexObj*, GXTexFilter, GXTexFilter, f32, f32, f32,
                     GXBool, GXBool, GXAnisotropy);
void GXInitTlutObj(GXTlutObj*, void*, GXTlutFmt, u16);
void GXLoadTlut(GXTlutObj*, s32);
void __GXSetTmemConfig(s32);
GXTexRegionCallback GXSetTexRegionCallback(GXTexRegionCallback arg0);
void GXInitTexCacheRegion(M2C_UNK, s8, u32, s32, u32, s32, s32);
void __GetImageTileCount(u32, s16, s16, s32*, s32*, s32*);
#define DOLPHIN_GX_GXTRANSFORM_H
void GXProject(f32 x, // model coordinates
               f32 y, f32 z,
               Mtx mtx, // model-view matrix
               f32* pm, // projection matrix, as returned by GXGetProjectionv
               f32* vp, // viewport, as returned by GXGetViewportv
               f32* sx, // screen coordinates
               f32* sy, f32* sz);
void GXSetViewportJitter(f32 left, f32 top, f32 wd, f32 ht, f32 nearz,
                         f32 farz, u32 field);
void GXSetViewport(f32, f32, f32, f32, f32, f32);
void GXLoadTexMtxImm(void* arg0, u32 arg1, s32 arg2);
void GXSetCurrentMtx(s32 arg0);
void GXLoadNrmMtxImm(M2C_UNK, s32);
void GXLoadPosMtxImm(M2C_UNK, s32);
void GXSetScissor(s32 left, s32 top, s32 width, s32 height);
void GXSetScissorBoxOffset(u32 x_off, u32 y_off);
void GXGetProjectionv(f32* proj);
void GXGetViewportv(f32* viewport_v);
void GXSetProjection(Mtx44 proj, s32 projection_type);
void WriteMTXPS4x3(float* src, float* dst);
void WriteMTXPS3x3from3x4(float* src, float* dst);
void WriteMTXPS4x2(float* src, float* dst);
void __GXSetMatrixIndex(s32);
void GXSetClipMode(s32);
#define _DOLPHIN_GXVERT_H_
static inline void GXPosition3f32(const f32 x, const f32 y, const f32 z)
{
    WGPIPE.f32 = x;
    WGPIPE.f32 = y;
    WGPIPE.f32 = z;
}
static inline void GXPosition3u16(const u16 x, const u16 y, const u16 z)
{
    WGPIPE.u16 = x;
    WGPIPE.u16 = y;
    WGPIPE.u16 = z;
}
static inline void GXPosition3s16(const s16 x, const s16 y, const s16 z)
{
    WGPIPE.s16 = x;
    WGPIPE.s16 = y;
    WGPIPE.s16 = z;
}
static inline void GXPosition3u8(const u8 x, const u8 y, const u8 z)
{
    WGPIPE.u8 = x;
    WGPIPE.u8 = y;
    WGPIPE.u8 = z;
}
static inline void GXPosition3s8(const s8 x, const s8 y, const s8 z)
{
    WGPIPE.s8 = x;
    WGPIPE.s8 = y;
    WGPIPE.s8 = z;
}
static inline void GXPosition2f32(const f32 x, const f32 y)
{
    WGPIPE.f32 = x;
    WGPIPE.f32 = y;
}
static inline void GXPosition2u16(const u16 x, const u16 y)
{
    WGPIPE.u16 = x;
    WGPIPE.u16 = y;
}
static inline void GXPosition2s16(const s16 x, const s16 y)
{
    WGPIPE.s16 = x;
    WGPIPE.s16 = y;
}
static inline void GXPosition2u8(const u8 x, const u8 y)
{
    WGPIPE.u8 = x;
    WGPIPE.u8 = y;
}
static inline void GXPosition2s8(const s8 x, const s8 y)
{
    WGPIPE.s8 = x;
    WGPIPE.s8 = y;
}
static inline void GXPosition1x8(const u8 index)
{
    WGPIPE.u8 = index;
}
static inline void GXPosition1x16(const u16 index)
{
    WGPIPE.u16 = index;
}
static inline void GXNormal3f32(const f32 nx, const f32 ny, const f32 nz)
{
    WGPIPE.f32 = nx;
    WGPIPE.f32 = ny;
    WGPIPE.f32 = nz;
}
static inline void GXNormal3s16(const s16 nx, const s16 ny, const s16 nz)
{
    WGPIPE.s16 = nx;
    WGPIPE.s16 = ny;
    WGPIPE.s16 = nz;
}
static inline void GXNormal3s8(const s8 nx, const s8 ny, const s8 nz)
{
    WGPIPE.s8 = nx;
    WGPIPE.s8 = ny;
    WGPIPE.s8 = nz;
}
static inline void GXNormal1x8(const u8 index)
{
    WGPIPE.u8 = index;
}
static inline void GXNormal1x16(const u16 index)
{
    WGPIPE.u16 = index;
}
static inline void GXColor4u8(const u8 r, const u8 g, const u8 b, const u8 a)
{
    WGPIPE.u8 = r;
    WGPIPE.u8 = g;
    WGPIPE.u8 = b;
    WGPIPE.u8 = a;
}
static inline void GXColor3u8(const u8 r, const u8 g, const u8 b)
{
    WGPIPE.u8 = r;
    WGPIPE.u8 = g;
    WGPIPE.u8 = b;
}
static inline void GXColor3f32(const f32 r, const f32 g, const f32 b)
{
    WGPIPE.u8 = (u8) (r * 255.0);
    WGPIPE.u8 = (u8) (g * 255.0);
    WGPIPE.u8 = (u8) (b * 255.0);
}
static inline void GXColor1u32(const u32 clr)
{
    WGPIPE.u32 = clr;
}
static inline void GXColor1u16(const u16 clr)
{
    WGPIPE.u16 = clr;
}
static inline void GXColor1x8(const u8 index)
{
    WGPIPE.u8 = index;
}
static inline void GXColor1x16(const u16 index)
{
    WGPIPE.u16 = index;
}
static inline void GXTexCoord2f32(const f32 s, const f32 t)
{
    WGPIPE.f32 = s;
    WGPIPE.f32 = t;
}
static inline void GXTexCoord2u16(const u16 s, const u16 t)
{
    WGPIPE.u16 = s;
    WGPIPE.u16 = t;
}
static inline void GXTexCoord2s16(const s16 s, const s16 t)
{
    WGPIPE.s16 = s;
    WGPIPE.s16 = t;
}
static inline void GXTexCoord2u8(const u8 s, const u8 t)
{
    WGPIPE.u8 = s;
    WGPIPE.u8 = t;
}
static inline void GXTexCoord2s8(const s8 s, const s8 t)
{
    WGPIPE.s8 = s;
    WGPIPE.s8 = t;
}
static inline void GXTexCoord1f32(const f32 s)
{
    WGPIPE.f32 = s;
}
static inline void GXTexCoord1u16(const u16 s)
{
    WGPIPE.u16 = s;
}
static inline void GXTexCoord1s16(const s16 s)
{
    WGPIPE.s16 = s;
}
static inline void GXTexCoord1u8(const u8 s)
{
    WGPIPE.u8 = s;
}
static inline void GXTexCoord1s8(const s8 s)
{
    WGPIPE.s8 = s;
}
static inline void GXTexCoord1x8(const u8 index)
{
    WGPIPE.u8 = index;
}
static inline void GXTexCoord1x16(const u16 index)
{
    WGPIPE.u16 = index;
}
static inline void GXMatrixIndex1u8(const u8 index)
{
    WGPIPE.u8 = index;
}
#define DOLPHIN_GX___GXBUMP_H
void __GXFlushTextureState(void);
#define DOLPHIN_GX___GXFIFO_H
void __GXFifoInit(void);
void GXSetGPFifo(GXFifoObj* fifo);
void GXSetCPUFifo(GXFifoObj* fifo);
void GXInitFifoBase(GXFifoObj* fifo, void* base, u32 size);
#define DOLPHIN_GX___GXINIT_H
/* 004D2788 */ extern GXContexts __GXContexts;
static inline void set_x2(GXBool value)
{
    __GXContexts.main->x0.u16[1] = value;
}
#define DOLPHIN_GX___GXMISC_HG
/* 00339BB0 */ extern void __GXPEInit(void);
void GXPokeZMode(bool compare_enable, GXCompare func, bool update_enable);
void GXPokeDstAlpha(bool enable, u8 alpha);
void GXPokeAlphaRead(s32 mode);
void GXPokeAlphaMode(GXCompare func, u8 threshold);
void GXPokeBlendMode(GXBlendMode type, GXBlendFactor src_factor,
                     GXBlendFactor dst_factor, GXLogicOp op);
void GXPokeDither(s32 dither);
void GXPokeAlphaUpdate(bool update_enable);
void GXPokeColorUpdate(bool update_enable);
#define __MTX_H__
void C_MTXOrtho(Mtx44 m, f32 t, f32 b, f32 l, f32 r, f32 n, f32 f);
void C_MTXPerspective(Mtx44 m, f32 fovY, f32 aspect, f32 n, f32 f);
void C_MTXIdentity(Mtx m);
void C_MTXCopy(const Mtx src, Mtx dst);
void C_MTXConcat(const Mtx a, const Mtx b, Mtx ab);
void C_MTXConcatArray(const Mtx a, const Mtx* srcBase, Mtx* dstBase,
                      u32 count);
void C_MTXTranspose(const Mtx src, Mtx xPose);
void C_MTXFrustum(Mtx44 m, f32 t, f32 b, f32 l, f32 r, f32 n, f32 f);
u32 C_MTXInverse(const Mtx src, Mtx inv);
u32 C_MTXInvXpose(const Mtx src, Mtx invX);
void PSMTXIdentity(Mtx m);
void PSMTXCopy(const Mtx src, Mtx dst);
void PSMTXConcat(const Mtx a, const Mtx b, Mtx ab);
void PSMTXConcatArray(const Mtx a, const Mtx* srcBase, Mtx* dstBase,
                      u32 count);
void PSMTXTranspose(const Mtx src, Mtx xPose);
u32 PSMTXInverse(const Mtx src, Mtx inv);
u32 PSMTXInvXpose(const Mtx src, Mtx invX);
#define MTXIdentity PSMTXIdentity
#define MTXCopy PSMTXCopy
#define MTXConcat PSMTXConcat
#define MTXConcatArray PSMTXConcatArray
#define MTXTranspose PSMTXTranspose
#define MTXInverse PSMTXInverse
#define MTXInvXpose PSMTXInvXpose
void C_MTXQuat(Mtx m, const Quaternion* q);
void C_MTXReflect(Mtx m, const Vec3* p, const Vec3* n);
void C_MTXTrans(Mtx m, f32 xT, f32 yT, f32 zT);
void C_MTXTransApply(const Mtx src, Mtx dst, f32 xT, f32 yT, f32 zT);
void C_MTXScale(Mtx m, f32 xS, f32 yS, f32 zS);
void C_MTXScaleApply(const Mtx src, Mtx dst, f32 xS, f32 yS, f32 zS);
void C_MTXRotRad(Mtx m, char axis, f32 rad);
void C_MTXRotTrig(Mtx m, char axis, f32 sinA, f32 cosA);
void C_MTXRotAxisRad(Mtx m, const Vec3* axis, f32 rad);
void C_MTXLookAt(Mtx m, Vec3* cam_pos, Vec3* up, Vec3* target);
void PSMTXQuat(Mtx m, const Quaternion* q);
void PSMTXReflect(Mtx m, const Vec3* p, const Vec3* n);
void PSMTXTransApply(const Mtx src, Mtx dst, f32 xT, f32 yT, f32 zT);
void PSMTXScaleApply(const Mtx src, Mtx dst, f32 xS, f32 yS, f32 zS);
void PSMTXRotRad(Mtx m, char axis, f32 rad);
void PSMTXRotTrig(Mtx m, char axis, f32 sinA, f32 cosA);
void PSMTXRotAxisRad(Mtx m, const Vec3* axis, f32 rad);
#define MTXQuat PSMTXQuat
#define MTXReflect PSMTXReflect
#define MTXTrans PSMTXTrans
#define MTXTransApply PSMTXTransApply
#define MTXScale PSMTXScale
#define MTXScaleApply PSMTXScaleApply
#define MTXRotRad PSMTXRotRad
#define MTXRotTrig PSMTXRotTrig
#define MTXRotAxisRad PSMTXRotAxisRad
void PSMTXIdentity(Mtx m);
void PSMTXTrans(Mtx m, f32 x_trans, f32 y_trans, f32 z_trans);
void PSMTXScale(Mtx m, f32 x_scale, f32 y_scale, f32 z_scale);
#define MTXLightPerspective C_MTXLightPerspective
#define MTXLightFrustum C_MTXLightFrustum
#define MTXLightOrtho C_MTXLightOrtho
void C_MTXLightPerspective(Mtx m, f32 fov, f32 aspect, f32 x_scale,
                           f32 y_scale, f32 z_x_mult, f32 z_y_mult);
void C_MTXLightFrustum(Mtx m, f32 top, f32 bottom, f32 left, f32 right,
                       f32 near, f32 x_scale, f32 y_scale, f32 z_x_mult,
                       f32 z_y_mult);
void C_MTXLightOrtho(Mtx m, f32 top, f32 bottom, f32 left, f32 right,
                     f32 x_scale, f32 y_scale, f32 z_x_mult, f32 z_y_mult);
#define DOLPHIN_MTX_MTXVEC_H
void PSMTXMUltiVec(Mtx, Vec3*, Vec3*);
void PSMTXMultVecSR(Mtx, Vec3*, Vec3*);
#define DOLPHIN_MTX_VEC_H
#define VEC2_SQ_LEN(v) ((SQ((v).x) + SQ((v).y)))
#define VEC3_SQ_LEN(v) ((SQ((v).x) + SQ((v).y) + SQ((v).z)))
#define VECCrossProduct PSVECCrossProduct
#define VECSubtract PSVECSubtract
#define VECNormalize PSVECNormalize
#define VECAdd PSVECAdd
#define VECScale PSVECScale
#define VECMag PSVECMag
#define VECDotProduct PSVECDotProduct
void PSVECCrossProduct(Vec3* a, Vec3* b, Vec3* axb);
void PSVECSubtract(Vec3 const* a, Vec3 const* b, Vec3* ab);
void PSVECNormalize(Vec3* a, Vec3* b);
void PSVECAdd(Vec3* a, Vec3* b, Vec3* result);
void PSVECScale(Vec3* src, Vec3* dst, float scale);
float PSVECMag(Vec3* v);
float PSVECDotProduct(Vec3* a, Vec3* b);
#define DOLPHIN_OS_OSAUDIOSYSTEM_H
void __OSInitAudioSystem(void);
void __OSStopAudioSystem(void);
typedef struct OSBootInfo {
    DVDDiskID DVDDiskID; // _00
    u32 magic; // _20
    u32 version; // _24
    u32 memorySize; // _28
    u32 consoleType; // _2C
    void* arenaLo; // _30, overrides __ArenaLo if non-null
    void* arenaHi; // _34, overrides FSTLocation if non-null
    void* FSTLocation; // _38, start addr of FST area
    u32 FSTMaxLength; // _3C, length of FST area
} OSBootInfo;
/** @file
 * @todo Should be called @c OS.h.
 */
#define DOLPHIN_OS_OS_H
extern vu32 __PIRegs[12] ;
extern vu32 __DIRegs[16] ;
__OSExceptionHandler __OSGetExceptionHandler(u8);
__OSExceptionHandler __OSSetExceptionHandler(u8, __OSExceptionHandler);
u32 OSGetConsoleType(void);
void OSInit(void);
void __OSPSInit(void);
void OSExceptionInit(void);
void __OSDBIntegrator(void);
void __OSDBJump(void);
void __DBVECTOR(void);
void __OSEVSetNumber(void);
void __OSEVEnd(void);
void OSExceptionVector(void);
void OSDefaultExceptionHandler(void);
void ClearArena(void);
u32 __OSGetDIConfig(void);
#define DOLPHIN_OS_OSREBOOT_H
void __OSReboot(u32 resetCode, bool forceMenu);
void Run(Event);
void __OSReboot(u32 resetCode, bool forceMenu);
#define DOLPHIN_OS_OSRTC
typedef struct OSSram {
    u16 checkSum;
    u16 checkSumInv;
    u32 ead0;
    u32 ead1;
    u32 counterBias;
    s8 displayOffsetH;
    u8 ntd;
    u8 language;
    u8 flags;
} OSSram;
typedef struct OSSramEx {
    u8 flashID[2][12];
    u32 wirelessKeyboardID;
    u16 wirelessPadID[4];
    u8 dvdErrorCode;
    u8 _padding0;
    u8 flashIDCheckSum[2];
    u16 gbs;
    u8 _padding1[2];
} OSSramEx;
OSSram* __OSLockSram(void);
OSSramEx* __OSLockSramEx(void);
void __OSUnlockSram(bool commit);
void __OSUnlockSramEx(bool commit);
bool __OSSyncSram(void);
u32 OSGetWirelessID(u32 chan);
void OSSetWirelessID(u32 chan, u16 id);
u32 OSGetSoundMode(void);
void OSSetSoundMode(u32 mode);
u32 OSGetProgressiveMode(void);
void OSSetProgressiveMode(u32 mode);
void WriteSramCallback(s32 unused0, OSContext* unused1);
void __OSInitSram(void);
#define DOLPHIN_OS_OSUARTEXI_H
s32 ReadUARTN(void);
void WriteUARTN(void);
s32 InitializeUART(void);
#define DOLPHIN_OS_INIT___PPC_EABI_INIT_H
void __init_user(void);
 void _ExitProcess(void);
 void __init_hardware(void);
 void __flush_cache(void* address, size_t size);
#define DOLPHIN_OS_INIT___START_H
#define PAD3_BUTTON_ADDR 0x800030E4
#define EXCEPTIONMASK_ADDR 0x80000044
#define BOOTINFO2_ADDR 0x800000F4
#define OS_BI2_DEBUGFLAG_OFFSET 0xC
#define ARENAHI_ADDR 0x80000034
#define DEBUGFLAG_ADDR 0x800030E8
#define DVD_DEVICECODE_ADDR 0x800030E6
#define MSR_FP 0x2000
extern void InitMetroTRK(void);
u16 Pad3Button ;
extern int main(int argc, char* argv[]);
extern void exit(int);
extern void __init_user(void);
extern void OSInit(void);
extern void DBInit(void);
 void __check_pad3(void);
 void __start(void);
 void __init_data(void);
 void __init_hardware(void);
 void __flush_cache(void* address, size_t size);
 extern u8 _stack_addr[];
 extern u8 _SDA_BASE_[];
 extern u8 _SDA2_BASE_[];
typedef struct __rom_copy_info {
    u8* rom;
    void* addr;
    size_t size;
} __rom_copy_info;
 extern __rom_copy_info _rom_copy_info[];
typedef struct __bss_init_info {
    void* addr;
    size_t size;
} __bss_init_info;
 extern __bss_init_info _bss_init_info[];
#define DOLPHIN_PAD_PADCLAMP_H
void ClampStick(s8* px, s8* py, s8 max, s8 xy, s8 min);
#define DOLPHIN_PAD_FORWARD_H
typedef struct PADStatus PADStatus;
#define _PAD_H_
#define PAD_CHAN0 0
#define PAD_CHAN1 1
#define PAD_CHAN2 2
#define PAD_CHAN3 3
#define PAD_CHANMAX 4
#define PAD_CHAN0_BIT 0x80000000
#define PAD_CHAN1_BIT 0x40000000
#define PAD_CHAN2_BIT 0x20000000
#define PAD_CHAN3_BIT 0x10000000
#define PAD_ERR_NO_CONTROLLER -1
#define PAD_ERR_NONE 0
#define PAD_SPEC_2 2
struct PADStatus {
    u16 button;
    s8 stickX;
    s8 stickY;
    s8 substickX;
    s8 substickY;
    u8 triggerLeft;
    u8 triggerRight;
    u8 analogA;
    u8 analogB;
    s8 err;
};
extern u32 __PADFixBits;
void PADControlMotor(int chan, u32 command);
void VISetBlack(bool);
u32 VIGetRetraceCount(void);
void PADClamp(PADStatus*);
void PADRead(u8*);
void PADReset(u32);
void PADTypeAndStatusCallback(s32 chan, u32 type);
void PADSetSpec(s32);
void PADInit(void);
bool __PADDisableRecalibration(bool);
void PADRecalibrate(s32);
void PADOriginCallback(s32 unused0, s32 arg1);
void PADOriginUpdateCallback(s32 chan, u32 error, OSContext* context);
void PADProbeCallback(s32 chan, u32 error, OSContext* context);
void UpdateOrigin(s32 arg0);
#define _vi_h_
#define VIPadFrameBufferWidth(width) ((u16) (((u16) (width) + 15) & ~15))
#define VI_NTSC 0
#define VI_PAL 1
#define VI_MPAL 2
#define VI_DEBUG 3
#define VI_DEBUG_PAL 4
#define VI_EURGB60 5
typedef void (*VIRetraceCallback)(u32 retraceCount);
u32 VIGetTvFormat(void);
void VIConfigure(GXRenderModeObj*);
void VISetBlack(bool);
void VIFlush(void);
void VISetNextFrameBuffer(void*);
void VIWaitForRetrace(void);
void VIInit(void);
u32 VIGetNextField(void);
M2C_UNK VIGetDTVStatus(void);
VIRetraceCallback VISetPreRetraceCallback(VIRetraceCallback callback);
VIRetraceCallback VISetPostRetraceCallback(VIRetraceCallback callback);
#define GALE01_028B9C
#define MELEE_CM_FORWARD_H
typedef struct Camera Camera;
typedef struct CameraBounds CameraBounds;
typedef struct CameraBox CameraBox;
typedef struct CameraMovement CameraMovement;
#define SYSDOLPHIN_BASELIB_FORWARD_H
typedef struct HSD_AnimJoint HSD_AnimJoint;
typedef struct HSD_AObj HSD_AObj;
typedef struct HSD_AObjDesc HSD_AObjDesc;
typedef struct HSD_Archive HSD_Archive;
typedef struct HSD_ArchiveExternInfo HSD_ArchiveExternInfo;
typedef struct HSD_ArchiveHeader HSD_ArchiveHeader;
typedef struct HSD_ArchivePublicInfo HSD_ArchivePublicInfo;
typedef struct HSD_ArchiveRelocationInfo HSD_ArchiveRelocationInfo;
typedef struct HSD_ByteCodeExpDesc HSD_ByteCodeExpDesc;
typedef struct HSD_CameraAnim HSD_CameraAnim;
typedef struct HSD_CameraDescCommon HSD_CameraDescCommon;
typedef struct HSD_CameraDescFrustum HSD_CameraDescFrustum;
typedef struct HSD_CameraDescPerspective HSD_CameraDescPerspective;
typedef struct HSD_CObj HSD_CObj;
typedef struct HSD_CObjInfo HSD_CObjInfo;
typedef struct HSD_DObj HSD_DObj;
typedef struct HSD_DObjDesc HSD_DObjDesc;
typedef struct HSD_DObjInfo HSD_DObjInfo;
typedef struct HSD_Envelope HSD_Envelope;
typedef struct HSD_EnvelopeDesc HSD_EnvelopeDesc;
typedef struct HSD_Exp HSD_Exp;
typedef struct HSD_ExpDesc HSD_ExpDesc;
typedef struct HSD_Fog HSD_Fog;
typedef struct HSD_FogAdj HSD_FogAdj;
typedef struct HSD_FogAdjDesc HSD_FogAdjDesc;
typedef struct HSD_FogAdjInfo HSD_FogAdjInfo;
typedef struct HSD_FogDesc HSD_FogDesc;
typedef struct HSD_FogInfo HSD_FogInfo;
typedef struct HSD_GObj HSD_GObj;
typedef struct HSD_GObjProc HSD_GObjProc;
typedef struct HSD_Hash HSD_Hash;
typedef struct HSD_HashEntry HSD_HashEntry;
typedef struct HSD_IKHint HSD_IKHint;
typedef struct HSD_IKHintDesc HSD_IKHintDesc;
typedef struct HSD_ImageDesc HSD_ImageDesc;
typedef struct HSD_JObj HSD_JObj;
typedef struct HSD_Joint HSD_Joint;
typedef struct HSD_LightAnim HSD_LightAnim;
typedef struct HSD_LightAttn HSD_LightAttn;
typedef struct HSD_LightDesc HSD_LightDesc;
typedef struct HSD_LightPoint HSD_LightPoint;
typedef struct HSD_LightPointDesc HSD_LightPointDesc;
typedef struct HSD_LightSpot HSD_LightSpot;
typedef struct HSD_LightSpotDesc HSD_LightSpotDesc;
typedef struct HSD_LObj HSD_LObj;
typedef struct HSD_LObjInfo HSD_LObjInfo;
typedef struct HSD_MatAnimJoint HSD_MatAnimJoint;
typedef struct HSD_Material HSD_Material;
typedef struct HSD_MObj HSD_MObj;
typedef struct HSD_MObjInfo HSD_MObjInfo;
typedef struct HSD_Obj HSD_Obj;
typedef struct HSD_PadData HSD_PadData;
typedef struct HSD_PadRumbleListData HSD_PadRumbleListData;
typedef struct HSD_PadStatus HSD_PadStatus;
typedef struct HSD_PEDesc HSD_PEDesc;
typedef struct HSD_PObj HSD_PObj;
typedef struct HSD_PObjDesc HSD_PObjDesc;
typedef struct HSD_PObjInfo HSD_PObjInfo;
typedef struct HSD_RObj HSD_RObj;
typedef struct HSD_RObjAnimJoint HSD_RObjAnimJoint;
typedef struct HSD_RObjDesc HSD_RObjDesc;
typedef struct HSD_RumbleData HSD_RumbleData;
typedef struct HSD_Rvalue HSD_Rvalue;
typedef struct HSD_RvalueList HSD_RvalueList;
typedef struct HSD_Shadow HSD_Shadow;
typedef struct HSD_ShapeAnim HSD_ShapeAnim;
typedef struct HSD_ShapeAnimDObj HSD_ShapeAnimDObj;
typedef struct HSD_ShapeAnimJoint HSD_ShapeAnimJoint;
typedef struct HSD_ShapeSet HSD_ShapeSet;
typedef struct HSD_ShapeSetDesc HSD_ShapeSetDesc;
typedef struct HSD_SM HSD_SM;
typedef struct HSD_Spline HSD_Spline;
typedef struct HSD_TExpDag HSD_TExpDag;
typedef struct HSD_TExpRes HSD_TExpRes;
typedef struct HSD_TObj HSD_TObj;
typedef struct HSD_ViewingRect HSD_ViewingRect;
typedef struct HSD_VtxDescList HSD_VtxDescList;
typedef struct HSD_WObj HSD_WObj;
typedef struct HSD_WObjAnim HSD_WObjAnim;
typedef struct HSD_WObjDesc HSD_WObjDesc;
typedef struct HSD_WObjInfo HSD_WObjInfo;
typedef struct PadLibData PadLibData;
typedef struct RumbleCommand RumbleCommand;
typedef struct RumbleInfo RumbleInfo;
typedef struct TextKerning TextKerning;
typedef struct UnkGeneratorMember UnkGeneratorMember;
typedef struct UnkGeneratorStruct UnkGeneratorStruct;
typedef union HSD_CObjDesc HSD_CObjDesc;
typedef union HSD_ObjData HSD_ObjData;
typedef union HSD_Rumble HSD_Rumble;
typedef union HSD_TExp HSD_TExp;
typedef void (*GObj_RenderFunc)(HSD_GObj* gobj, int code);
typedef void (*HSD_ObjUpdateFunc)(void* obj, enum_t type, HSD_ObjData* fval);
typedef void (*HSD_DevComCallback)(void*, int, void*, bool cancelflag);
typedef void (*HSD_GObjEvent)(HSD_GObj* gobj);
typedef void (*HSD_UserDataEvent)(void* user_data);
typedef bool (*HSD_GObjPredicate)(HSD_GObj* gobj);
typedef void (*HSD_GObjInteraction)(HSD_GObj* gobj0, HSD_GObj* gobj1);
typedef void (*HSD_MObjSetupFunc)(HSD_MObj* mobj, u32 rendermode);
#define HSD_A_S_W0 2
#define HSD_DEFAULT_MAX_SHAPE_VERTICES 2000
#define HSD_DEFAULT_MAX_SHAPE_NORMALS 2000
#define POBJ_ANIM (1 << 3)
#define POBJ_SKIN (0 << 12)
#define POBJ_SHAPEANIM (1 << 12)
#define POBJ_ENVELOPE (2 << 12)
#define pobj_type(o) (o->flags & 0x3000)
#define POBJ_CULLFRONT (1 << 14)
#define POBJ_CULLBACK (1 << 15)
#define SHAPESET_AVERAGE 1
#define SHAPESET_ADDITIVE 1 << 1
typedef enum PObjSetupFlag {
    SETUP_NORMAL = 1,
    SETUP_REFLECTION = 2,
    SETUP_HIGHLIGHT = 4,
    SETUP_NORMAL_PROJECTION = 6,
    SETUP_JOINT0 = 1,
    SETUP_JOINT1 = 2,
    SETUP_NONE = 0
} PObjSetupFlag;
typedef enum HSD_TrspMask {
    HSD_TRSP_OPA = 1,
    HSD_TRSP_XLU = 2,
    HSD_TRSP_TEXEDGE = 4,
    HSD_TRSP_ALL = 7,
} HSD_TrspMask;
#define HSD_A_L_LITC_R 9
#define HSD_A_L_LITC_G 10
#define HSD_A_L_LITC_B 11
#define HSD_A_L_VIS 12
#define HSD_A_L_A0 13
#define HSD_A_L_A1 14
#define HSD_A_L_A2 15
#define HSD_A_L_K0 16
#define HSD_A_L_K1 17
#define HSD_A_L_K2 18
#define HSD_A_L_CUTOFF 19
#define HSD_A_L_REFDIST 20
#define HSD_A_L_REFBRIGHT 21
#define HSD_A_L_LITC_A 22
#define LOBJ_AMBIENT (0 << 0)
#define LOBJ_INFINITE (1 << 0)
#define LOBJ_POINT (2 << 0)
#define LOBJ_SPOT (3 << 0)
#define LOBJ_DIFFUSE (1 << 2)
#define LOBJ_SPECULAR (1 << 3)
#define LOBJ_ALPHA (1 << 4)
#define LOBJ_HIDDEN (1 << 5)
#define LOBJ_RAW_PARAM (1 << 6)
#define LOBJ_DIFF_DIRTY (1 << 7)
#define LOBJ_SPEC_DIRTY (1 << 8)
#define LOBJ_TYPE_MASK 3
#define LOBJ_LIGHT_ATTN_NONE 0
#define LOBJ_LIGHT_ATTN 1
/* 028B9C */ void Camera_80028B9C(int);
/* 029020 */ CameraBox* Camera_80029020(void);
/* 029044 */ CameraBox* Camera_80029044(int);
/* 0290D4 */ void Camera_800290D4(CameraBox*);
/* 029124 */ M2C_UNK Camera_80029124(Vec3*, int);
/* 02928C */ s32 Camera_8002928C(CameraBox*);
/* 02A278 */ void Camera_8002A278(float x, float y);
/* 02A4AC */ void Camera_8002A4AC(HSD_GObj*);
/* 02E6FC */ void Camera_8002E6FC(u8);
/* 02E818 */ void Camera_8002E818(Vec3*);
/* 02E948 */ void Camera_8002E948(bool (*)(Vec3*));
/* 02EA64 */ void Camera_8002EA64(Vec3*);
/* 02EB5C */ void Camera_8002EB5C(float);
/* 02EC7C */ void Camera_8002EC7C(float);
/* 02ED9C */ void Camera_8002ED9C(float);
/* 02EEC8 */ void Camera_8002EEC8(float);
/* 02EF14 */ void Camera_8002EF14(void);
/* 02F0E4 */ void Camera_8002F0E4(s32);
/* 02F260 */ s32 Camera_8002F260(void);
/* 02F274 */ void Camera_8002F274(void);
/* 02F474 */ void Camera_8002F474(void);
/* 02F8F4 */ void Camera_8002F8F4(void);
/* 030740 */ void Camera_80030740(u8 r, u8 g, u8 b);
/* 030788 */ void Camera_80030788(Vec3*);
/* 030A50 */ void* Camera_80030A50(void);
/* 030A78 */ bool Camera_80030A78(void);
/* 030B24 */ bool Camera_80030B24(void);
/* 030CD8 */ bool Camera_80030CD8(CameraBox*, S32Vec2*);
/* 030CFC */ bool Camera_80030CFC(CameraBox*, float);
/* 030E44 */ void Camera_80030E44(enum_t, Vec3*);
/* 031060 */ enum_t Camera_80031060(void);
/* 031074 */ void Camera_80031074(u8);
/* 0310A0 */ void Camera_800310A0(u8);
/* 0310B8 */ HSD_CObj* Camera_800310B8(void);
/* 031144 */ float Camera_80031144(void);
/* 031154 */ bool Camera_80031154(Vec3*);
/* 03118C */ bool Camera_8003118C(Vec3*, float);
#define _CMSNAP_H_
#define GALE01_390730
#define _objalloc_h_
#define SYSDOLPHIN_BASELIB_DEBUG_H
typedef void (*ReportCallback)(s32, s32);
typedef void (*PanicCallback)(OSContext*, ...);
typedef int (*LogFunc)(s32, s32, s32*, s32);
 void __assert(char*, u32, char*);
void HSD_LogInit(void);
 void HSD_Panic(char*, u32, char*);
/// @todo Take @c file as another arg, ignore it if @c BUGFIX.
/// @todo Add another variant that takes a string for @c cond.
#define HSD_ASSERT(line, cond) ((cond) ? ((void) 0) : __assert(__FILE__, line, #cond))
int report_func(s32 arg0, s32 arg1, s32* arg2, s32 arg3);
void HSD_SetReportCallback(ReportCallback cb);
void HSD_SetPanicCallback(PanicCallback cb);
typedef struct _objheap {
    u32 top;
    u32 curr;
    u32 size;
    u32 remain;
} objheap;
typedef struct _HSD_ObjAllocLink {
    struct _HSD_ObjAllocLink* next;
} HSD_ObjAllocLink;
typedef struct _HSD_ObjAllocData {
    u32 num_limit_flag : 1;
    u32 heap_limit_flag : 1;
    HSD_ObjAllocLink* freehead;
    u32 used;
    u32 free;
    u32 peak;
    u32 num_limit;
    u32 heap_limit_size;
    u32 heap_limit_num;
    u32 size;
    u32 align;
    struct _HSD_ObjAllocData* next;
} HSD_ObjAllocData;
static inline u32 HSD_ObjAllocGetUsing(HSD_ObjAllocData* data)
{
    ((data) ? ((void) 0) : __assert("src/sysdolphin/baselib/objalloc.h", 205, "data"));
    return data->used;
}
static inline u32 HSD_ObjAllocGetFreed(HSD_ObjAllocData* data)
{
    ((data) ? ((void) 0) : __assert("src/sysdolphin/baselib/objalloc.h", 221, "data"));
    return data->free;
}
static inline u32 HSD_ObjAllocGetPeak(HSD_ObjAllocData* data)
{
    ((data) ? ((void) 0) : __assert("src/sysdolphin/baselib/objalloc.h", 237, "data"));
    return data->peak;
}
void HSD_ObjSetHeap(u32 size, void* ptr);
s32 HSD_ObjAllocAddFree(HSD_ObjAllocData* data, u32 num);
void* HSD_ObjAlloc(HSD_ObjAllocData* data);
void HSD_ObjFree(HSD_ObjAllocData* data, void* obj);
void _HSD_ObjAllocForgetMemory(void* low, void* high);
void HSD_ObjAllocInit(HSD_ObjAllocData* data, size_t size, u32 align);
struct _GObjUnkStruct;
#define HSD_GOBJ_GXLINK_NONE ((u8) 0xFF)
#define HSD_GOBJ_OBJ_NONE 0xFF
#define HSD_GOBJ_CLASS_STAGE 0x3
#define HSD_GOBJ_CLASS_FIGHTER 0x4
#define HSD_GOBJ_CLASS_ITEM 0x6
/// Used by chain-type items in-game to link multiple parts together
#define HSD_GOBJ_CLASS_ITEMLINK 0x7
#define HSD_GOBJ_CLASS_EFFECT 0x8
struct HSD_GObj {
    /*  +0 */ u16 classifier;
    /*  +2 */ u8 p_link;
    /*  +3 */ u8 gx_link;
    /*  +4 */ u8 p_priority;
    /*  +5 */ u8 render_priority;
    /*  +6 */ u8 obj_kind;
    /*  +7 */ u8 user_data_kind;
    /*  +8 */ HSD_GObj* next;
    /*  +C */ HSD_GObj* prev;
    /* +10 */ HSD_GObj* next_gx;
    /* +14 */ HSD_GObj* prev_gx;
    /* +18 */ HSD_GObjProc* proc;
    /* +1C */ GObj_RenderFunc render_cb;
    /* +20 */ u64 gxlink_prios;
    /* +28 */ void* hsd_obj;
    /* +2C */ void* user_data;
    /* +30 */ void (*user_data_remove_func)(void* data);
    /* +34 */ void* x34_unk;
};
typedef struct _HSD_GObjLibInitDataType {
    u8 p_link_max; // 804CE380
    u8 gx_link_max; // 804CE381
    u8 gproc_pri_max; // 804CE382
    u32 unk_1; // 804CE384
    u64* unk_2; // 804CE388
    HSD_ObjAllocData gobj_def; // 804CE38C
    HSD_ObjAllocData gobj_proc_def; // 804CE3B8
} HSD_GObjLibInitDataType;
/// @todo Belongs in `melee/` somewhere
typedef struct _HSD_GObjList {
    /*  +0 */ HSD_GObj* x0;
    /*  +4 */ HSD_GObj* x4;
    /*  +8 */ HSD_GObj* x8;
    /*  +C */ HSD_GObj* xC;
    /* +10 */ HSD_GObj* x10;
    /* +14 */ HSD_GObj* x14;
    /* +18 */ HSD_GObj* x18;
    /* +1C */ HSD_GObj* x1C;
    /* +20 */ HSD_GObj* fighters;
    /* +24 */ HSD_GObj* items;
    /* +28 */ HSD_GObj* x28;
    /* +2C */ HSD_GObj* x2C;
    /* +30 */ HSD_GObj* x30;
    /* +34 */ HSD_GObj* x34;
    /* +38 */ HSD_GObj* x38;
    /* +3C */ HSD_GObj* x3C;
    /* +40 */ HSD_GObj* x40;
    /* +44 */ HSD_GObj* x44;
    /* +48 */ HSD_GObj* x48;
} HSD_GObjList;
extern struct _unk_gobj_struct {
    union {
        u32 flags;
        struct {
            u32 b0 : 1;
            u32 b1 : 1;
            u32 b2 : 1;
            u32 b3 : 1;
        };
    };
    u32 type;
    u8 p_link;
    u8 p_prio;
    HSD_GObj* gobj;
} HSD_GObj_804CE3E4;
typedef struct _GObjUnkStruct GObjUnkStruct;
typedef struct _GObjFuncs GObjFuncs;
extern HSD_GObj* HSD_GObj_804D7818;
extern HSD_GObj* HSD_GObj_804D781C;
extern HSD_GObjProc* HSD_GObj_804D7830;
extern HSD_GObjProc* HSD_GObj_804D7838;
extern HSD_GObjProc** HSD_GObj_804D7840;
extern s32 HSD_GObj_804D7834;
extern s32 HSD_GObj_804D783C;
extern HSD_GObj* HSD_SisLib_804D797C;
extern HSD_GObj** HSD_GObj_804D7820;
extern HSD_GObj** HSD_GObj_804D7824;
extern HSD_GObjLibInitDataType HSD_GObjLibInitData;
extern HSD_GObj** plinklow_gobjs;
extern HSD_GObjList* HSD_GObj_Entities;
extern u8 HSD_GObj_804D784B[5];
extern GObjFuncs HSD_GObj_80408610;
extern s8 HSD_GObj_804D7848;
extern s8 HSD_GObj_804D7849;
extern s8 HSD_GObj_804D784A;
extern GObjFuncs HSD_GObj_80408620;
void HSD_GObj_80390C5C(HSD_GObj* gobj);
void HSD_GObj_80390C84(HSD_GObj* gobj);
void HSD_GObj_80390CAC(HSD_GObj* gobj);
u32 HSD_GObj_80390EB8(s32 i);
void HSD_GObj_803910D8(HSD_GObj*);
u8 HSD_GObj_803912A8(GObjUnkStruct*, GObjFuncs*);
HSD_GObj* GObj_Create(u16 classifier, u8 p_link, u8 priority);
void HSD_GObj_80391070(HSD_GObj* gobj, int arg1);
void HSD_GObj_80390CD4(HSD_GObj* gobj);
void HSD_GObj_80390CFC(void);
void render_gobj(HSD_GObj* cur, int i);
void HSD_GObj_80390FC0(void);
void HSD_GObj_80391044(HSD_GObj* gobj);
void HSD_GObj_803910B4(HSD_GObj* gobj);
void HSD_GObj_80391120(HSD_Obj* obj);
void HSD_GObj_803911C0(HSD_Obj* obj);
void HSD_GObj_80391260(struct _GObjUnkStruct* arg0);
void HSD_GObj_803912E0(GObjFuncs* arg0);
void HSD_GObj_80390ED0(HSD_GObj* gobj, u32 mask);
extern HSD_GObj* HSD_GObj_804D7814;
static inline void* HSD_GObjGetUserData(HSD_GObj* gobj)
{
    return gobj->user_data;
}
static inline void* HSD_GObjGetHSDObj(HSD_GObj* gobj)
{
    return gobj->hsd_obj;
}
static inline u16 HSD_GObjGetClassifier(HSD_GObj* gobj)
{
    return gobj->classifier;
}
static inline HSD_GObj* HSD_GObjGetNext(HSD_GObj* gobj)
{
    return gobj->next;
}
#define GET_COBJ(gobj) ((HSD_CObj*) HSD_GObjGetHSDObj(gobj))
#define GET_FOG(gobj) ((HSD_Fog*) HSD_GObjGetHSDObj(gobj))
#define GET_JOBJ(gobj) ((HSD_JObj*) HSD_GObjGetHSDObj(gobj))
#define GET_LOBJ(gobj) ((HSD_LObj*) HSD_GObjGetHSDObj(gobj))
void cmSnap_800315C8(void);
void cmSnap_800316B4(void);
void* cmSnap_80031618(void);
void cmSnap_80031640(HSD_GObj* gobj, int code);
#define MELEE_CM_TYPES_H
struct CameraBox {
    u32 data_filler[2];
    bool x8;
    /* +C:0 */ u8 xC_b0 : 1;
    u8 xD_fill[0x10 - 0xD];
    Vec3 x10; // might be Vec2?
    Vec3 x1C;
    float x28;
    Vec2 x2C;
    Vec3 x34;
    Vec2 x40;
    Vec3 x48;
};
struct CameraMovement {
    Vec3 interest;
    Vec3 target_interest;
    Vec3 position;
    Vec3 target_position;
    float fov;
    float target_fov;
};
struct CameraBounds {
    float x_min;
    float y_min;
    float x_max;
    float y_max;
    float subjects;
    float z_pos;
};
struct Camera {
    HSD_GObj* gobj;
    uint mode;
    unsigned char background_r;
    unsigned char background_g;
    unsigned char background_b;
    u8 unk_0xb;
    float nearz;
    float farz;
    CameraMovement movement;
    CameraMovement movement_lerp;
    Vec2 translation;
    u8 unk_cam[0x2B0 - 0x8C];
    u8 unk[0x2BC - 0x2B0];
    float unk_2bc;
    float unk_2c0;
    u8 unk2[0x39C - 0x2c0];
    uint last_mode;
};
#define GALE01_225374
#define MELEE_FT_FORWARD_H
#define FIGHTERVARS_SIZE 0xF8
typedef enum_t FtMotionId;
typedef struct Fighter Fighter;
typedef struct Fighter_804D653C_t Fighter_804D653C_t;
typedef struct Fighter_CostumeStrings Fighter_CostumeStrings;
typedef struct Fighter_DemoStrings Fighter_DemoStrings;
typedef struct FighterBone FighterBone;
typedef struct ftCmdScript ftCmdScript;
typedef struct FtCmdState FtCmdState;
typedef struct ftCo_DatAttrs_xBC_t ftCo_DatAttrs_xBC_t;
typedef struct ftCommonData ftCommonData;
typedef struct ftData ftData;
typedef struct ftData_UnkCountStruct ftData_UnkCountStruct;
typedef struct ftDeviceUnk1 ftDeviceUnk1;
typedef struct ftDeviceUnk2 ftDeviceUnk2;
typedef struct ftLk_SpecialN_Vec3Group ftLk_SpecialN_Vec3Group;
typedef struct ftMaterial_UnkTevStruct ftMaterial_UnkTevStruct;
typedef struct FtSFX FtSFX;
typedef struct ftSubactionList ftSubactionList;
typedef struct gmScriptEventDefault gmScriptEventDefault;
typedef struct MotionState MotionState;
typedef struct UnkFloat6_Camera UnkFloat6_Camera;
typedef u32 MotionFlags;
typedef struct Fighter_GObj Fighter_GObj;
struct Fighter_GObj {
    /*  +0 */ u16 classifier;
    /*  +2 */ u8 p_link;
    /*  +3 */ u8 gx_link;
    /*  +4 */ u8 p_priority;
    /*  +5 */ u8 render_priority;
    /*  +6 */ u8 obj_kind;
    /*  +7 */ u8 user_data_kind;
    /*  +8 */ Fighter_GObj* next;
    /*  +C */ Fighter_GObj* prev;
    /* +10 */ Fighter_GObj* next_gx;
    /* +14 */ Fighter_GObj* prev_gx;
    /* +18 */ HSD_GObjProc* proc;
    /* +1C */ void (*rendered)(Fighter_GObj* gobj, s32 code);
    /* +20 */ u64 gxlink_prios;
    /* +28 */ HSD_JObj* hsd_obj;
    /* +2C */ Fighter* user_data;
    /* +30 */ void (*user_data_remove_func)(Fighter* data);
    /* +34 */ void* x34_unk;
};
typedef char* (*Fighter_MotionFileStringGetter)(enum_t arg0);
typedef void (*Fighter_ItemEvent)(HSD_GObj* gobj, bool arg1);
typedef void (*Fighter_ModelEvent)(Fighter* fp, int arg1, bool arg2);
typedef void (*Fighter_UnkMtxEvent)(HSD_GObj* gobj, int arg1, Mtx vmtx);
typedef void (*Fighter_UnkPtrEvent)(int arg0, int* arg1, int* arg2);
typedef void (*FighterEvent)(Fighter* fp);
typedef void (*FtCmd)(Fighter_GObj* gobj, FtCmdState* cmd);
typedef bool (*ftDevice_Callback0)(M2C_UNK, HSD_GObj*, Vec3*);
typedef enum FighterKind {
    FTKIND_MARIO,
    FTKIND_FOX,
    FTKIND_CAPTAIN,
    FTKIND_DONKEY,
    FTKIND_KIRBY,
    FTKIND_KOOPA,
    FTKIND_LINK,
    FTKIND_SEAK,
    FTKIND_NESS,
    FTKIND_PEACH,
    FTKIND_POPO,
    FTKIND_NANA,
    FTKIND_PIKACHU,
    FTKIND_SAMUS,
    FTKIND_YOSHI,
    FTKIND_PURIN,
    FTKIND_MEWTWO,
    FTKIND_LUIGI,
    FTKIND_MARS,
    FTKIND_ZELDA,
    FTKIND_CLINK,
    FTKIND_DRMARIO,
    FTKIND_FALCO,
    FTKIND_PICHU,
    FTKIND_GAMEWATCH,
    FTKIND_GANON,
    FTKIND_EMBLEM,
    FTKIND_MASTERH,
    FTKIND_CREZYH,
    FTKIND_BOY,
    FTKIND_GIRL,
    FTKIND_GKOOPS,
    FTKIND_SANDBAG,
    FTKIND_NONE,
    FTKIND_MAX = FTKIND_NONE
} FighterKind;
typedef enum CharacterKind {
    CKIND_CAPTAIN, // Captain Falcon (Captain)
    CKIND_DONKEY, // Donkey Kong (Donkey)
    CKIND_FOX, // Fox
    CKIND_GAMEWATCH, // Mr. Game & Watch (GameWatch)
    CKIND_KIRBY, // Kirby
    CKIND_KOOPA, // Bowser (Koopa)
    CKIND_LINK, // Link
    CKIND_LUIGI, // Luigi
    CKIND_MARIO, // Mario
    CKIND_MARS, // Marth (Mars)
    CKIND_MEWTWO, // Mewtwo
    CKIND_NESS, // Ness
    CKIND_PEACH, // Peach
    CKIND_PIKACHU, // Pikachu
    CKIND_POPONANA, // Ice Climbers (Popo & Nana)
    CKIND_PURIN, // Jigglypuff (Purin)
    CKIND_SAMUS, // Samus
    CKIND_YOSHI, // Yoshi
    CKIND_ZELDA, // Zelda (ZE->SE)
    CKIND_SEAK, // Sheik (SE->ZE)
    CKIND_FALCO, // Falco
    CKIND_CLINK, // Young Link (CLink)
    CKIND_DRMARIO, // Dr. Mario
    CKIND_EMBLEM, // Roy (Emblem)
    CKIND_PICHU, // Pichu
    CKIND_GANON, // Ganondorf (Ganon)
    CKIND_MASTERH, // Master Hand (MasterH)
    CKIND_BOY, // Male Wireframe (Boy)
    CKIND_GIRL, // Female Wireframe (Girl)
    CKIND_GKOOPS, // Giga Bowser (GKoops)
    CKIND_CREZYH, // Crazy Hand (CrezyH)
    CHKIND_SANDBAG, // Sandbag
    CHKIND_POPO, // Popo
    CHKIND_NONE, // None
    CHKIND_MAX = CHKIND_NONE
} CharacterKind;
static MotionFlags const Ft_MF_None = 0;
static MotionFlags const Ft_MF_KeepFastFall = 1 << 0;
static MotionFlags const Ft_MF_KeepGfx = 1 << 1;
/// Preserve full body collision state
static MotionFlags const Ft_MF_KeepColAnimHitStatus = 1 << 2;
/// Keep hitboxes
static MotionFlags const Ft_MF_SkipHit = 1 << 3;
/// Ignore model state change ?
static MotionFlags const Ft_MF_SkipModel = 1 << 4;
static MotionFlags const Ft_MF_SkipAnimVel = 1 << 5;
static MotionFlags const Ft_MF_Unk06 = 1 << 6;
/// Ignore switching to character's "hurt" textures ?
static MotionFlags const Ft_MF_SkipMatAnim = 1 << 7;
/// Resets thrower GObj pointer to NULL if false?
static MotionFlags const Ft_MF_SkipThrowException = 1 << 8;
static MotionFlags const Ft_MF_KeepSfx = 1 << 9;
/// Ignore Parasol state change
static MotionFlags const Ft_MF_SkipParasol = 1 << 10;
/// Ignore rumble update?
static MotionFlags const Ft_MF_SkipRumble = 1 << 11;
static MotionFlags const Ft_MF_SkipColAnim = 1 << 12;
/// Keep respawn platform?
static MotionFlags const Ft_MF_KeepAccessory = 1 << 13;
/// Run all Subaction Events up to the current animation frame
static MotionFlags const Ft_MF_UpdateCmd = 1 << 14;
static MotionFlags const Ft_MF_SkipNametagVis = 1 << 15;
/// Assume this is for individual bones?
static MotionFlags const Ft_MF_KeepColAnimPartHitStatus = 1 << 16;
static MotionFlags const Ft_MF_KeepSwordTrail = 1 << 17;
/// Used by Ness during Up/Down Smash
static MotionFlags const Ft_MF_SkipItemVis = 1 << 18;
/// Skips updating bit 5 of #Fighter::x2222_flag?
static MotionFlags const Ft_MF_Unk19 = 1 << 19;
static MotionFlags const Ft_MF_UnkUpdatePhys = 1 << 20;
/// Sets anim rate to 0 and some other stuff
static MotionFlags const Ft_MF_FreezeState = 1 << 21;
static MotionFlags const Ft_MF_SkipModelPartVis = 1 << 22;
static MotionFlags const Ft_MF_SkipMetalB = 1 << 23;
static MotionFlags const Ft_MF_Unk24 = 1 << 24;
static MotionFlags const Ft_MF_SkipAttackCount = 1 << 25;
static MotionFlags const Ft_MF_SkipModelFlags = 1 << 26;
static MotionFlags const Ft_MF_Unk27 = 1 << 27;
static MotionFlags const Ft_MF_SkipHitStun = 1 << 28;
/// Keeps current fighter animation?
static MotionFlags const Ft_MF_SkipAnim = 1 << 29;
static MotionFlags const Ft_MF_Unk30 = 1 << 30;
/// Unused?
static MotionFlags const Ft_MF_Unk31 = 1 << 31;
// Ledge Grab Macros
#define CLIFFCATCH_BOTH 0
#define CLIFFCATCH_LEFT -1
#define CLIFFCATCH_RIGHT 1
typedef enum Fighter_Part {
    FtPart_TopN,
    FtPart_TransN,
    FtPart_XRotN,
    FtPart_YRotN,
    FtPart_HipN,
    FtPart_WaistN,
    FtPart_LLegJA,
    FtPart_LLegJ,
    FtPart_LKneeJ,
    FtPart_LFootJA,
    FtPart_LFootJ,
    FtPart_RLegJA,
    FtPart_RLegJ,
    FtPart_RKneeJ,
    FtPart_RFootJA,
    FtPart_RFootJ,
    FtPart_BustN,
    FtPart_LShoulderN,
    FtPart_LShoulderJA,
    FtPart_LShoulderJ,
    FtPart_LArmJ,
    FtPart_LHandN,
    FtPart_L1stNa,
    FtPart_L1stNb,
    FtPart_L2ndNa,
    FtPart_L2ndNb,
    FtPart_L3rdNa,
    FtPart_L3rdNb,
    FtPart_L4thNa,
    FtPart_L4thNb,
    FtPart_LThumbNa,
    FtPart_LThumbNb,
    FtPart_LHandNb,
    FtPart_NeckN,
    FtPart_HeadN,
    FtPart_RShoulderN,
    FtPart_RShoulderJA,
    FtPart_RShoulderJ,
    FtPart_RArmJ,
    FtPart_RHandN,
    FtPart_R1stNa,
    FtPart_R1stNb,
    FtPart_R2ndNa,
    FtPart_R2ndNb,
    FtPart_R3rdNa,
    FtPart_R3rdNb,
    FtPart_R4thNa,
    FtPart_R4thNb,
    FtPart_RThumbNa,
    FtPart_RThumbNb,
    FtPart_RHandNb,
    FtPart_ThrowN,
    FtPart_TransN2,
    FtPart_109 = 109,
} Fighter_Part;
typedef enum FtWalkType {
    FtWalkType_Slow,
    FtWalkType_Middle,
    FtWalkType_Fast,
} FtWalkType;
typedef enum FtMoveId {
    FtMoveId_None,
    FtMoveId_Default,
    FtMoveId_Attack11,
    FtMoveId_Attack12,
    FtMoveId_Attack13,
    FtMoveId_Attack100,
    FtMoveId_AttackDash,
    FtMoveId_AttackS3,
    FtMoveId_AttackHi3,
    FtMoveId_AttackLw3,
    FtMoveId_AttackS4,
    FtMoveId_AttackHi4,
    FtMoveId_AttackLw4,
    FtMoveId_AttackAirN,
    FtMoveId_AttackAirF,
    FtMoveId_AttackAirB,
    FtMoveId_AttackAirHi,
    FtMoveId_AttackAirLw,
    FtMoveId_SpecialN,
    FtMoveId_SpecialS,
    FtMoveId_SpecialHi,
    FtMoveId_SpecialLw,
    FtMoveId_KbSpecialNMr,
    FtMoveId_KbSpecialNFx,
    FtMoveId_KbSpecialNCa,
    FtMoveId_KbSpecialNDk,
    FtMoveId_KbSpecialNKp,
    FtMoveId_KbSpecialNLk,
    FtMoveId_KbSpecialNSk,
    FtMoveId_KbSpecialNNs,
    FtMoveId_KbSpecialNPe,
    FtMoveId_KbSpecialNPp,
    FtMoveId_KbSpecialNPk,
    FtMoveId_KbSpecialNSs,
    FtMoveId_KbSpecialNYs,
    FtMoveId_KbSpecialNPr,
    FtMoveId_KbSpecialNMt,
    FtMoveId_KbSpecialNLg,
    FtMoveId_KbSpecialNMs,
    FtMoveId_KbSpecialNZd,
    FtMoveId_KbSpecialNCl,
    FtMoveId_KbSpecialNDr,
    FtMoveId_KbSpecialNFc,
    FtMoveId_KbSpecialNPc,
    FtMoveId_KbSpecialNGw,
    FtMoveId_KbSpecialNGn,
    FtMoveId_KbSpecialNFe,
    FtMoveId_KbSpecialNGk,
    FtMoveId_Unk48,
    FtMoveId_Unk49,
    FtMoveId_DownAttackU,
    FtMoveId_DownAttackD,
    FtMoveId_CatchAttack,
    FtMoveId_ThrowF,
    FtMoveId_ThrowB,
    FtMoveId_ThrowHi,
    FtMoveId_ThrowLw,
    FtMoveId_CargoThrowF,
    FtMoveId_CargoThrowB,
    FtMoveId_CargoThrowHi,
    FtMoveId_CargoThrowLw,
    FtMoveId_CliffAttackSlow,
    FtMoveId_CliffAttackQuick,
    FtMoveId_SwordSwing1,
    FtMoveId_SwordSwing3,
    FtMoveId_SwordSwing4,
    FtMoveId_SwordSwingDash,
    FtMoveId_BatSwing1,
    FtMoveId_BatSwing3,
    FtMoveId_BatSwing4,
    FtMoveId_BatSwingDash,
    FtMoveId_ParasolSwing1,
    FtMoveId_ParasolSwing3,
    FtMoveId_ParasolSwing4,
    FtMoveId_ParasolSwingDash,
    FtMoveId_HarisenSwing1,
    FtMoveId_HarisenSwing3,
    FtMoveId_HarisenSwing4,
    FtMoveId_HarisenSwingDash,
    FtMoveId_StarRodSwing1,
    FtMoveId_StarRodSwing3,
    FtMoveId_StarRodSwing4,
    FtMoveId_StarRodSwingDash,
    FtMoveId_LipstickSwing1,
    FtMoveId_LipstickSwing3,
    FtMoveId_LipstickSwing4,
    FtMoveId_LipstickSwingDash,
    FtMoveId_Parasol,
    FtMoveId_LGunShoot,
    FtMoveId_FireFlowerShoot,
    FtMoveId_Screw,
    FtMoveId_ScopeRapid,
    FtMoveId_ScopeFire,
    FtMoveId_Hammer,
    FtMoveId_WarpStarFall,
} FtMoveId;
typedef enum SmashState {
    SmashState_None,
    SmashState_PreCharge,
    SmashState_Charging,
    SmashState_Release,
} SmashState;
typedef enum ftCommon_BuryType {
    BuryType_Unk0,
    BuryType_Unk1,
    BuryType_Unk2,
    BuryType_Unk3,
} ftCommon_BuryType;
#define MELEE_IT_FORWARD_H
typedef struct Article Article;
typedef struct BobOmbRain BobOmbRain;
typedef struct CameraBoxFlags CameraBoxFlags;
typedef struct DynamicBoneTable DynamicBoneTable;
typedef struct ECB ECB;
typedef struct flag32 flag32;
typedef struct HSD_ObjAllocUnk HSD_ObjAllocUnk;
typedef struct HSD_ObjAllocUnk2 HSD_ObjAllocUnk2;
typedef struct HSD_ObjAllocUnk4 HSD_ObjAllocUnk4;
typedef struct HSD_ObjAllocUnk5 HSD_ObjAllocUnk5;
typedef struct HSD_ObjAllocUnk6 HSD_ObjAllocUnk6;
typedef struct Item Item;
typedef struct Item_DynamicBones Item_DynamicBones;
typedef struct ItemAttr ItemAttr;
typedef struct ItemCommonData ItemCommonData;
typedef struct ItemDynamics ItemDynamics;
typedef struct ItemDynamicsDesc ItemDynamicsDesc;
typedef struct ItemModelDesc ItemModelDesc;
typedef struct ItemModStruct ItemModStruct;
typedef struct ItemStateArray ItemStateArray;
typedef struct ItemStateDesc ItemStateDesc;
typedef struct itSword_ItemVars itSword_ItemVars;
typedef struct SpawnItem SpawnItem;
typedef struct UnkItemArticles3 UnkItemArticles3;
typedef struct Item_GObj Item_GObj;
struct Item_GObj {
    /*  +0 */ u16 classifier;
    /*  +2 */ u8 p_link;
    /*  +3 */ u8 gx_link;
    /*  +4 */ u8 p_priority;
    /*  +5 */ u8 render_priority;
    /*  +6 */ u8 obj_kind;
    /*  +7 */ u8 user_data_kind;
    /*  +8 */ Item_GObj* next;
    /*  +C */ Item_GObj* prev;
    /* +10 */ Item_GObj* next_gx;
    /* +14 */ Item_GObj* prev_gx;
    /* +18 */ HSD_GObjProc* proc;
    /* +1C */ void (*rendered)(Item_GObj* gobj, s32 code);
    /* +20 */ u64 gxlink_prios;
    /* +28 */ HSD_JObj* hsd_obj;
    /* +2C */ Item* user_data;
    /* +30 */ void (*user_data_remove_func)(Item* data);
    /* +34 */ void* x34_unk;
};
typedef enum Item_StateChangeFlags {
    ITEM_UNK_0x1 = (1 << 0),
    ITEM_ANIM_UPDATE = (1 << 1),
    ITEM_DROP_UPDATE = (1 << 2),
    ITEM_MODEL_UPDATE = (1 << 3),
    ITEM_HIT_PRESERVE = (1 << 4),
    ITEM_SFX_PRESERVE = (1 << 5),
    ITEM_COLANIM_PRESERVE = (1 << 6),
    ITEM_UNK_UPDATE = (1 << 7),
    ITEM_CMD_UPDATE = (1 << 8),
} Item_StateChangeFlags;
typedef enum Item_UnkKinds {
    ITEM_UNK_MATO = 4,
    ITEM_UNK_LOCKON,
    ITEM_UNK_ENEMY,
    ITEM_UNK_7
} Item_UnkKinds;
// Based on "ID Lists" from the SSBM datasheet, in-game references, and further
// research by VetriTheRetri
// https://docs.google.com/spreadsheets/d/1JX2w-r2fuvWuNgGb6D3Cs4wHQKLFegZe2jhbBuIhCG8
// Development JP name strings are listed starting at data address 0x803EA7A8
typedef enum ItemKind {
    // COMMON ITEMS
    It_Kind_Capsule, // Capsule
    It_Kind_Box, // Crate
    It_Kind_Taru, // Barrel
    It_Kind_Egg, // Egg
    It_Kind_Kusudama, // Party Ball (Kusudama)
    It_Kind_TaruCann, // Barrel Cannon (TaruCann)
    It_Kind_BombHei, // Bob-omb (BombHei)
    It_Kind_Dosei, // Mr. Saturn (Dosei)
    It_Kind_Heart, // Heart Container
    It_Kind_Tomato, // Maxim Tomato
    It_Kind_Star, // Starman (Super Star)
    It_Kind_Bat, // Home-Run Bat
    It_Kind_Sword, // Beam Sword
    It_Kind_Parasol, // Parasol
    It_Kind_G_Shell, // Green Shell (G Shell)
    It_Kind_R_Shell, // Red Shell (R Shell)
    It_Kind_L_Gun, // Ray Gun (L Gun)
    It_Kind_Freeze, // Freezie (Freeze)
    It_Kind_Foods, // Food
    It_Kind_MSBomb, // Proximity Mine (MSBomb)
    It_Kind_Flipper, // Flipper
    It_Kind_S_Scope, // Super Scope (S Scope)
    It_Kind_StarRod, // Star Rod
    It_Kind_LipStick, // Lip's Stick
    It_Kind_Harisen, // Fan (Harisen)
    It_Kind_F_Flower, // Fire Flower (F Flower)
    It_Kind_Kinoko, // Super Mushroom (Kinoko)
    It_Kind_DKinoko, // Poison Mushroom (DKinoko)
    It_Kind_Hammer, // Hammer
    It_Kind_WStar, // Warp Star (WStar)
    It_Kind_ScBall, // Screw Attack (ScBall)
    It_Kind_RabbitC, // Bunny Hood (RabbitC)
    It_Kind_MetalB, // Metal Box
    It_Kind_Spycloak, // Cloaking Device (Spycloak)
    It_Kind_M_Ball, // Pok Ball (M Ball)
    // ITEM-RELATED
    It_Kind_L_Gun_Ray, // Ray Gun recoil effect (?)
    It_Kind_StarRod_Star, // Star Rod Star
    It_Kind_LipStick_Spore, // Lips Stick Dust
    It_Kind_S_Scope_Beam, // Super Scope Beam
    It_Kind_L_Gun_Beam, // Ray Gun Beam
    It_Kind_Hammer_Head, // Hammer Head
    It_Kind_F_Flower_Flame, // Flower
    It_Kind_EvYoshiEgg, // Yoshi's Egg (Event)
    // MONSTERS
    It_Kind_Kuriboh, // Goomba (Kuriboh)
    It_Kind_Leadead, // Redead (Leadead)
    It_Kind_Octarock, // Octarok (Octarock)
    It_Kind_Ottosea, // Ottosea
    It_Kind_Octarock_Stone, // Stone (Octarok Projectile)
    // CHARACTER-RELATED
    It_Kind_Mario_Fire, // Mario's fireball
    It_Kind_DrMario_Vitamin, // Dr. Mario's pill
    It_Kind_Kirby_CBeam, // Kirby's Cutter beam
    It_Kind_Kirby_Hammer, // Kirby's Hammer
    It_Kind_Unk1, // Maybe Kirby copy star?
    It_Kind_Unk2,
    It_Kind_Fox_Laser, // Fox's Laser
    It_Kind_Falco_Laser, // Falco's Laser
    It_Kind_Fox_Illusion, // Fox's Illusion
    It_Kind_Falco_Phantasm, // Falco's Phantasm
    It_Kind_Link_Bomb, // Link's bomb
    It_Kind_CLink_Bomb, // Young Link's bomb
    It_Kind_Link_Boomerang, // Link's boomerang
    It_Kind_CLink_Boomerang, // Young Link's boomerang
    It_Kind_Link_HShot, // Link's Hookshot
    It_Kind_CLink_HShot, // Young Link's Hookshot
    It_Kind_Link_Arrow, // Link's Arrow
    It_Kind_CLink_Arrow, // Young Link's Fire Arrow
    It_Kind_Ness_PKFire, // PK Fire
    It_Kind_Ness_PKFire_Flame, // PK Fire Pillar
    It_Kind_Ness_PKFlush, // PK Flash (charging state)
    It_Kind_Ness_PKThunder, // PK Thunder (Ball)
    It_Kind_Ness_PKThunder1, // PK Thunder (Trail 1)
    It_Kind_Ness_PKThunder2, // PK Thunder (Trail 2)
    It_Kind_Ness_PKThunder3, // PK Thunder (Trail 3)
    It_Kind_Ness_PKThunder4, // PK Thunder (Trail 4)
    It_Kind_Fox_Blaster, // Fox's Blaster
    It_Kind_Falco_Blaster, // Falco's Blaster
    It_Kind_Link_Bow, // Link's Bow
    It_Kind_CLink_Bow, // Young Link's Bow
    It_Kind_Ness_PKFlush_Explode, // PK Flash (explosion)
    It_Kind_Seak_NeedleThrow, // Needle (thrown)
    It_Kind_Seak_NeedleHeld, // Needle (held)
    It_Kind_Pikachu_Thunder, // Pikachu's Thunder
    It_Kind_Pichu_Thunder, // Pichu's Thunder
    It_Kind_Mario_Cape, // Mario's cape
    It_Kind_DrMario_Sheet, // Dr. Mario's cape
    It_Kind_Seak_Vanish, // Smoke (Sheik)
    It_Kind_Yoshi_EggThrow, // Yoshi's Egg (thrown)
    It_Kind_Yoshi_EggLay, // Yoshi's Egg Lay???
    It_Kind_Yoshi_Star, // Yoshi's Star
    It_Kind_Pikachu_TJolt_Ground, // Pikachu's thunder (B)
    It_Kind_Pikachu_TJolt_Air, // Pikachu's thunder (B)
    It_Kind_Pichu_TJolt_Ground, // Pichu's thunder (B)
    It_Kind_Pichu_TJolt_Air, // Pichu's thunder (B)
    It_Kind_Samus_Bomb, // Samus's bomb
    It_Kind_Samus_Charge, // Samus's chargeshot
    It_Kind_Samus_Missile, // Missile
    It_Kind_Samus_GBeam, // Grapple beam
    It_Kind_Seak_Chain, // Sheik's chain
    It_Kind_Peach_Explode, // Peach Bomber explosion?
    It_Kind_Peach_Turnip, // Peach's turnip
    It_Kind_Koopa_Flame, // Bowser's flame
    It_Kind_Ness_Bat, // Ness's baseball bat
    It_Kind_Ness_Yoyo, // Ness's Yo-Yo
    It_Kind_Peach_Parasol, // Peach's parasol
    It_Kind_Peach_Toad, // Peach's Toad special
    It_Kind_Luigi_Fire, // Luigi's fireball
    It_Kind_IceClimber_Ice, // Ice (Ice Climbers)
    It_Kind_IceClimber_Blizzard, // Blizzard
    It_Kind_Zelda_DinFire, // Din's Fire (charging state)
    It_Kind_Zelda_DinFire_Explode, // Din's Fire (explosion)
    It_Kind_Mewtwo_Disable, // Mewtwo's Disable Projectile
    It_Kind_Peach_ToadSpore, // Peach Toad's spore effect
    It_Kind_Mewtwo_ShadowBall, // Mewtwo's Shadowball
    It_Kind_IceClimber_GumStrings, // Ice Climbers Belay (Up B)
    It_Kind_GameWatch_Greenhouse, // Mr. Game & Watch's Insecticide Spray
    It_Kind_GameWatch_Manhole, // Mr. Game & Watch's Manhole
    It_Kind_GameWatch_Fire, // Mr. Game & Watch's Fire (?)
    It_Kind_GameWatch_Parachute, // Mr. Game & Watch's Parachute
    It_Kind_GameWatch_Turtle, // Mr. Game & Watch's Turtle
    It_Kind_GameWatch_Breath, // Mr. Game & Watch's Sparky
    It_Kind_GameWatch_Judge, // Mr. Game & Watch's Judge
    It_Kind_GameWatch_Panic, // Mr. Game & Watch's Oil Panic (?)
    It_Kind_GameWatch_Chef, // Sausage
    It_Kind_CLink_Milk, // Milk (Young Link)
    It_Kind_GameWatch_Rescue, // Mr. Game & Watch's Firefighter
    It_Kind_MasterHand_Laser, // Master Hand's Laser
    It_Kind_MasterHand_Bullet, // Master Hand's Bullet
    It_Kind_CrazyHand_Laser, // Crazy Hand's Laser
    It_Kind_CrazyHand_Bullet, // Crazy Hand's Bullet
    It_Kind_CrazyHand_Bomb, // Crazy Hand's Bomb
    It_Kind_Kirby_MarioFire, // Kirby copy Mario's Fire (B)
    It_Kind_Kirby_DrMarioVitamin, // Kirby copy Dr. Mario's Capsule (B)
    It_Kind_Kirby_LuigiFire, // Kirby copy Luigi's Fire (B)
    It_Kind_Kirby_IceClimberIce, // Kirby copy Ice Climbers' Ice Shot (B)
    It_Kind_Kirby_PeachToad, // Kirby copy Peach's Toad (B)
    It_Kind_Kirby_PeachToadSpore, // Kirby copy Toad's Spore (B)
    It_Kind_Kirby_FoxLaser, // Kirby copy Fox's Laser (B)
    It_Kind_Kirby_FalcoLaser, // Kirby copy Falco's Laser (B)
    It_Kind_Kirby_FoxBlaster, // Kirby copy Fox's Blaster (B)
    It_Kind_Kirby_FalcoBlaster, // Kirby copy Falco's Blaster (B)
    It_Kind_Kirby_LinkArrow, // Kirby copy Link's Arrow (B)
    It_Kind_Kirby_CLinkArrow, // Kirby copy Young Link's Arrow (B)
    It_Kind_Kirby_LinkBow, // Kirby copy Link's Arrow (B)
    It_Kind_Kirby_CLinkBow, // Kirby copy Young Link's Arrow (B)
    It_Kind_Kirby_MewtwoShadowBall, // Kirby copy Mewtwo's Shadowball (B)
    It_Kind_Kirby_NessPKFlush, // Kirby copy PK Flash (B)
    It_Kind_Kirby_NessPKFlush_Explode, // Kirby copy PK Flash Explosion (B)
    It_Kind_Kirby_PikachuTJolt_Ground, // Kirby copy Pikachu's Thunder (B)
    It_Kind_Kirby_PikachuTJolt_Air, // Kirby copy Pikachu's Thunder (B)
    It_Kind_Kirby_PichuTJolt_Ground, // Kirby copy Pichu's Thunder (B)
    It_Kind_Kirby_PichuTJolt_Air, // Kirby copy Pichu's Thunder (B)
    It_Kind_Kirby_SamusCharge, // Kirby copy Samus' Chargeshot (B)
    It_Kind_Kirby_SeakNeedleThrow, // Kirby copy Sheik's Needle (thrown) (B)
    It_Kind_Kirby_SeakNeedleHeld, // Kirby copy Sheik's Needle (ground) (B)
    It_Kind_Kirby_KoopaFlame, // Kirby copy Bowser's Flame (B)
    It_Kind_Kirby_GameWatchChef, // Kirby copy Mr. Game & Watch's Sausage (B)
    It_Kind_Kirby_GameWatchChefPan, // Kirby copy Mr. Game & Watch's Chef Pan
                                    // (B)
    It_Kind_Kirby_YoshiEggLay, // Kirby's Yoshi Egg Lay??? (B)
    It_Kind_Unk4, // (unique)
    It_Kind_Coin, // Coin (?)
    // POKMON
    Pokemon_Random, // Used for Random Pokmon value
    Pokemon_Tosakinto, // Goldeen (Tosakinto)
    Pokemon_Chicorita, // Chikorita (Chicorita)
    Pokemon_Kabigon, // Snorlax (Kabigon)
    Pokemon_Kamex, // Blastoise (Kamex)
    Pokemon_Matadogas, // Weezing (Matadogas)
    Pokemon_Lizardon, // Charizard (Lizardon)
    Pokemon_Fire, // Moltres (Fire)
    Pokemon_Thunder, // Zapdos (Thunder)
    Pokemon_Freezer, // Articuno (Freezer)
    Pokemon_Sonans, // Wobbuffet (Sonans)
    Pokemon_Hassam, // Scizor (Hassam)
    Pokemon_Unknown, // Unown (Unknown)
    Pokemon_Entei, // Entei
    Pokemon_Raikou, // Raikou
    Pokemon_Suikun, // Suicune (Suikun)
    Pokemon_Kireihana, // Bellossom (Kireihana)
    Pokemon_Marumine, // Electrode (Marumine)
    Pokemon_Lugia, // Lugia
    Pokemon_Houou, // Ho-oh (Houou)
    Pokemon_Metamon, // Ditto (Metamon)
    Pokemon_Pippi, // Clefairy (Pippi)
    Pokemon_Togepy, // Togepi (Togepy)
    Pokemon_Mew, // Mew
    Pokemon_Cerebi, // Celebi (Cerebi)
    Pokemon_Hitodeman, // Staryu (Hitodeman)
    Pokemon_Lucky, // Chansey (Lucky)
    Pokemon_Porygon2, // Porygon2
    Pokemon_Hinoarashi, // Cyndaquil (Hinoarashi)
    Pokemon_Maril, // Marill (Maril)
    Pokemon_Fushigibana, // Venusaur (Fushigibana)
    // POKMON-RELATED
    Pokemon_Chicorita_Leaf, // Chikorita's Leaf
    Pokemon_Kamex_HydroPump, // Blastoise's Water
    Pokemon_Matadogas_Gas1, // Weezing's Gas
    Pokemon_Matadogas_Gas2, // Weezing's Gas
    Pokemon_Lizardon_Flame1, // Charizard's Breath
    Pokemon_Lizardon_Flame2, // Charizard's Breath
    Pokemon_Lizardon_Flame3, // Charizard's Breath
    Pokemon_Lizardon_Flame4, // Charizard's Breath
    Pokemon_Unknown_Swarm, // Mini-Unowns
    Pokemon_Lugia_Aeroblast, // Lugia's Aeroblast
    Pokemon_Lugia_Aeroblast2, // Lugia's Aeroblast
    Pokemon_Lugia_Aeroblast3, // Lugia's Aeroblast
    Pokemon_Houou_SacredFire, // Ho-Oh's Flame
    Pokemon_Hitodeman_Star, // Staryu's Star
    Pokemon_Lucky_Egg, // Chansey's Healing Egg
    Pokemon_Hinoarashi_Flame, // Cyndaquil's Fire
    Pokemon_Unk, // ???
    // MONSTERS 2
    It_Kind_Old_Kuri, // Old Goomba (old-Kuri)
    It_Kind_Mato, // Target (Mato)
    It_Kind_Heiho, // Yoshi's Story Shy Guy (Heiho)
    It_Kind_Nokonoko, // Koopa Troopa (Green) (Nokonoko)
    It_Kind_Patapata, // Koopa Troopa (Red) (Patapata)
    It_Kind_Likelike, // Like-Like (likelike)
    It_Kind_Old_Lead, // Old Redead (old-lead) [invalid]
    It_Kind_Old_Octa, // Old Octorok (old-octa) [invalid]
    It_Kind_Old_Otto, // Old Ottosea (old-otto)
    It_Kind_Whitebea, // Polar Bear (whitebea)
    It_Kind_Klap, // Klaptrap (klap)
    It_Kind_ZGShell, // Green Shell (zgshell)
    It_Kind_ZRShell, // Red Shell (green act) (zrshell)
    // STAGE-SPECIFIC
    It_Kind_Tincle, // Tingle (Tincle) (on balloon)
    It_Kind_Invalid1, // [Invalid]
    It_Kind_Invalid2, // [Invalid]
    It_Kind_Invalid3, // [Invalid]
    It_Kind_WhispyApple, // Whispy Apple
    It_Kind_WhispyHealApple, // Whispy's Healing Apple
    It_Kind_Invalid4, // [Invalid]
    It_Kind_Invalid5, // [Invalid]
    It_Kind_Invalid6, // [Invalid]
    It_Kind_Tools, // Tool (Flatzone)
    It_Kind_Invalid7, // [Invalid]
    It_Kind_Invalid8, // [Invalid]
    It_Kind_Kyasarin, // Birdo (Kyasarin)
    It_Kind_Arwing_Laser, // Arwing Laser
    It_Kind_GreatFox_Laser, // Great Fox's Laser
    It_Kind_Kyasarin_Egg, // Birdo's Egg
} ItemKind;
/* 225374 */ void db_80225374(void);
/* 225D2C */ void db_80225D2C(void);
/* 225D40 */ void db_80225D40(void);
/* 225D64 */ void db_80225D64(Item_GObj* item, Fighter_GObj* owner);
/* 225DD8 */ void db_80225DD8(Item_GObj* item, Fighter_GObj* owner);
/* 22886C */ void db_8022886C(void);
/* 225D54 */ M2C_UNK db_80225D54(HSD_ObjAllocUnk4*);
/* 4A0E30 */ extern HSD_ObjAllocUnk4 it_804A0E30;
/* 228A64 */ void db_80228A64(void);
/* 228C4C */ void db_80228C4C(void);
/* 4D4A08 */ extern enum_t g_debugLevel;
/* 4D6B30 */ extern u16 db_804D6B30;
#define GALE01_063930
/* 06729C */ void efAsync_8006729C(void);
/* 06730C */ void efAsync_8006730C(HSD_Archive* archive, u8* data, u32 length,
                                   int index);
/* 06737C */ void efAsync_8006737C(s8);
/* 067624 */ void efAsync_80067624(HSD_GObj*, M2C_UNK*);
/* 067688 */ void efAsync_80067688(void*);
/* 0676F0 */ void efAsync_Spawn(HSD_GObj*, void*, u32, u32, HSD_JObj*, ...);
#define GALE01_05B4B8
#define MELEE_EF_FORWARD_H
typedef struct ef_UnkStruct0 ef_UnkStruct0;
typedef struct ef_UnkStruct1 ef_UnkStruct1;
typedef struct ef_UnkStruct2 ef_UnkStruct2;
/* 05B4B8 */ void efLib_8005B4B8(void);
/* 05B880 */ void efLib_DestroyAll(HSD_GObj* gobj);
/* 05BA40 */ void efLib_PauseAll(HSD_GObj* gobj);
/* 05BAC4 */ void efLib_ResumeAll(HSD_GObj* gobj);
/* 05BE88 */ ef_UnkStruct0* efLib_8005BE88(int);
/* 05F864 */ void efLib_8005F864(HSD_GObj* gobj, s8, float, float);
/* 05FBE4 */ M2C_UNK fn_8005FBE4();
#define MELEE_EF_EFSYNC_H
void efSync_Spawn(s32, ...);
#define MELEE_EF_TYPES_H
struct ef_UnkStruct2 {
    /* +0 */ HSD_JObj* x0;
};
struct ef_UnkStruct0 {
    /*  +0 */ ef_UnkStruct2* x0;
    /*  +4 */ int x4;
    /*  +8 */ M2C_UNK x8;
    /*  +C */ s16 xC;
    /*  +E */ s16 xE;
    /* +10 */ int x10;
    /* +14 */ int x14;
    /* +18 */ int x18;
};
struct ef_UnkStruct1 {
    /* +0 */ int x0;
    /* +4 */ int x4;
    /* +8 */ int x8;
    /* +C */ int xC;
};
#define MELEE_FT_CHARA_FORWARD_H
#define MELEE_FT_CHARA_FTCLINK_FORWARD_H
static MotionFlags const ftCl_MF_Zair =
    Ft_MF_KeepFastFall | Ft_MF_SkipModel | Ft_MF_SkipAnimVel | Ft_MF_Unk06;
#define GALE01_149354
/* 149354 */ void ftCl_AppealS_Anim(HSD_GObj* gobj);
/* 14943C */ void ftCl_AppealS_IASA(HSD_GObj* gobj);
/* 14945C */ void ftCl_AppealS_Phys(HSD_GObj* gobj);
/* 14947C */ void ftCl_AppealS_Coll(HSD_GObj* gobj);
#define GALE01_148C64
#define MELEE_FT_CHARA_FTLINK_FORWARD_H
#define MELEE_FT_CHARA_FTCOMMON_FORWARD_H
struct UNK_SAMUS_S2;
typedef Fighter ftCo_Fighter;
typedef Fighter_GObj ftCo_GObj;
typedef struct ftCollisionBox ftCollisionBox;
static MotionFlags const ftCo_MF_5_6 = Ft_MF_SkipAnimVel | Ft_MF_Unk06;
static MotionFlags const ftCo_MF_2_5_6 =
    ftCo_MF_5_6 | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_Squat = ftCo_MF_2_5_6 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_Dash = ftCo_MF_Squat | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_Run = ftCo_MF_5_6 | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_Appeal =
    ftCo_MF_5_6 | Ft_MF_KeepFastFall | Ft_MF_SkipModel;
static MotionFlags const ftCo_MF_9_10 = Ft_MF_KeepSfx | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_LandingAirN =
    ftCo_MF_9_10 | Ft_MF_KeepColAnimHitStatus | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_LandingAirF =
    ftCo_MF_LandingAirN | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_LandingAirB =
    ftCo_MF_LandingAirN | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_LandingAirHi =
    ftCo_MF_LandingAirB | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_LandingAirLw = ftCo_MF_9_10 | Ft_MF_SkipModel;
static MotionFlags const ftCo_MF_Turn = ftCo_MF_2_5_6 | Ft_MF_KeepAccessory;
static MotionFlags const ftCo_MF_Walk =
    ftCo_MF_2_5_6 | Ft_MF_KeepGfx | Ft_MF_UpdateCmd;
static MotionFlags const ftCo_MF_3_5_6 = ftCo_MF_5_6 | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_Jump =
    ftCo_MF_3_5_6 | Ft_MF_KeepFastFall | Ft_MF_SkipNametagVis;
static MotionFlags const ftCo_MF_JumpAir =
    ftCo_MF_3_5_6 | Ft_MF_KeepGfx | Ft_MF_KeepColAnimPartHitStatus;
static MotionFlags const ftCo_MF_GuardReflect =
    ftCo_MF_5_6 | Ft_MF_KeepFastFall | Ft_MF_KeepGfx | Ft_MF_SkipModel |
    Ft_MF_SkipColAnim | Ft_MF_UnkUpdatePhys;
static MotionFlags const ftCo_MF_Guard = Ft_MF_Unk19 | Ft_MF_UnkUpdatePhys;
static MotionFlags const ftCo_MF_AttackBase =
    Ft_MF_KeepSfx | Ft_MF_SkipItemVis;
static MotionFlags const ftCo_MF_Attack =
    ftCo_MF_AttackBase | Ft_MF_FreezeState;
static MotionFlags const ftCo_MF_Attack_2 =
    ftCo_MF_Attack | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_AttackDash =
    ftCo_MF_Attack_2 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_AttackS3 = ftCo_MF_Attack_2 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_AttackHi3 =
    ftCo_MF_AttackS3 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_AttackLw3 = ftCo_MF_Attack | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_CliffAttackQuick =
    ftCo_MF_AttackLw3 | Ft_MF_KeepFastFall | Ft_MF_KeepGfx |
    Ft_MF_KeepColAnimHitStatus | Ft_MF_SkipModel | Ft_MF_SkipAnimVel;
static MotionFlags const ftCo_MF_AttackAir =
    ftCo_MF_Attack | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_AttackAirN =
    ftCo_MF_AttackAir | Ft_MF_KeepColAnimHitStatus | Ft_MF_SkipHit |
    Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_AttackAirF =
    ftCo_MF_AttackAirN | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_AttackAirB =
    ftCo_MF_AttackAirN | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_AttackAirHi =
    ftCo_MF_AttackAirF | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_AttackAirLw =
    ftCo_MF_AttackAir | Ft_MF_SkipModel;
static MotionFlags const ftCo_MF_Attack4 =
    ftCo_MF_AttackLw3 | Ft_MF_SkipRumble;
static MotionFlags const ftCo_MF_AttackS4 =
    ftCo_MF_Attack4 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_AttackHi4 = ftCo_MF_Attack4 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_AttackLw4 =
    ftCo_MF_Attack4 | Ft_MF_KeepFastFall | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_Attack1 = ftCo_MF_Attack | Ft_MF_Unk19;
static MotionFlags const ftCo_MF_Attack11 =
    ftCo_MF_Attack1 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_Attack12 = ftCo_MF_Attack1 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_Attack13 =
    ftCo_MF_Attack12 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_Attack100 =
    ftCo_MF_Attack1 | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_ItemScope =
    Ft_MF_SkipItemVis | Ft_MF_SkipModelPartVis;
static MotionFlags const ftCo_MF_SwordSwing1 = ftCo_MF_ItemScope | Ft_MF_Unk06;
static MotionFlags const ftCo_MF_SwordSwing3 =
    ftCo_MF_SwordSwing1 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_SwordSwingDash =
    ftCo_MF_SwordSwing3 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_BatSwing1 =
    ftCo_MF_SwordSwing1 | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_BatSwing3 =
    ftCo_MF_BatSwing1 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_BatSwingDash =
    ftCo_MF_BatSwing3 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_ParasolSwing1 =
    ftCo_MF_SwordSwing1 | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_ParasolSwing3 =
    ftCo_MF_ParasolSwing1 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_ParasolSwingDash =
    ftCo_MF_ParasolSwing3 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_HarisenSwing1 =
    ftCo_MF_BatSwing1 | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_HarisenSwing3 =
    ftCo_MF_HarisenSwing1 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_HarisenSwingDash =
    ftCo_MF_HarisenSwing3 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_StarRodSwing1 =
    ftCo_MF_SwordSwing1 | Ft_MF_SkipModel;
static MotionFlags const ftCo_MF_StarRodSwing3 =
    ftCo_MF_StarRodSwing1 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_StarRodSwingDash =
    ftCo_MF_StarRodSwing3 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_LipstickSwing1 =
    ftCo_MF_StarRodSwing1 | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_LipstickSwing3 =
    ftCo_MF_LipstickSwing1 | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_LipstickSwingDash =
    ftCo_MF_LipstickSwing3 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_ParasolOpen =
    ftCo_MF_ParasolSwing1 | Ft_MF_SkipModel;
static MotionFlags const ftCo_MF_HammerBase =
    ftCo_MF_LipstickSwing1 | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_Hammer = ftCo_MF_HammerBase | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_WarpStarFall =
    ftCo_MF_Hammer | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_ItemScope_5_6 =
    ftCo_MF_5_6 | ftCo_MF_ItemScope;
static MotionFlags const ftCo_MF_ItemThrow =
    ftCo_MF_ItemScope_5_6 | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_LGunShoot =
    ftCo_MF_ItemScope | Ft_MF_KeepFastFall | Ft_MF_SkipHit | Ft_MF_SkipModel |
    Ft_MF_Unk06 | Ft_MF_SkipThrowException;
static MotionFlags const ftCo_MF_ItemScopeFire =
    ftCo_MF_LGunShoot | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_HammerFall =
    ftCo_MF_Hammer | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_ItemThrowAir =
    ftCo_MF_ItemThrow | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_LGunShootAir =
    ftCo_MF_LGunShoot | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_ItemScopeAir =
    ftCo_MF_HammerBase | Ft_MF_KeepFastFall | Ft_MF_SkipThrowException |
    Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_Swing4 = Ft_MF_KeepGfx | Ft_MF_SkipRumble;
static MotionFlags const ftCo_MF_SwordSwing4 =
    ftCo_MF_SwordSwing1 | ftCo_MF_Swing4;
static MotionFlags const ftCo_MF_BatSwing4 =
    ftCo_MF_BatSwing1 | ftCo_MF_Swing4;
static MotionFlags const ftCo_MF_ParasolSwing4 =
    ftCo_MF_ParasolSwing1 | ftCo_MF_Swing4;
static MotionFlags const ftCo_MF_HarisenSwing4 =
    ftCo_MF_HarisenSwing1 | ftCo_MF_Swing4;
static MotionFlags const ftCo_MF_StarRodSwing4 =
    ftCo_MF_StarRodSwing1 | ftCo_MF_Swing4;
static MotionFlags const ftCo_MF_LipstickSwing4 =
    ftCo_MF_LipstickSwing1 | ftCo_MF_Swing4;
static MotionFlags const ftCo_MF_ItemThrow4 =
    ftCo_MF_ItemScope_5_6 | ftCo_MF_Swing4;
static MotionFlags const ftCo_MF_ItemThrowAir4 =
    ftCo_MF_ItemThrow4 | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_HammerMove =
    ftCo_MF_HammerBase | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_HammerTurn =
    ftCo_MF_HammerMove | Ft_MF_KeepAccessory;
static MotionFlags const ftCo_MF_HammerWalk =
    ftCo_MF_HammerMove | Ft_MF_UpdateCmd;
static MotionFlags const ftCo_MF_ItemFall =
    Ft_MF_SkipHit | Ft_MF_SkipModel | Ft_MF_Unk06 | Ft_MF_SkipModelPartVis;
static MotionFlags const ftCo_MF_ItemScrewBase =
    ftCo_MF_AttackBase | ftCo_MF_ItemFall | Ft_MF_KeepFastFall | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_ItemScrew =
    ftCo_MF_ItemScrewBase | Ft_MF_SkipNametagVis;
static MotionFlags const ftCo_MF_HammerJump =
    ftCo_MF_HammerMove | Ft_MF_SkipParasol | Ft_MF_SkipNametagVis;
static MotionFlags const ftCo_MF_ItemScrewAir =
    ftCo_MF_ItemScrewBase | Ft_MF_SkipParasol | Ft_MF_KeepColAnimPartHitStatus;
static MotionFlags const ftCo_MF_LiftWait =
    Ft_MF_Unk19 | Ft_MF_SkipModelPartVis;
static MotionFlags const ftCo_MF_LiftMove = ftCo_MF_LiftWait |
                                            Ft_MF_KeepColAnimHitStatus |
                                            Ft_MF_SkipAnimVel | Ft_MF_Unk06;
static MotionFlags const ftCo_MF_LiftTurn =
    ftCo_MF_LiftMove | Ft_MF_KeepAccessory;
static MotionFlags const ftCo_MF_LiftWalk =
    ftCo_MF_LiftMove | Ft_MF_KeepGfx | Ft_MF_UpdateCmd;
static MotionFlags const ftCo_MF_ParasolFall =
    ftCo_MF_ItemFall | Ft_MF_SkipItemVis | Ft_MF_Unk19;
static MotionFlags const ftCo_MF_FireFlowerShoot =
    ftCo_MF_ParasolFall | Ft_MF_KeepGfx | Ft_MF_SkipThrowException;
static MotionFlags const ftCo_MF_ItemScopeRapid =
    ftCo_MF_ParasolFall | Ft_MF_KeepColAnimHitStatus |
    Ft_MF_SkipThrowException | Ft_MF_Unk19;
static MotionFlags const ftCo_MF_FireFlowerShootAir =
    ftCo_MF_FireFlowerShoot | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_ItemScopeAirRapid =
    ftCo_MF_ItemScopeRapid | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_Dazed =
    Ft_MF_UnkUpdatePhys | Ft_MF_SkipModelPartVis;
static MotionFlags const ftCo_MF_Damage = ftCo_MF_Dazed | Ft_MF_KeepSwordTrail;
static MotionFlags const ftCo_MF_DamageScrew =
    ftCo_MF_Damage | Ft_MF_SkipNametagVis;
static MotionFlags const ftCo_MF_DamageScrewAir =
    ftCo_MF_Damage | Ft_MF_KeepColAnimPartHitStatus;
static MotionFlags const ftCo_MF_Down = Ft_MF_SkipHit | Ft_MF_SkipAnimVel |
                                        Ft_MF_Unk06 | Ft_MF_FreezeState |
                                        Ft_MF_SkipModelPartVis;
static MotionFlags const ftCo_MF_DownU =
    ftCo_MF_Down | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_DownD = ftCo_MF_DownU | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_DownDamageU =
    ftCo_MF_DownU | Ft_MF_KeepSwordTrail;
static MotionFlags const ftCo_MF_DownDamageD =
    ftCo_MF_DownD | Ft_MF_KeepSwordTrail;
static MotionFlags const ftCo_MF_DownAttack =
    ftCo_MF_Attack | Ft_MF_SkipModel | Ft_MF_SkipAnimVel |
    Ft_MF_SkipModelPartVis;
static MotionFlags const ftCo_MF_DownAttackU =
    ftCo_MF_DownAttack | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_DownAttackD =
    ftCo_MF_DownAttack | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_PassiveWall =
    ftCo_MF_Dazed | Ft_MF_FreezeState;
static MotionFlags const ftCo_MF_Passive = ftCo_MF_Down | Ft_MF_KeepGfx |
                                           Ft_MF_KeepColAnimHitStatus |
                                           Ft_MF_UnkUpdatePhys;
static MotionFlags const ftCo_MF_StopWall =
    Ft_MF_KeepFastFall | Ft_MF_KeepGfx | Ft_MF_SkipHit | Ft_MF_SkipAnimVel |
    Ft_MF_Unk06 | Ft_MF_SkipMetalB;
static MotionFlags const ftCo_MF_Pass =
    ftCo_MF_StopWall | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_OttottoWait = Ft_MF_Unk19 | Ft_MF_SkipMetalB;
static MotionFlags const ftCo_MF_CliffAction =
    Ft_MF_UnkUpdatePhys | Ft_MF_SkipMetalB;
static MotionFlags const ftCo_MF_CliffAction_4_5 =
    ftCo_MF_CliffAction | Ft_MF_SkipModel | Ft_MF_SkipAnimVel;
static MotionFlags const ftCo_MF_CliffCatch =
    ftCo_MF_CliffAction_4_5 | Ft_MF_Unk06;
static MotionFlags const ftCo_MF_CliffAttackSlow =
    ftCo_MF_AttackBase | ftCo_MF_CliffAction_4_5 | Ft_MF_KeepGfx |
    Ft_MF_KeepColAnimHitStatus | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_CliffWait = ftCo_MF_CliffAction | Ft_MF_Unk19;
static MotionFlags const ftCo_MF_CatchWait =
    Ft_MF_FreezeState | Ft_MF_SkipMetalB;
static MotionFlags const ftCo_MF_CatchBase =
    ftCo_MF_CatchWait | Ft_MF_SkipModel | Ft_MF_SkipAnimVel;
static MotionFlags const ftCo_MF_Catch =
    ftCo_MF_CatchBase | Ft_MF_KeepFastFall | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_Throw = ftCo_MF_CatchBase | Ft_MF_SkipItemVis;
static MotionFlags const ftCo_MF_CatchAttack =
    ftCo_MF_Throw | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCo_MF_ThrowF =
    ftCo_MF_CatchAttack | Ft_MF_KeepFastFall;
static MotionFlags const ftCo_MF_ThrowB = ftCo_MF_CatchAttack | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_ThrowHi = ftCo_MF_ThrowF | Ft_MF_KeepGfx;
static MotionFlags const ftCo_MF_ThrowLw = ftCo_MF_Throw | Ft_MF_SkipHit;
static MotionFlags const ftCo_MF_Capture =
    ftCo_MF_CatchWait | Ft_MF_UnkUpdatePhys;
static MotionFlags const ftCo_MF_CaptureAir =
    ftCo_MF_Capture | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_Thrown =
    ftCo_MF_Capture | Ft_MF_KeepSwordTrail;
static MotionFlags const ftCo_MF_ThrownAir =
    ftCo_MF_Thrown | Ft_MF_SkipParasol;
static MotionFlags const ftCo_MF_Shouldered = ftCo_MF_Capture | Ft_MF_Unk19;
static MotionFlags const ftCo_MF_Rebirth =
    Ft_MF_SkipModelPartVis | Ft_MF_SkipMetalB;
static MotionFlags const ftCo_MF_ThrownStar =
    ftCo_MF_Rebirth | Ft_MF_KeepSwordTrail;
static MotionFlags const ftCo_MF_Dead = ftCo_MF_Dazed | Ft_MF_SkipMetalB;
static MotionFlags const ftCo_MF_Sleep = ftCo_MF_Dead | Ft_MF_KeepSwordTrail;
static MotionFlags const ftCo_MF_Special =
    Ft_MF_SkipModel | Ft_MF_SkipItemVis | Ft_MF_UnkUpdatePhys |
    Ft_MF_FreezeState;
typedef enum ftCommon_MotionState {
    ftCo_MS_None = -1,
    ftCo_MS_DeadDown,
    ftCo_MS_DeadLeft,
    ftCo_MS_DeadRight,
    ftCo_MS_DeadUp,
    ftCo_MS_DeadUpStar,
    ftCo_MS_DeadUpStarIce,
    ftCo_MS_DeadUpFall,
    ftCo_MS_DeadUpFallHitCamera,
    ftCo_MS_DeadUpFallHitCameraFlat,
    ftCo_MS_DeadUpFallIce,
    ftCo_MS_DeadUpFallHitCameraIce,
    ftCo_MS_Sleep,
    ftCo_MS_Rebirth,
    ftCo_MS_RebirthWait,
    ftCo_MS_Wait,
    ftCo_MS_WalkSlow,
    ftCo_MS_WalkMiddle,
    ftCo_MS_WalkFast,
    ftCo_MS_Turn,
    ftCo_MS_TurnRun,
    ftCo_MS_Dash,
    ftCo_MS_Run,
    ftCo_MS_RunDirect,
    ftCo_MS_RunBrake,
    ftCo_MS_KneeBend,
    ftCo_MS_JumpF,
    ftCo_MS_JumpB,
    ftCo_MS_JumpAerialF,
    ftCo_MS_JumpAerialB,
    ftCo_MS_Fall,
    ftCo_MS_FallF,
    ftCo_MS_FallB,
    ftCo_MS_FallAerial,
    ftCo_MS_FallAerialF,
    ftCo_MS_FallAerialB,
    ftCo_MS_FallSpecial,
    ftCo_MS_FallSpecialF,
    ftCo_MS_FallSpecialB,
    ftCo_MS_DamageFall,
    ftCo_MS_Squat,
    ftCo_MS_SquatWait,
    ftCo_MS_SquatRv,
    ftCo_MS_Landing,
    ftCo_MS_LandingFallSpecial,
    ftCo_MS_Attack11,
    ftCo_MS_Attack12,
    ftCo_MS_Attack13,
    ftCo_MS_Attack100Start,
    ftCo_MS_Attack100Loop,
    ftCo_MS_Attack100End,
    ftCo_MS_AttackDash,
    ftCo_MS_AttackS3Hi,
    ftCo_MS_AttackS3HiS,
    ftCo_MS_AttackS3S,
    ftCo_MS_AttackS3LwS,
    ftCo_MS_AttackS3Lw,
    ftCo_MS_AttackHi3,
    ftCo_MS_AttackLw3,
    ftCo_MS_AttackS4Hi,
    ftCo_MS_AttackS4HiS,
    ftCo_MS_AttackS4S,
    ftCo_MS_AttackS4LwS,
    ftCo_MS_AttackS4Lw,
    ftCo_MS_AttackHi4,
    ftCo_MS_AttackLw4,
    ftCo_MS_AttackAirN,
    ftCo_MS_AttackAirF,
    ftCo_MS_AttackAirB,
    ftCo_MS_AttackAirHi,
    ftCo_MS_AttackAirLw,
    ftCo_MS_LandingAirN,
    ftCo_MS_LandingAirF,
    ftCo_MS_LandingAirB,
    ftCo_MS_LandingAirHi,
    ftCo_MS_LandingAirLw,
    ftCo_MS_DamageHi1,
    ftCo_MS_DamageHi2,
    ftCo_MS_DamageHi3,
    ftCo_MS_DamageN1,
    ftCo_MS_DamageN2,
    ftCo_MS_DamageN3,
    ftCo_MS_DamageLw1,
    ftCo_MS_DamageLw2,
    ftCo_MS_DamageLw3,
    ftCo_MS_DamageAir1,
    ftCo_MS_DamageAir2,
    ftCo_MS_DamageAir3,
    ftCo_MS_DamageFlyHi,
    ftCo_MS_DamageFlyN,
    ftCo_MS_DamageFlyLw,
    ftCo_MS_DamageFlyTop,
    ftCo_MS_DamageFlyRoll,
    ftCo_MS_LightGet,
    ftCo_MS_HeavyGet,
    ftCo_MS_LightThrowF,
    ftCo_MS_LightThrowB,
    ftCo_MS_LightThrowHi,
    ftCo_MS_LightThrowLw,
    ftCo_MS_LightThrowDash,
    ftCo_MS_LightThrowDrop,
    ftCo_MS_LightThrowAirF,
    ftCo_MS_LightThrowAirB,
    ftCo_MS_LightThrowAirHi,
    ftCo_MS_LightThrowAirLw,
    ftCo_MS_HeavyThrowF,
    ftCo_MS_HeavyThrowB,
    ftCo_MS_HeavyThrowHi,
    ftCo_MS_HeavyThrowLw,
    ftCo_MS_LightThrowF4,
    ftCo_MS_LightThrowB4,
    ftCo_MS_LightThrowHi4,
    ftCo_MS_LightThrowLw4,
    ftCo_MS_LightThrowAirF4,
    ftCo_MS_LightThrowAirB4,
    ftCo_MS_LightThrowAirHi4,
    ftCo_MS_LightThrowAirLw4,
    ftCo_MS_HeavyThrowF4,
    ftCo_MS_HeavyThrowB4,
    ftCo_MS_HeavyThrowHi4,
    ftCo_MS_HeavyThrowLw4,
    ftCo_MS_SwordSwing1,
    ftCo_MS_SwordSwing3,
    ftCo_MS_SwordSwing4,
    ftCo_MS_SwordSwingDash,
    ftCo_MS_BatSwing1,
    ftCo_MS_BatSwing3,
    ftCo_MS_BatSwing4,
    ftCo_MS_BatSwingDash,
    ftCo_MS_ParasolSwing1,
    ftCo_MS_ParasolSwing3,
    ftCo_MS_ParasolSwing4,
    ftCo_MS_ParasolSwingDash,
    ftCo_MS_HarisenSwing1,
    ftCo_MS_HarisenSwing3,
    ftCo_MS_HarisenSwing4,
    ftCo_MS_HarisenSwingDash,
    ftCo_MS_StarRodSwing1,
    ftCo_MS_StarRodSwing3,
    ftCo_MS_StarRodSwing4,
    ftCo_MS_StarRodSwingDash,
    ftCo_MS_LipstickSwing1,
    ftCo_MS_LipstickSwing3,
    ftCo_MS_LipstickSwing4,
    ftCo_MS_LipstickSwingDash,
    ftCo_MS_ItemParasolOpen,
    ftCo_MS_ItemParasolFall,
    ftCo_MS_ItemParasolFallSpecial,
    ftCo_MS_ItemParasolDamageFall,
    ftCo_MS_LGunShoot,
    ftCo_MS_LGunShootAir,
    ftCo_MS_LGunShootEmpty,
    ftCo_MS_LGunShootAirEmpty,
    ftCo_MS_FireFlowerShoot,
    ftCo_MS_FireFlowerShootAir,
    ftCo_MS_ItemScrew,
    ftCo_MS_ItemScrewAir,
    ftCo_MS_DamageScrew,
    ftCo_MS_DamageScrewAir,
    ftCo_MS_ItemScopeStart,
    ftCo_MS_ItemScopeRapid,
    ftCo_MS_ItemScopeFire,
    ftCo_MS_ItemScopeEnd,
    ftCo_MS_ItemScopeAirStart,
    ftCo_MS_ItemScopeAirRapid,
    ftCo_MS_ItemScopeAirFire,
    ftCo_MS_ItemScopeAirEnd,
    ftCo_MS_ItemScopeStartEmpty,
    ftCo_MS_ItemScopeRapidEmpty,
    ftCo_MS_ItemScopeFireEmpty,
    ftCo_MS_ItemScopeEndEmpty,
    ftCo_MS_ItemScopeAirStartEmpty,
    ftCo_MS_ItemScopeAirRapidEmpty,
    ftCo_MS_ItemScopeAirFireEmpty,
    ftCo_MS_ItemScopeAirEndEmpty,
    ftCo_MS_LiftWait,
    ftCo_MS_LiftWalk1,
    ftCo_MS_LiftWalk2,
    ftCo_MS_LiftTurn,
    ftCo_MS_GuardOn,
    ftCo_MS_Guard,
    ftCo_MS_GuardOff,
    ftCo_MS_GuardSetOff,
    ftCo_MS_GuardReflect,
    ftCo_MS_DownBoundU,
    ftCo_MS_DownWaitU,
    ftCo_MS_DownDamageU,
    ftCo_MS_DownStandU,
    ftCo_MS_DownAttackU,
    ftCo_MS_DownFowardU,
    ftCo_MS_DownBackU,
    ftCo_MS_DownSpotU,
    ftCo_MS_DownBoundD,
    ftCo_MS_DownWaitD,
    ftCo_MS_DownDamageD,
    ftCo_MS_DownStandD,
    ftCo_MS_DownAttackD,
    ftCo_MS_DownFowardD,
    ftCo_MS_DownBackD,
    ftCo_MS_DownSpotD,
    ftCo_MS_Passive,
    ftCo_MS_PassiveStandF,
    ftCo_MS_PassiveStandB,
    ftCo_MS_PassiveWall,
    ftCo_MS_PassiveWallJump,
    ftCo_MS_PassiveCeil,
    ftCo_MS_ShieldBreakFly,
    ftCo_MS_ShieldBreakFall,
    ftCo_MS_ShieldBreakDownU,
    ftCo_MS_ShieldBreakDownD,
    ftCo_MS_ShieldBreakStandU,
    ftCo_MS_ShieldBreakStandD,
    ftCo_MS_Furafura,
    ftCo_MS_Catch,
    ftCo_MS_CatchPull,
    ftCo_MS_CatchDash,
    ftCo_MS_CatchDashPull,
    ftCo_MS_CatchWait,
    ftCo_MS_CatchAttack,
    ftCo_MS_CatchCut,
    ftCo_MS_ThrowF,
    ftCo_MS_ThrowB,
    ftCo_MS_ThrowHi,
    ftCo_MS_ThrowLw,
    ftCo_MS_CapturePulledHi,
    ftCo_MS_CaptureWaitHi,
    ftCo_MS_CaptureDamageHi,
    ftCo_MS_CapturePulledLw,
    ftCo_MS_CaptureWaitLw,
    ftCo_MS_CaptureDamageLw,
    ftCo_MS_CaptureCut,
    ftCo_MS_CaptureJump,
    ftCo_MS_CaptureNeck,
    ftCo_MS_CaptureFoot,
    ftCo_MS_EscapeF,
    ftCo_MS_EscapeB,
    ftCo_MS_EscapeN,
    ftCo_MS_EscapeAir,
    ftCo_MS_ReboundStop,
    ftCo_MS_Rebound,
    ftCo_MS_ThrownF,
    ftCo_MS_ThrownB,
    ftCo_MS_ThrownHi,
    ftCo_MS_ThrownLw,
    ftCo_MS_ThrownlwWomen,
    ftCo_MS_Pass,
    ftCo_MS_Ottotto,
    ftCo_MS_OttottoWait,
    ftCo_MS_FlyReflectWall,
    ftCo_MS_FlyReflectCeil,
    ftCo_MS_StopWall,
    ftCo_MS_StopCeil,
    ftCo_MS_MissFoot,
    ftCo_MS_CliffCatch,
    ftCo_MS_CliffWait,
    ftCo_MS_CliffClimbSlow,
    ftCo_MS_CliffClimbQuick,
    ftCo_MS_CliffAttackSlow,
    ftCo_MS_CliffAttackQuick,
    ftCo_MS_CliffEscapeSlow,
    ftCo_MS_CliffEscapeQuick,
    ftCo_MS_CliffJumpSlow1,
    ftCo_MS_CliffJumpSlow2,
    ftCo_MS_CliffJumpQuick1,
    ftCo_MS_CliffJumpQuick2,
    ftCo_MS_AppealSR,
    ftCo_MS_AppealSL,
    ftCo_MS_ShoulderedWait,
    ftCo_MS_ShoulderedWalkSlow,
    ftCo_MS_ShoulderedWalkMiddle,
    ftCo_MS_ShoulderedWalkFast,
    ftCo_MS_ShoulderedTurn,
    ftCo_MS_ThrownFF,
    ftCo_MS_ThrownFB,
    ftCo_MS_ThrownFHi,
    ftCo_MS_ThrownFLw,
    ftCo_MS_CaptureCaptain,
    ftCo_MS_CaptureYoshi,
    ftCo_MS_YoshiEgg,
    ftCo_MS_CaptureKoopa,
    ftCo_MS_CaptureDamageKoopa,
    ftCo_MS_CaptureWaitKoopa,
    ftCo_MS_ThrownKoopaF,
    ftCo_MS_ThrownKoopaB,
    ftCo_MS_CaptureKoopaAir,
    ftCo_MS_CaptureDamageKoopaAir,
    ftCo_MS_CaptureWaitKoopaAir,
    ftCo_MS_ThrownKoopaAirF,
    ftCo_MS_ThrownKoopaAirB,
    ftCo_MS_CaptureKirby,
    ftCo_MS_CaptureWaitKirby,
    ftCo_MS_ThrownKirbyStar,
    ftCo_MS_ThrownCopyStar,
    ftCo_MS_ThrownKirby,
    ftCo_MS_BarrelWait,
    ftCo_MS_Bury,
    ftCo_MS_BuryWait,
    ftCo_MS_BuryJump,
    ftCo_MS_DamageSong,
    ftCo_MS_DamageSongWait,
    ftCo_MS_DamageSongRv,
    ftCo_MS_DamageBind,
    ftCo_MS_CaptureMewtwo,
    ftCo_MS_CaptureMewtwoAir,
    ftCo_MS_ThrownMewtwo,
    ftCo_MS_ThrownMewtwoAir,
    ftCo_MS_WarpStarJump,
    ftCo_MS_WarpStarFall,
    ftCo_MS_HammerWait,
    ftCo_MS_HammerWalk,
    ftCo_MS_HammerTurn,
    ftCo_MS_HammerKneeBend,
    ftCo_MS_HammerFall,
    ftCo_MS_HammerJump,
    ftCo_MS_HammerLanding,
    ftCo_MS_KinokoGiantStart,
    ftCo_MS_KinokoGiantStartAir,
    ftCo_MS_KinokoGiantEnd,
    ftCo_MS_KinokoGiantEndAir,
    ftCo_MS_KinokoSmallStart,
    ftCo_MS_KinokoSmallStartAir,
    ftCo_MS_KinokoSmallEnd,
    ftCo_MS_KinokoSmallEndAir,
    ftCo_MS_Entry,
    ftCo_MS_EntryStart,
    ftCo_MS_EntryEnd,
    ftCo_MS_DamageIce,
    ftCo_MS_DamageIceJump,
    ftCo_MS_CaptureMasterHand,
    ftCo_MS_CaptureDamageMasterHand,
    ftCo_MS_CaptureWaitMasterHand,
    ftCo_MS_ThrownMasterHand,
    ftCo_MS_CaptureKirbyYoshi,
    ftCo_MS_KirbyYoshiEgg,
    ftCo_MS_CaptureLeadead,
    ftCo_MS_CaptureLikelike,
    ftCo_MS_DownReflect,
    ftCo_MS_CaptureCrazyHand,
    ftCo_MS_CaptureDamageCrazyHand,
    ftCo_MS_CaptureWaitCrazyHand,
    ftCo_MS_ThrownCrazyHand,
    ftCo_MS_Barrel,
    ftCo_MS_Count
} ftCommon_MotionState;
typedef enum ftCo_Submotion {
    ftCo_SM_None = -1,
    ftCo_SM_DeadUpFallHitCamera,
    ftCo_SM_DeadUpFallHitCameraFlat,
    ftCo_SM_Wait1_0,
    ftCo_SM_Wait2,
    ftCo_SM_Unk004,
    ftCo_SM_Unk005,
    ftCo_SM_Wait1_1,
    ftCo_SM_WalkSlow,
    ftCo_SM_WalkMiddle,
    ftCo_SM_WalkFast,
    ftCo_SM_Turn,
    ftCo_SM_TurnRun,
    ftCo_SM_Dash,
    ftCo_SM_Run,
    ftCo_SM_RunBrake,
    ftCo_SM_Kneebend,
    ftCo_SM_JumpF,
    ftCo_SM_JumpB,
    ftCo_SM_JumpAerialF,
    ftCo_SM_JumpAerialB,
    ftCo_SM_Fall,
    ftCo_SM_FallF,
    ftCo_SM_FallB,
    ftCo_SM_FallAerial,
    ftCo_SM_FallAerialF,
    ftCo_SM_FallAerialB,
    ftCo_SM_FallSpecial,
    ftCo_SM_FallSpecialF,
    ftCo_SM_FallSpecialB,
    ftCo_SM_DamageFall,
    ftCo_SM_Squat,
    ftCo_SM_SquatWait,
    ftCo_SM_Unk032,
    ftCo_SM_SquatWaitItem,
    ftCo_SM_SquatRv,
    ftCo_SM_Landing,
    ftCo_SM_LandingFallSpecial,
    ftCo_SM_GuardOn,
    ftCo_SM_Guard,
    ftCo_SM_GuardOff,
    ftCo_SM_GuardDamage,
    ftCo_SM_EscapeN,
    ftCo_SM_EscapeF,
    ftCo_SM_EscapeB,
    ftCo_SM_EscapeAir,
    ftCo_SM_Rebound,
    ftCo_SM_Attack11,
    ftCo_SM_Attack12,
    ftCo_SM_Attack13,
    ftCo_SM_Attack100Start,
    ftCo_SM_Attack100Loop,
    ftCo_SM_Attack100End,
    ftCo_SM_AttackDash,
    ftCo_SM_AttackS3Hi,
    ftCo_SM_AttackS3HiS,
    ftCo_SM_AttackS3,
    ftCo_SM_AttackS3LwS,
    ftCo_SM_AttackS3Lw,
    ftCo_SM_AttackHi3,
    ftCo_SM_AttackLw3,
    ftCo_SM_AttackS4Hi,
    ftCo_SM_AttackS4HiS,
    ftCo_SM_AttackS4,
    ftCo_SM_AttackS4LwS,
    ftCo_SM_AttackS4Lw,
    ftCo_SM_Unk065,
    ftCo_SM_AttackHi4,
    ftCo_SM_AttackLw4,
    ftCo_SM_AttackAirN,
    ftCo_SM_AttackAirF,
    ftCo_SM_AttackAirB,
    ftCo_SM_AttackAirHi,
    ftCo_SM_AttackAirLw,
    ftCo_SM_LandingAirN,
    ftCo_SM_LandingAirF,
    ftCo_SM_LandingAirB,
    ftCo_SM_LandingAirHi,
    ftCo_SM_LandingAirLw,
    ftCo_SM_LightGet,
    ftCo_SM_LightThrowF,
    ftCo_SM_LightThrowB,
    ftCo_SM_LightThrowHi,
    ftCo_SM_LightThrowLw,
    ftCo_SM_LightThrowDash,
    ftCo_SM_LightThrowDrop,
    ftCo_SM_LightThrowAirF,
    ftCo_SM_LightThrowAirB,
    ftCo_SM_LightThrowAirHi,
    ftCo_SM_LightThrowAirLw,
    ftCo_SM_HeavyGet,
    ftCo_SM_HeavyWalk1,
    ftCo_SM_HeavyWalk2,
    ftCo_SM_HeavyThrowF,
    ftCo_SM_HeavyThrowB,
    ftCo_SM_HeavyThrowHi,
    ftCo_SM_HeavyThrowLw,
    ftCo_SM_LightThrowF4,
    ftCo_SM_LightThrowB4,
    ftCo_SM_LightThrowHi4,
    ftCo_SM_LightThrowLw4,
    ftCo_SM_LightThrowAirF4,
    ftCo_SM_LightThrowAirB4,
    ftCo_SM_LightThrowAirHi4,
    ftCo_SM_LightThrowAirLw4,
    ftCo_SM_HeavyThrowF4,
    ftCo_SM_HeavyThrowB4,
    ftCo_SM_HeavyThrowHi4,
    ftCo_SM_HeavyThrowLw4,
    ftCo_SM_SwordSwing1,
    ftCo_SM_SwordSwing3,
    ftCo_SM_SwordSwing4,
    ftCo_SM_SwordSwingDash,
    ftCo_SM_BatSwing1,
    ftCo_SM_BatSwing3,
    ftCo_SM_BatSwing4,
    ftCo_SM_BatSwingDash,
    ftCo_SM_ParasolSwing1,
    ftCo_SM_ParasolSwing3,
    ftCo_SM_ParasolSwing4,
    ftCo_SM_ParasolSwingDash,
    ftCo_SM_HarisenSwing1,
    ftCo_SM_HarisenSwing3,
    ftCo_SM_HarisenSwing4,
    ftCo_SM_HarisenSwingDash,
    ftCo_SM_StarRodSwing1,
    ftCo_SM_StarRodSwing3,
    ftCo_SM_StarRodSwing4,
    ftCo_SM_StarRodSwingDash,
    ftCo_SM_LipstickSwing1,
    ftCo_SM_LipstickSwing3,
    ftCo_SM_LipstickSwing4,
    ftCo_SM_LipstickSwingDash,
    ftCo_SM_HammerWait,
    ftCo_SM_HammerMove,
    ftCo_SM_ItemParasolOpen,
    ftCo_SM_ItemParasolFall,
    ftCo_SM_ItemParasolFallSpecial,
    ftCo_SM_ItemParasolDamageFall,
    ftCo_SM_LGunShoot,
    ftCo_SM_LGunShootAir,
    ftCo_SM_LGunShootEmpty,
    ftCo_SM_LGunShootAirEmpty,
    ftCo_SM_FireFlowerShoot,
    ftCo_SM_FireFlowerShootAir,
    ftCo_SM_ItemScrew,
    ftCo_SM_ItemScrewAir,
    ftCo_SM_ItemScrewDamage,
    ftCo_SM_ItemScrewDamageAir,
    ftCo_SM_ItemBlind,
    ftCo_SM_ItemScopeStart,
    ftCo_SM_ItemScopeRapid,
    ftCo_SM_ItemScopeFire,
    ftCo_SM_ItemScopeEnd,
    ftCo_SM_ItemScopeAirStart,
    ftCo_SM_ItemScopeAirRapid,
    ftCo_SM_ItemScopeAirFire,
    ftCo_SM_ItemScopeAirEnd,
    ftCo_SM_ItemScopeStartEmpty,
    ftCo_SM_ItemScopeRapidEmpty,
    ftCo_SM_ItemScopeFireEmpty,
    ftCo_SM_ItemScopeEndEmpty,
    ftCo_SM_ItemScopeAirStartEmpty,
    ftCo_SM_ItemScopeAirRapidEmpty,
    ftCo_SM_ItemScopeAirFireEmpty,
    ftCo_SM_ItemScopeAirEndEmpty,
    ftCo_SM_DamageHi1,
    ftCo_SM_DamageHi2,
    ftCo_SM_DamageHi3,
    ftCo_SM_DamageN1,
    ftCo_SM_DamageN2,
    ftCo_SM_DamageN3,
    ftCo_SM_DamageLw1,
    ftCo_SM_DamageLw2,
    ftCo_SM_DamageLw3,
    ftCo_SM_DamageAir1,
    ftCo_SM_DamageAir2,
    ftCo_SM_DamageAir3,
    ftCo_SM_DamageFlyHi,
    ftCo_SM_DamageFlyN,
    ftCo_SM_DamageFlyLw,
    ftCo_SM_DamageFlyTop,
    ftCo_SM_DamageFlyRoll,
    ftCo_SM_Unk182,
    ftCo_SM_DownBoundU,
    ftCo_SM_DownWaitU,
    ftCo_SM_DownDamageU,
    ftCo_SM_DownStandU,
    ftCo_SM_DownAttackU,
    ftCo_SM_DownFowardU,
    ftCo_SM_DownBackU,
    ftCo_SM_DownSpotU,
    ftCo_SM_DownBoundD,
    ftCo_SM_DownWaitD,
    ftCo_SM_DownDamageD,
    ftCo_SM_DownStandD,
    ftCo_SM_DownAttackD,
    ftCo_SM_DownFowardD,
    ftCo_SM_DownBackD,
    ftCo_SM_DownSpotD,
    ftCo_SM_Passive,
    ftCo_SM_PassiveStandF,
    ftCo_SM_PassiveStandB,
    ftCo_SM_PassiveWall,
    ftCo_SM_PassiveWallJump,
    ftCo_SM_PassiveCeil,
    ftCo_SM_FuraFura,
    ftCo_SM_FuraSleepStart,
    ftCo_SM_FuraSleepLoop,
    ftCo_SM_FuraSleepEnd,
    ftCo_SM_Pass,
    ftCo_SM_Ottotto,
    ftCo_SM_OttottoWait,
    ftCo_SM_WallDamage,
    ftCo_SM_StopWall,
    ftCo_SM_StopCeil,
    ftCo_SM_MissFoot,
    ftCo_SM_CliffCatch,
    ftCo_SM_CliffWait,
    ftCo_SM_Unk218,
    ftCo_SM_CliffClimbSlow,
    ftCo_SM_CliffClimbQuick,
    ftCo_SM_CliffAttackSlow,
    ftCo_SM_CliffAttackQuick,
    ftCo_SM_CliffEscapeSlow,
    ftCo_SM_CliffEscapeQuick,
    ftCo_SM_CliffJumpSlow1,
    ftCo_SM_CliffJumpSlow2,
    ftCo_SM_CliffJumpQuick1,
    ftCo_SM_CliffJumpQuick2,
    ftCo_SM_Unk229,
    ftCo_SM_Unk230,
    ftCo_SM_Unk231,
    ftCo_SM_Unk232,
    ftCo_SM_Unk233,
    ftCo_SM_Unk234,
    ftCo_SM_Unk235,
    ftCo_SM_Unk236,
    ftCo_SM_Unk237,
    ftCo_SM_EntryStart,
    ftCo_SM_AppealSR,
    ftCo_SM_AppealSL,
    ftCo_SM_Unk241,
    ftCo_SM_Catch,
    ftCo_SM_CatchDash,
    ftCo_SM_CatchWait,
    ftCo_SM_CatchAttack,
    ftCo_SM_CatchCut,
    ftCo_SM_ThrowF,
    ftCo_SM_ThrowB,
    ftCo_SM_ThrowHi,
    ftCo_SM_ThrowLw,
    ftCo_SM_CapturePulledHi,
    ftCo_SM_CaptureWaitHi,
    ftCo_SM_CaptureDamageHi,
    ftCo_SM_CapturePulledLw,
    ftCo_SM_CaptureWaitLw,
    ftCo_SM_CaptureDamageLw,
    ftCo_SM_CaptureCut,
    ftCo_SM_CaptureJump,
    ftCo_SM_CaptureNeck,
    ftCo_SM_CaptureFoot,
    ftCo_SM_Unk261,
    ftCo_SM_ThrownF,
    ftCo_SM_ThrownB,
    ftCo_SM_ThrownHi,
    ftCo_SM_ThrownLw,
    ftCo_SM_ThrownlwWomen,
    ftCo_SM_ShoulderedWait,
    ftCo_SM_ShoulderedWalkSlow,
    ftCo_SM_ShoulderedWalkMiddle,
    ftCo_SM_ShoulderedWalkFast,
    ftCo_SM_ShoulderedTurn,
    ftCo_SM_ThrownFF,
    ftCo_SM_ThrownFB,
    ftCo_SM_ThrownFHi,
    ftCo_SM_ThrownFLw,
    ftCo_SM_CaptureCaptain,
    ftCo_SM_YoshiEgg,
    ftCo_SM_CaptureDamageKoopa,
    ftCo_SM_ThrownKoopaF,
    ftCo_SM_ThrownKoopaB,
    ftCo_SM_CaptureDamageKoopaAir,
    ftCo_SM_ThrownKoopaAirF,
    ftCo_SM_ThrownKoopaAirB,
    ftCo_SM_ThrownCopyStar,
    ftCo_SM_ThrownKirbyStar,
    ftCo_SM_ShieldBreakFly,
    ftCo_SM_ShieldBreakFall,
    ftCo_SM_ShieldBreakDownU,
    ftCo_SM_ShieldBreakDownD,
    ftCo_SM_ShieldBreakStandU,
    ftCo_SM_ShieldBreakStandD,
    ftCo_SM_ThrownMewtwo,
    ftCo_SM_ThrownMewtwoAir,
    ftCo_SM_KirbyYoshiEgg,
    ftCo_SM_Count,
} ftCo_Submotion;
typedef enum ftCo_Surface {
    FTCO_Surface_None,
    ftCo_Surface_LeftWall,
    ftCo_Surface_RightWall,
    ftCo_Surface_Ceiling,
} ftCo_Surface;
typedef Fighter ftLk_Fighter;
typedef HSD_GObj ftLk_GObj;
typedef struct ftLk_DatAttrs ftLk_DatAttrs;
typedef struct ftLk_FighterVars ftLk_FighterVars;
typedef union ftLk_MotionVars ftLk_MotionVars;
static MotionFlags const ftLk_MF_Base0 =
    Ft_MF_SkipModel | Ft_MF_SkipThrowException;
static MotionFlags const ftLk_MF_Base1 = Ft_MF_SkipItemVis | Ft_MF_FreezeState;
static MotionFlags const ftLk_MF_Base2 = ftLk_MF_Base1 | Ft_MF_KeepFastFall;
static MotionFlags const ftLk_MF_Base3 = ftLk_MF_Base0 | Ft_MF_UnkUpdatePhys;
static MotionFlags const ftLk_MF_AttackS42 = ftLk_MF_Base2 | Ft_MF_SkipHit;
static MotionFlags const ftLk_MF_SpecialN = ftLk_MF_Base2 | ftLk_MF_Base3;
static MotionFlags const ftLk_MF_SpecialNFullyCharged =
    ftLk_MF_SpecialN | Ft_MF_Unk19;
static MotionFlags const ftLk_MF_SpecialAirNCharge =
    ftLk_MF_SpecialN | Ft_MF_SkipParasol;
static MotionFlags const ftLk_MF_SpecialAirNFullyCharged =
    ftLk_MF_SpecialNFullyCharged | Ft_MF_SkipParasol;
static MotionFlags const ftLk_MF_SpecialAirNFire =
    ftLk_MF_SpecialAirNCharge | Ft_MF_UnkUpdatePhys;
static MotionFlags const ftLk_MF_SpecialSThrow =
    ftLk_MF_Base3 | ftLk_MF_Base1 | Ft_MF_KeepGfx;
static MotionFlags const ftLk_MF_SpecialSCatch =
    ftLk_MF_SpecialSThrow | Ft_MF_UnkUpdatePhys;
static MotionFlags const ftLk_MF_SpecialAirSThrow =
    ftLk_MF_SpecialSThrow | ftLk_MF_Base3 | Ft_MF_SkipParasol;
static MotionFlags const ftLk_MF_SpecialAirSThrowEmpty =
    ftLk_MF_SpecialSCatch | ftLk_MF_Base1 | Ft_MF_SkipParasol;
static MotionFlags const ftLk_MF_SpecialHi =
    Ft_MF_KeepFastFall | Ft_MF_KeepGfx | Ft_MF_SkipModel | Ft_MF_KeepSfx |
    Ft_MF_SkipItemVis | Ft_MF_UnkUpdatePhys | Ft_MF_FreezeState;
static MotionFlags const ftLk_MF_SpecialLw =
    Ft_MF_KeepColAnimHitStatus | Ft_MF_SkipModel | Ft_MF_SkipItemVis |
    Ft_MF_UnkUpdatePhys | Ft_MF_FreezeState;
static MotionFlags const ftLk_MF_SpecialAirLw =
    ftLk_MF_SpecialLw | Ft_MF_SkipParasol;
static MotionFlags const ftLk_MF_ZairCatch =
    Ft_MF_SkipModelPartVis | Ft_MF_SkipMetalB;
typedef enum ftLink_MotionState {
    ftLk_MS_AttackS42 = ftCo_MS_Count,
    ftLk_MS_AppealSR,
    ftLk_MS_AppealSL,
    ftLk_MS_SpecialNStart,
    ftLk_MS_SpecialNLoop,
    ftLk_MS_SpecialNEnd,
    ftLk_MS_SpecialAirNStart,
    ftLk_MS_SpecialAirNLoop,
    ftLk_MS_SpecialAirNEnd,
    ftLk_MS_SpecialS1,
    ftLk_MS_SpecialS2,
    ftLk_MS_SpecialS1Empty,
    ftLk_MS_SpecialAirS1,
    ftLk_MS_SpecialAirS2,
    ftLk_MS_SpecialAirS1Empty,
    ftLk_MS_SpecialHi,
    ftLk_MS_SpecialAirHi,
    ftLk_MS_SpecialLw,
    ftLk_MS_SpecialAirLw,
    ftLk_MS_AirCatch,
    ftLk_MS_AirCatchHit,
    ftLk_MS_Count,
    ftLk_MS_SelfCount = ftLk_MS_Count - ftCo_MS_Count,
} ftLink_MotionState;
typedef enum ftLk_SpecialNIndex {
    ftLk_SpecialNIndex_Start,
    ftLk_SpecialNIndex_Loop,
    ftLk_SpecialNIndex_End,
    ftLk_SpecialNIndex_AirStart,
    ftLk_SpecialNIndex_AirLoop,
    ftLk_SpecialNIndex_AirEnd,
    ftLk_SpecialNIndex_None,
} ftLk_SpecialNIndex;
typedef enum ftLk_Submotion {
    ftLk_SM_AttackS42 = ftCo_SM_Count,
    ftLk_SM_SpecialNStart,
    ftLk_SM_SpecialNLoop,
    ftLk_SM_SpecialNEnd,
    ftLk_SM_SpecialAirNStart,
    ftLk_SM_SpecialAirNLoop,
    ftLk_SM_SpecialAirNEnd,
    ftLk_SM_SpecialS1,
    ftLk_SM_SpecialS2,
    ftLk_SM_SpecialS1Empty,
    ftLk_SM_SpecialAirS1,
    ftLk_SM_SpecialAirS2,
    ftLk_SM_SpecialAirS1Empty,
    ftLk_SM_SpecialHi,
    ftLk_SM_SpecialAirHi,
    ftLk_SM_SpecialLw,
    ftLk_SM_SpecialAirLw,
    ftLk_SM_AirCatch,
    ftLk_SM_AirCatchHit,
    ftLk_SM_Count,
    ftLk_SM_SelfCount = ftLk_SM_Count - ftCo_SM_Count,
} ftLk_Submotion;
#define MELEE_FT_TYPES_H
#define MELEE_FT_CHARA_FTCAPTAIN_TYPES_H
#define MELEE_FT_CHARA_FTCAPTAIN_FORWARD_H
typedef struct ftCaptain_DatAttrs ftCaptain_DatAttrs;
typedef union ftCaptain_MotionVars ftCaptain_MotionVars;
static MotionFlags const ftCa_MF_Special = ftCo_MF_Special | Ft_MF_KeepSfx;
static MotionFlags const ftCa_MF_SpecialN =
    ftCa_MF_Special | Ft_MF_KeepFastFall;
static MotionFlags const ftCa_MF_SpecialAirN =
    ftCa_MF_SpecialN | Ft_MF_SkipParasol;
static MotionFlags const ftCa_MF_SpecialS = ftCa_MF_Special | Ft_MF_KeepGfx;
static MotionFlags const ftCa_MF_SpecialAirSStart =
    ftCa_MF_SpecialS | Ft_MF_SkipParasol;
static MotionFlags const ftCa_MF_SpecialAirS =
    ftCa_MF_SpecialS | Ft_MF_SkipParasol;
static MotionFlags const ftCa_MF_SpecialHi =
    ftCo_MF_Special | Ft_MF_KeepFastFall | Ft_MF_KeepGfx;
static MotionFlags const ftCa_MF_SpecialAirHi =
    ftCa_MF_SpecialHi | Ft_MF_SkipParasol;
static MotionFlags const ftCa_MF_SpecialLw =
    ftCa_MF_Special | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftCa_MF_SpecialLwRebound =
    ftCa_MF_SpecialLw | Ft_MF_SkipParasol;
typedef enum ftCaptain_MotionState {
    ftCa_MS_SwordSwing4 = ftCo_MS_Count,
    ftCa_MS_BatSwing4,
    ftCa_MS_ParasolSwing4,
    ftCa_MS_HarisenSwing4,
    ftCa_MS_StarRodSwing4,
    ftCa_MS_LipstickSwing4,
    ftCa_MS_SpecialN,
    ftCa_MS_SpecialAirN,
    ftCa_MS_SpecialSStart,
    ftCa_MS_SpecialS,
    ftCa_MS_SpecialAirSStart,
    ftCa_MS_SpecialAirS,
    ftCa_MS_SpecialHi,
    ftCa_MS_SpecialAirHi,
    ftCa_MS_SpecialHiCatch,
    ftCa_MS_SpecialHiThrow,
    ftCa_MS_SpecialLw,
    ftCa_MS_SpecialLwEnd,
    ftCa_MS_SpecialAirLw,
    ftCa_MS_SpecialAirLwEnd,
    ftCa_MS_SpecialAirLwEndAir,
    ftCa_MS_SpecialLwEndAir,
    ftCa_MS_SpecialHiThrow1,
    ftCa_MS_Count,
    ftCa_MS_SelfCount = ftCa_MS_Count - ftCo_MS_Count,
} ftCaptain_MotionState;
typedef enum ftCa_Submotion {
    ftCa_SM_SwordSwing4 = ftCo_SM_Count,
    ftCa_SM_BatSwing4,
    ftCa_SM_ParasolSwing4,
    ftCa_SM_HarisenSwing4,
    ftCa_SM_StarRodSwing4,
    ftCa_SM_LipstickSwing4,
    ftCa_SM_SpecialN,
    ftCa_SM_SpecialAirN,
    ftCa_SM_SpecialSStart,
    ftCa_SM_SpecialS,
    ftCa_SM_SpecialAirSStart,
    ftCa_SM_SpecialAirS,
    ftCa_SM_SpecialHi,
    ftCa_SM_SpecialAirHi,
    ftCa_SM_SpecialHiCatch,
    ftCa_SM_SpecialHiThrow0,
    ftCa_SM_SpecialLw,
    ftCa_SM_SpecialLwEnd,
    ftCa_SM_SpecialAirLw,
    ftCa_SM_SpecialAirLwEnd,
    ftCa_SM_SpecialLwEndAir,
    ftCa_SM_SpecialAirLwEndAir,
    ftCa_SM_SpecialHiThrow1,
    ftCa_SM_Count,
    ftCa_SM_SelfCount = ftCa_SM_Count - ftCo_SM_Count,
} ftCa_Submotion;
struct ftCaptain_FighterVars {
    /* 0x222C */ u32 during_specials_start;
    /* 0x2230 */ u32 during_specials;
    u8 _[0xF8 - 8];
};
struct ftCaptain_DatAttrs {
    /* +0 */ float specialn_stick_range_y_neg;
    /* +4 */ float specialn_stick_range_y_pos;
    /* +8 */ float specialn_angle_diff;
    /* +C */ float specialn_vel_x;
    /* +10 */ float specialn_vel_mul;
    /* +14 */ float specials_gr_vel_x;
    /* +18 */ float specials_grav;
    /* +1C */ float specials_terminal_vel;
    /* +20 */ float specials_unk0;
    /* +24 */ float specials_unk1;
    /* +28 */ float specials_unk2;
    /* +2C */ float specials_unk3;
    /* +30 */ float specials_unk4;
    /* +34 */ float specials_unk5;
    /* +38 */ float specials_miss_landing_lag;
    /* +3C */ float specials_hit_landing_lag;
    /* +40 */ float specialhi_air_friction_mul;
    /* +44 */ float specialhi_horz_vel;
    /* +48 */ float specialhi_freefall_air_spd_mul;
    /* +4C */ float specialhi_landing_lag;
    /* +50 */ float specialhi_unk0;
    /* +54 */ float specialhi_unk1;
    /* +58 */ float specialhi_input_var;
    /* +5C */ float specialhi_unk2;
    /* +60 */ float specialhi_catch_grav;
    /* +64 */ s32 specialhi_air_var;
    /* +68 */ float x68;
    /* +6C */ u32 speciallw_unk1;
    /* +70 */ float speciallw_flame_particle_angle;
    /* +74 */ float speciallw_on_hit_spd_modifier;
    /* +78 */ s32 speciallw_unk2;
    /* +7C */ float speciallw_ground_lag_mul;
    /* +80 */ float speciallw_landing_lag_mul;
    /* +84 */ float speciallw_ground_traction;
    /* +88 */ float speciallw_air_landing_traction;
};
union ftCaptain_MotionVars {
    struct ftCaptainSpecialSVars {
        /* fp+2340 */ float grav;
    } specials;
    struct ftCaptainSpecialHiVars {
        /* fp+2340 */ u16 x0;
        /* fp+2342:0 */ u8 x2_b0 : 1;
        /* fp+2342:1 */ u8 x2_b1 : 1;
        /* fp+2342:2 */ u8 x2_b2 : 1;
        /* fp+2342:3 */ u8 x2_b3 : 1;
        /* fp+2342:4 */ u8 x2_b4 : 1;
        /* fp+2342:5 */ u8 x2_b5 : 1;
        /* fp+2342:6 */ u8 x2_b6 : 1;
        /* fp+2342:7 */ u8 x2_b7 : 1;
        /* fp+2343 */ u8 x3;
        /* fp+2344 */ Vec2 vel;
    } specialhi;
    struct ftCaptainSpecialLwVars {
        /* fp+2340 */ u16 x0;
        /* fp+2342 */ u16 x2;
        /* fp+2344 */ float friction;
    } speciallw;
};
#define MELEE_FT_CHARA_FTCOMMON_TYPES_H
#define MELEE_FT_CHARA_FTKIRBY_FORWARD_H
typedef struct HSD_GObj ftKb_GObj;
typedef struct Fighter ftKb_Fighter;
typedef struct ftKb_DatAttrs ftKb_DatAttrs;
/// @todo Clean up factorization
static MotionFlags const ftKb_MF_MultiJump =
    Ft_MF_KeepGfx | Ft_MF_SkipHit | Ft_MF_SkipAnimVel | Ft_MF_Unk06;
static MotionFlags const ftKb_MF_AttackDash =
    Ft_MF_KeepFastFall | Ft_MF_KeepColAnimHitStatus | Ft_MF_SkipItemVis |
    Ft_MF_FreezeState;
static MotionFlags const ftKb_MF_AttackDashAir =
    ftKb_MF_AttackDash | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_18_20_21 =
    Ft_MF_SkipItemVis | Ft_MF_UnkUpdatePhys | Ft_MF_FreezeState;
static MotionFlags const ftKb_MF_4_18_20_21 =
    ftKb_MF_18_20_21 | Ft_MF_SkipModel;
static MotionFlags const ftKb_MF_2_4_18_20_21 =
    ftKb_MF_4_18_20_21 | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftKb_MF_5_18_20_21 =
    ftKb_MF_18_20_21 | Ft_MF_SkipAnimVel;
static MotionFlags const ftKb_MF_SpecialN =
    ftKb_MF_4_18_20_21 | Ft_MF_KeepFastFall;
static MotionFlags const ftKb_MF_SpecialS = ftKb_MF_4_18_20_21 | Ft_MF_KeepGfx;
static MotionFlags const ftKb_MF_SpecialHi =
    ftKb_MF_4_18_20_21 | Ft_MF_KeepFastFall | Ft_MF_KeepGfx;
static MotionFlags const ftKb_MF_SpecialNMr =
    ftKb_MF_4_18_20_21 | Ft_MF_KeepFastFall | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftKb_MF_SpecialNKp =
    ftKb_MF_4_18_20_21 | Ft_MF_KeepFastFall | Ft_MF_SkipHit;
static MotionFlags const ftKb_MF_SpecialNPe =
    ftKb_MF_2_4_18_20_21 | Ft_MF_KeepFastFall | Ft_MF_SkipHit;
static MotionFlags const ftKb_MF_SpecialNYs =
    ftKb_MF_5_18_20_21 | Ft_MF_KeepFastFall;
static MotionFlags const ftKb_MF_SpecialNLg =
    ftKb_MF_5_18_20_21 | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftKb_MF_SpecialNZd =
    ftKb_MF_5_18_20_21 | Ft_MF_KeepGfx | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftKb_MF_SpecialNDr =
    ftKb_MF_5_18_20_21 | Ft_MF_SkipHit;
static MotionFlags const ftKb_MF_SpecialNGk =
    ftKb_MF_SpecialNZd | Ft_MF_SkipHit;
static MotionFlags const ftKb_MF_SpecialNFx =
    ftKb_MF_2_4_18_20_21 | Ft_MF_KeepGfx | Ft_MF_SkipThrowException;
static MotionFlags const ftKb_MF_SpecialNLk = ftKb_MF_4_18_20_21 |
                                              Ft_MF_KeepGfx | Ft_MF_SkipHit |
                                              Ft_MF_SkipThrowException;
static MotionFlags const ftKb_MF_SpecialNSk =
    ftKb_MF_SpecialNLk | Ft_MF_KeepFastFall;
static MotionFlags const ftKb_MF_SpecialNNs =
    ftKb_MF_2_4_18_20_21 | Ft_MF_SkipHit | Ft_MF_SkipThrowException;
static MotionFlags const ftKb_MF_SpecialNPp =
    ftKb_MF_SpecialNNs | Ft_MF_KeepGfx;
static MotionFlags const ftKb_MF_SpecialNPk =
    ftKb_MF_SpecialNPp | Ft_MF_KeepFastFall;
static MotionFlags const ftKb_MF_SpecialNSs =
    ftKb_MF_5_18_20_21 | Ft_MF_SkipThrowException;
static MotionFlags const ftKb_MF_SpecialNSs_1 =
    ftKb_MF_SpecialNSs | Ft_MF_KeepGfx;
static MotionFlags const ftKb_MF_SpecialNMt =
    ftKb_MF_SpecialNSs_1 | Ft_MF_KeepFastFall;
static MotionFlags const ftKb_MF_SpecialNCl =
    ftKb_MF_SpecialNMt | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftKb_MF_SpecialNFc =
    ftKb_MF_SpecialNDr | Ft_MF_KeepFastFall | Ft_MF_SkipThrowException;
static MotionFlags const ftKb_MF_SpecialNPc =
    ftKb_MF_SpecialNSs_1 | Ft_MF_SkipHit;
static MotionFlags const ftKb_MF_SpecialNGw =
    ftKb_MF_SpecialNPc | Ft_MF_KeepFastFall;
static MotionFlags const ftKb_MF_SpecialLw =
    ftKb_MF_2_4_18_20_21 | Ft_MF_KeepSfx;
static MotionFlags const ftKb_MF_SpecialNCa =
    ftKb_MF_SpecialLw | Ft_MF_KeepFastFall | Ft_MF_KeepGfx;
static MotionFlags const ftKb_MF_SpecialNDk =
    ftKb_MF_4_18_20_21 | Ft_MF_SkipHit | Ft_MF_KeepSfx;
static MotionFlags const ftKb_MF_5_9_18_20_21 =
    ftKb_MF_5_18_20_21 | Ft_MF_KeepSfx;
static MotionFlags const ftKb_MF_2_5_9_18_20_21 =
    ftKb_MF_5_9_18_20_21 | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftKb_MF_SpecialNPr =
    ftKb_MF_5_9_18_20_21 | Ft_MF_KeepGfx;
static MotionFlags const ftKb_MF_SpecialNMs =
    ftKb_MF_2_5_9_18_20_21 | Ft_MF_KeepFastFall;
static MotionFlags const ftKb_MF_SpecialNGn =
    ftKb_MF_2_5_9_18_20_21 | Ft_MF_SkipHit;
static MotionFlags const ftKb_MF_SpecialNFeStart =
    ftKb_MF_SpecialNMs | Ft_MF_SkipHit;
static MotionFlags const ftKb_MF_SpecialAirN =
    ftKb_MF_SpecialN | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirS =
    ftKb_MF_SpecialS | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirHi =
    ftKb_MF_SpecialHi | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNMr =
    ftKb_MF_SpecialNMr | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNKp =
    ftKb_MF_SpecialNKp | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNPe =
    ftKb_MF_SpecialNPe | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNYs =
    ftKb_MF_SpecialNYs | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNLg =
    ftKb_MF_SpecialNLg | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNZd =
    ftKb_MF_SpecialNZd | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNDr =
    ftKb_MF_SpecialNDr | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNGk =
    ftKb_MF_SpecialNGk | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNFx =
    ftKb_MF_SpecialNFx | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNLk =
    ftKb_MF_SpecialNLk | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNSk =
    ftKb_MF_SpecialNSk | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNNs =
    ftKb_MF_SpecialNNs | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNPp =
    ftKb_MF_SpecialNPp | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNPk =
    ftKb_MF_SpecialNPk | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNSs =
    ftKb_MF_SpecialNSs | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNMt =
    ftKb_MF_SpecialNMt | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNCl =
    ftKb_MF_SpecialNCl | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNFc =
    ftKb_MF_SpecialNFc | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNPc =
    ftKb_MF_SpecialNPc | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNGw =
    ftKb_MF_SpecialNGw | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirLw =
    ftKb_MF_SpecialLw | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNCa =
    ftKb_MF_SpecialNCa | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNDk =
    ftKb_MF_SpecialNDk | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNPr =
    ftKb_MF_SpecialNPr | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNMs =
    ftKb_MF_SpecialNMs | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNGn =
    ftKb_MF_SpecialNGn | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialNFe =
    ftKb_MF_SpecialNFeStart | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_0_4_18_20_21 =
    ftKb_MF_4_18_20_21 | Ft_MF_KeepFastFall;
static MotionFlags const ftKb_MF_SpecialNCaptureTurn =
    ftKb_MF_0_4_18_20_21 | Ft_MF_KeepAccessory;
static MotionFlags const ftKb_MF_SpecialAirNCaptureTurn =
    ftKb_MF_SpecialNCaptureTurn | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialNCaptureWalk =
    ftKb_MF_0_4_18_20_21 | Ft_MF_UpdateCmd;
static MotionFlags const ftKb_MF_SpecialNCaptureJumpSquat =
    ftKb_MF_0_4_18_20_21 | Ft_MF_SkipNametagVis;
static MotionFlags const ftKb_MF_SpecialNLoop =
    ftKb_MF_0_4_18_20_21 | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNKpLoop =
    ftKb_MF_SpecialNKp | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNGkLoop =
    ftKb_MF_SpecialNGk | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNFxLoop =
    ftKb_MF_SpecialNFx | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNLkCharged =
    ftKb_MF_SpecialNLk | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNSkLoop =
    ftKb_MF_SpecialNSk | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNMtLoop =
    ftKb_MF_SpecialNMt | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNClCharged =
    ftKb_MF_SpecialNCl | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNFcLoop =
    ftKb_MF_SpecialNFc | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialNPrLoop =
    ftKb_MF_SpecialNPr | Ft_MF_Unk19;
static MotionFlags const ftKb_MF_SpecialAirNLoop =
    ftKb_MF_SpecialNLoop | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNKpLoop =
    ftKb_MF_SpecialNKpLoop | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNGkLoop =
    ftKb_MF_SpecialNGkLoop | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNFxLoop =
    ftKb_MF_SpecialNFxLoop | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNLkCharged =
    ftKb_MF_SpecialNLkCharged | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNSkLoop =
    ftKb_MF_SpecialNSkLoop | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNMtLoop =
    ftKb_MF_SpecialNMtLoop | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNClCharged =
    ftKb_MF_SpecialNClCharged | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNFcLoop =
    ftKb_MF_SpecialNFcLoop | Ft_MF_SkipParasol;
static MotionFlags const ftKb_MF_SpecialAirNPrLoop =
    ftKb_MF_SpecialNPrLoop | Ft_MF_SkipParasol;
typedef enum ftKirby_MotionState {
    ftKb_MS_JumpAerialF1 = ftCo_MS_Count,
    ftKb_MS_JumpAerialF2,
    ftKb_MS_JumpAerialF3,
    ftKb_MS_JumpAerialF4,
    ftKb_MS_JumpAerialF5,
    ftKb_MS_JumpAerialF1Met,
    ftKb_MS_JumpAerialF2Met,
    ftKb_MS_JumpAerialF3Met,
    ftKb_MS_JumpAerialF4Met,
    ftKb_MS_JumpAerialF5Met,
    ftKb_MS_AttackDash,
    ftKb_MS_AttackDashAir,
    ftKb_MS_SpecialN,
    ftKb_MS_SpecialNLoop,
    ftKb_MS_SpecialNEnd,
    ftKb_MS_SpecialNCapture0,
    ftKb_MS_SpecialNCapture1,
    ftKb_MS_Eat,
    ftKb_MS_EatWait,
    ftKb_MS_EatWalkSlow,
    ftKb_MS_EatWalkMiddle,
    ftKb_MS_EatWalkFast,
    ftKb_MS_EatTurn,
    ftKb_MS_EatJump1,
    ftKb_MS_EatJump2,
    ftKb_MS_EatLanding,
    ftKb_MS_SpecialNDrink0,
    ftKb_MS_SpecialNDrink1,
    ftKb_MS_SpecialNSpit0,
    ftKb_MS_SpecialNSpit1,
    ftKb_MS_SpecialAirN,
    ftKb_MS_SpecialAirNLoop,
    ftKb_MS_SpecialAirNEnd,
    ftKb_MS_SpecialAirNCapture0,
    ftKb_MS_SpecialAirNCapture1,
    ftKb_MS_EatAir,
    ftKb_MS_EatFall,
    ftKb_MS_SpecialAirNDrink0,
    ftKb_MS_SpecialAirNDrink1,
    ftKb_MS_SpecialAirNSpit0,
    ftKb_MS_SpecialAirNSpit1,
    ftKb_MS_EatTurnAir,
    ftKb_MS_SpecialS,
    ftKb_MS_SpecialAirS,
    ftKb_MS_SpecialHi1,
    ftKb_MS_SpecialHi2,
    ftKb_MS_SpecialHi3,
    ftKb_MS_SpecialHi4,
    ftKb_MS_SpecialAirHi1,
    ftKb_MS_SpecialAirHi2,
    ftKb_MS_SpecialAirHi3,
    ftKb_MS_SpecialAirHi4,
    ftKb_MS_SpecialLw1,
    ftKb_MS_SpecialLw,
    ftKb_MS_SpecialLwEnd,
    ftKb_MS_SpecialAirLwStart,
    ftKb_MS_SpecialAirLw,
    ftKb_MS_SpecialAirLwEnd,
    ftKb_MS_MrSpecialN,
    ftKb_MS_MrSpecialAirN,
    ftKb_MS_LkSpecialNStart,
    ftKb_MS_LkSpecialNLoop,
    ftKb_MS_LkSpecialNEnd,
    ftKb_MS_LkSpecialAirNStart,
    ftKb_MS_LkSpecialAirNLoop,
    ftKb_MS_LkSpecialAirNEnd,
    ftKb_MS_SsSpecialNStart,
    ftKb_MS_SsSpecialNHold,
    ftKb_MS_SsSpecialNCancel,
    ftKb_MS_SsSpecialN,
    ftKb_MS_SsSpecialAirNStart,
    ftKb_MS_SsSpecialAirN,
    ftKb_MS_YsSpecialN1,
    ftKb_MS_YsSpecialNCapture1_0,
    ftKb_MS_YsSpecialNCapture1_1,
    ftKb_MS_YsSpecialNCapture2_0,
    ftKb_MS_YsSpecialNCapture2_1,
    ftKb_MS_YsSpecialAirNCapture2,
    ftKb_MS_YsSpecialAirNCapture1_0,
    ftKb_MS_YsSpecialAirNCapture1_1,
    ftKb_MS_YsSpecialAirN2_0,
    ftKb_MS_YsSpecialAirN2_1,
    ftKb_MS_FxSpecialNStart,
    ftKb_MS_FxSpecialNLoop,
    ftKb_MS_FxSpecialNEnd,
    ftKb_MS_FxSpecialAirNStart,
    ftKb_MS_FxSpecialAirNLoop,
    ftKb_MS_FxSpecialAirNEnd,
    ftKb_MS_PkSpecialN,
    ftKb_MS_PkSpecialAirN,
    ftKb_MS_LgSpecialN,
    ftKb_MS_LgSpecialAirN,
    ftKb_MS_CaSpecialN,
    ftKb_MS_CaSpecialAirN,
    ftKb_MS_NsSpecialNStart,
    ftKb_MS_NsSpecialNHold0,
    ftKb_MS_NsSpecialNHold1,
    ftKb_MS_NsSpecialNEnd,
    ftKb_MS_NsSpecialAirNStart,
    ftKb_MS_NsSpecialAirNHold0,
    ftKb_MS_NsSpecialAirNHold1,
    ftKb_MS_NsSpecialAirNEnd,
    ftKb_MS_KpSpecialNStart,
    ftKb_MS_KpSpecialN,
    ftKb_MS_KpSpecialNEnd,
    ftKb_MS_KpSpecialAirNStart,
    ftKb_MS_KpSpecialAirN,
    ftKb_MS_KpSpecialAirNEnd,
    ftKb_MS_PeSpecialLw,
    ftKb_MS_PeSpecialLwHit,
    ftKb_MS_PeSpecialAirLw,
    ftKb_MS_PeSpecialAirLwHit,
    ftKb_MS_PpSpecialN,
    ftKb_MS_PpSpecialAirN,
    ftKb_MS_DkSpecialNStart,
    ftKb_MS_DkSpecialNLoop,
    ftKb_MS_DkSpecialNCancel,
    ftKb_MS_DkSpecialN,
    ftKb_MS_DkSpecialNFull,
    ftKb_MS_DkSpecialAirNStart,
    ftKb_MS_DkSpecialAirNLoop,
    ftKb_MS_DkSpecialAirNCancel,
    ftKb_MS_DkSpecialAirN,
    ftKb_MS_DkSpecialAirNFull,
    ftKb_MS_ZdSpecialN,
    ftKb_MS_ZdSpecialAirN,
    ftKb_MS_SkSpecialNStart,
    ftKb_MS_SkSpecialNLoop,
    ftKb_MS_SkSpecialNCancel,
    ftKb_MS_SkSpecialNEnd,
    ftKb_MS_SkSpecialAirNStart,
    ftKb_MS_SkSpecialAirNLoop,
    ftKb_MS_SkSpecialAirNCancel,
    ftKb_MS_SkSpecialAirNEnd,
    ftKb_MS_PrSpecialNStartR,
    ftKb_MS_PrSpecialNStartL,
    ftKb_MS_PrSpecialNLoop,
    ftKb_MS_PrSpecialNFull,
    ftKb_MS_PrSpecialN1,
    ftKb_MS_PrSpecialNTurn,
    ftKb_MS_PrSpecialNEndR,
    ftKb_MS_PrSpecialNEndL,
    ftKb_MS_PrSpecialAirNStartR,
    ftKb_MS_PrSpecialAirNStartL,
    ftKb_MS_PrSpecialAirNLoop,
    ftKb_MS_PrSpecialAirNFull,
    ftKb_MS_PrSpecialAirN,
    ftKb_MS_PrSpecialN0,
    ftKb_MS_PrSpecialAirNEndR0,
    ftKb_MS_PrSpecialAirNEndR1,
    ftKb_MS_PrSpecialNHit,
    ftKb_MS_MsSpecialNStart,
    ftKb_MS_MsSpecialNLoop,
    ftKb_MS_MsSpecialNEnd0,
    ftKb_MS_MsSpecialNEnd1,
    ftKb_MS_MsSpecialAirNStart,
    ftKb_MS_MsSpecialAirNLoop,
    ftKb_MS_MsSpecialAirNEnd0,
    ftKb_MS_MsSpecialAirNEnd1,
    ftKb_MS_MtSpecialNStart,
    ftKb_MS_MtSpecialNLoop,
    ftKb_MS_MtSpecialNLoopFull,
    ftKb_MS_MtSpecialNCancel,
    ftKb_MS_MtSpecialNEnd,
    ftKb_MS_MtSpecialAirNStart,
    ftKb_MS_MtSpecialAirNLoop,
    ftKb_MS_MtSpecialAirNLoopFull,
    ftKb_MS_MtSpecialAirNCancel,
    ftKb_MS_MtSpecialAirNEnd,
    ftKb_MS_GwSpecialN,
    ftKb_MS_GwSpecialAirN,
    ftKb_MS_DrSpecialN,
    ftKb_MS_DrSpecialAirN,
    ftKb_MS_ClSpecialNStart,
    ftKb_MS_ClSpecialNLoop,
    ftKb_MS_ClSpecialNEnd,
    ftKb_MS_ClSpecialAirNStart,
    ftKb_MS_ClSpecialAirNLoop,
    ftKb_MS_ClSpecialAirNEnd,
    ftKb_MS_FcSpecialNStart,
    ftKb_MS_FcSpecialNLoop,
    ftKb_MS_FcSpecialNEnd,
    ftKb_MS_FcSpecialAirNStart,
    ftKb_MS_FcSpecialAirNLoop,
    ftKb_MS_FcSpecialAirNEnd,
    ftKb_MS_PcSpecialN,
    ftKb_MS_PcSpecialAirN,
    ftKb_MS_GnSpecialN,
    ftKb_MS_GnSpecialAirN,
    ftKb_MS_FeSpecialNStart,
    ftKb_MS_FeSpecialNLoop,
    ftKb_MS_FeSpecialNEnd0,
    ftKb_MS_FeSpecialNEnd1,
    ftKb_MS_FeSpecialAirNStart,
    ftKb_MS_FeSpecialAirNLoop,
    ftKb_MS_FeSpecialAirNEnd0,
    ftKb_MS_FeSpecialAirNEnd1,
    ftKb_MS_GkSpecialNStart,
    ftKb_MS_GkSpecialN,
    ftKb_MS_GkSpecialNEnd,
    ftKb_MS_GkSpecialAirNStart,
    ftKb_MS_GkSpecialAirN,
    ftKb_MS_GkSpecialAirNEnd,
    ftKb_MS_Count,
    ftKb_MS_SelfCount = ftKb_MS_Count - ftCo_MS_Count,
} ftKirby_MotionState;
typedef enum ftKb_Submotion {
    ftKb_SM_JumpAerialF1 = ftCo_SM_Count,
    ftKb_SM_JumpAerialF2,
    ftKb_SM_JumpAerialF3,
    ftKb_SM_JumpAerialF4,
    ftKb_SM_JumpAerialF5,
    ftKb_SM_JumpAerialF1Met,
    ftKb_SM_JumpAerialF2Met,
    ftKb_SM_JumpAerialF3Met,
    ftKb_SM_JumpAerialF4Met,
    ftKb_SM_JumpAerialF5Met,
    ftKb_SM_SpecialN,
    ftKb_SM_SpecialNLoop,
    ftKb_SM_SpecialNEnd,
    ftKb_SM_SpecialNCapture,
    ftKb_SM_Eat,
    ftKb_SM_EatWait,
    ftKb_SM_EatWalkSlow,
    ftKb_SM_EatWalkMiddle,
    ftKb_SM_EatWalkFast,
    ftKb_SM_EatJump1,
    ftKb_SM_EatJump2,
    ftKb_SM_EatLanding,
    ftKb_SM_EatTurn,
    ftKb_SM_SpecialNDrink,
    ftKb_SM_SpecialNSpit,
    ftKb_SM_SpecialAirN,
    ftKb_SM_SpecialAirNLoop,
    ftKb_SM_SpecialS,
    ftKb_SM_SpecialAirS,
    ftKb_SM_SpecialHi1,
    ftKb_SM_SpecialHi2,
    ftKb_SM_SpecialHi3,
    ftKb_SM_SpecialHi4,
    ftKb_SM_SpecialAirHi1,
    ftKb_SM_SpecialAirHi2,
    ftKb_SM_SpecialAirHi3,
    ftKb_SM_SpecialAirHiEnd,
    ftKb_SM_SpecialLw1,
    ftKb_SM_SpecialLw,
    ftKb_SM_SpecialLwEnd,
    ftKb_SM_SpecialAirLwStart,
    ftKb_SM_SpecialAirLw,
    ftKb_SM_SpecialAirLwEnd,
    ftKb_SM_MrSpecialN,
    ftKb_SM_MrSpecialAirN,
    ftKb_SM_LkSpecialNStart,
    ftKb_SM_LkSpecialNLoop,
    ftKb_SM_LkSpecialNEnd,
    ftKb_SM_LkSpecialAirNStart,
    ftKb_SM_LkSpecialAirNLoop,
    ftKb_SM_LkSpecialAirNEnd,
    ftKb_SM_SsSpecialNStart,
    ftKb_SM_SsSpecialNHold,
    ftKb_SM_SsSpecialNCancel,
    ftKb_SM_SsSpecialN,
    ftKb_SM_SsSpecialAirNStart,
    ftKb_SM_SsSpecialAirN,
    ftKb_SM_YsSpecialN1,
    ftKb_SM_YsSpecialNCapture1,
    ftKb_SM_YsSpecialNCapture2,
    ftKb_SM_YsSpecialAirNCapture2,
    ftKb_SM_YsSpecialAirCapture1,
    ftKb_SM_YsSpecialAirN2,
    ftKb_SM_FxSpecialNStart,
    ftKb_SM_FxSpecialNLoop,
    ftKb_SM_FxSpecialNEnd,
    ftKb_SM_FxSpecialAirNStart,
    ftKb_SM_FxSpecialAirNLoop,
    ftKb_SM_FxSpecialAirNEnd,
    ftKb_SM_PkSpecialN,
    ftKb_SM_PkSpecialAirN,
    ftKb_SM_LgSpecialN,
    ftKb_SM_LgSpecialAirN,
    ftKb_SM_CaSpecialN,
    ftKb_SM_CaSpecialAirN,
    ftKb_SM_NsSpecialNStart,
    ftKb_SM_NsSpecialNHold0,
    ftKb_SM_NsSpecialNHold1,
    ftKb_SM_NsSpecialNEnd,
    ftKb_SM_NsSpecialAirNStart,
    ftKb_SM_NsSpecialAirNHold0,
    ftKb_SM_NsSpecialAirNHold1,
    ftKb_SM_NsSpecialAirNEnd,
    ftKb_SM_KpSpecialNStart,
    ftKb_SM_KpSpecialN,
    ftKb_SM_KpSpecialNEnd,
    ftKb_SM_KpSpecialAirNStart,
    ftKb_SM_KpSpecialAirN,
    ftKb_SM_KpSpecialAirNEnd,
    ftKb_SM_PeSpecialLw,
    ftKb_SM_PeSpecialLwHit,
    ftKb_SM_PeSpecialAirLw,
    ftKb_SM_PeSpecialAirLwHit,
    ftKb_SM_PpSpecialN,
    ftKb_SM_PpSpecialAirN,
    ftKb_SM_DkSpecialNStart,
    ftKb_SM_DkSpecialNLoop,
    ftKb_SM_DkSpecialNCancel,
    ftKb_SM_DkSpecialN,
    ftKb_SM_DkSpecialNFull,
    ftKb_SM_DkSpecialAirNStart,
    ftKb_SM_DkSpecialAirNLoop,
    ftKb_SM_DkSpecialAirNCancel,
    ftKb_SM_DkSpecialAirN,
    ftKb_SM_DkSpecialAirNFull,
    ftKb_SM_ZdSpecialN,
    ftKb_SM_ZdSpecialAirN,
    ftKb_SM_SkSpecialNStart,
    ftKb_SM_SkSpecialNLoop,
    ftKb_SM_SkSpecialNCancel,
    ftKb_SM_SkSpecialNEnd,
    ftKb_SM_SkSpecialAirNStart,
    ftKb_SM_SkSpecialAirNLoop,
    ftKb_SM_SkSpecialAirNCancel,
    ftKb_SM_SkSpecialAirNEnd,
    ftKb_SM_PrSpecialNStartR,
    ftKb_SM_PrSpecialNStartL,
    ftKb_SM_PrSpecialNLoop,
    ftKb_SM_PrSpecialNFull,
    ftKb_SM_PrSpecialN1,
    ftKb_SM_PrSpecialNTurn,
    ftKb_SM_PrSpecialNEndR,
    ftKb_SM_PrSpecialNEndL,
    ftKb_SM_PrSpecialAirNStartR,
    ftKb_SM_PrSpecialAirNStartL,
    ftKb_SM_PrSpecialAirNLoop,
    ftKb_SM_PrSpecialAirNFull,
    ftKb_SM_PrSpecialAirN,
    ftKb_SM_PrSpecialN0,
    ftKb_SM_PrSpecialAirNEndR0,
    ftKb_SM_PrSpecialAirNEndR1,
    ftKb_SM_PrSpecialNHit,
    ftKb_SM_MsSpecialNStart,
    ftKb_SM_MsSpecialNLoop,
    ftKb_SM_MsSpecialNEnd0,
    ftKb_SM_MsSpecialNEnd1,
    ftKb_SM_MsSpecialAirNStart,
    ftKb_SM_MsSpecialAirNLoop,
    ftKb_SM_MsSpecialAirNEnd0,
    ftKb_SM_MsSpecialAirNEnd1,
    ftKb_SM_MtSpecialNStart,
    ftKb_SM_MtSpecialNLoop,
    ftKb_SM_MtSpecialNLoopFull,
    ftKb_SM_MtSpecialNCancel,
    ftKb_SM_MtSpecialNEnd,
    ftKb_SM_MtSpecialAirNStart,
    ftKb_SM_MtSpecialAirNLoop,
    ftKb_SM_MtSpecialAirNLoopFull,
    ftKb_SM_MtSpecialAirNCancel,
    ftKb_SM_MtSpecialAirNEnd,
    ftKb_SM_GwSpecialN,
    ftKb_SM_GwSpecialAirN,
    ftKb_SM_DrSpecialN,
    ftKb_SM_DrSpecialAirN,
    ftKb_SM_ClSpecialNStart,
    ftKb_SM_ClSpecialNLoop,
    ftKb_SM_ClSpecialNEnd,
    ftKb_SM_ClSpecialAirNStart,
    ftKb_SM_ClSpecialAirNLoop,
    ftKb_SM_ClSpecialAirNEnd,
    ftKb_SM_FcSpecialNStart,
    ftKb_SM_FcSpecialNLoop,
    ftKb_SM_FcSpecialNEnd,
    ftKb_SM_FcSpecialAirNStart,
    ftKb_SM_FcSpecialAirNLoop,
    ftKb_SM_FcSpecialAirNEnd,
    ftKb_SM_PcSpecialN,
    ftKb_SM_PcSpecialAirN,
    ftKb_SM_GnSpecialN,
    ftKb_SM_GnSpecialAirN,
    ftKb_SM_FeSpecialNStart,
    ftKb_SM_FeSpecialNLoop,
    ftKb_SM_FeSpecialNEnd0,
    ftKb_SM_FeSpecialNEnd1,
    ftKb_SM_FeSpecialAirNStart,
    ftKb_SM_FeSpecialAirNLoop,
    ftKb_SM_FeSpecialAirNEnd0,
    ftKb_SM_FeSpecialAirNEnd1,
    ftKb_SM_GkSpecialNStart,
    ftKb_SM_GkSpecialN,
    ftKb_SM_GkSpecialNEnd,
    ftKb_SM_GkSpecialAirNStart,
    ftKb_SM_GkSpecialAirN,
    ftKb_SM_GkSpecialAirNEnd,
    ftKb_SM_Count,
    ftKb_SM_SelfCount = ftKb_SM_Count - ftCo_SM_Count,
} ftKb_Submotion;
struct ftCollisionBox {
    /*  +0 */ float top;
    /*  +4 */ float bottom;
    /*  +8 */ Vec2 left;
    /* +10 */ Vec2 right;
};
struct UNK_SAMUS_S2 {
    Fighter_Part parts[3];
    Vec3 vec1;
    Vec3 vec2;
    float scale;
};
union ftCommon_MotionVars {
    struct {
        /* fp+2340 */ float x0;
        /* fp+2344 */ FtMotionId msid;
        /* fp+2348 */ float slow_anim_frame;
        /* fp+234C */ float middle_anim_frame;
        /* fp+2350 */ float fast_anim_frame;
        /* fp+2354 */ float slow_anim_rate;
        /* fp+2358 */ float middle_anim_rate;
        /* fp+235C */ float fast_anim_rate;
        /* fp+2360 */ float accel_mul;
    } walk;
    struct {
        /* fp+2340 */ bool x0;
    } attack1;
    struct {
        /* fp+2340 */ int x0;
    } attackdash;
    struct {
        /* fp+2340 */ bool x0;
    } attacklw3;
    struct {
        /* fp+2340 */ float x0;
        /* fp+2344 */ int x4;
        /* fp+2348 */ int x8;
        /* fp+234C */ M2C_UNK xC;
        /* fp+2350 */ M2C_UNK x10;
        /* fp+2354 */ float x14;
        /* fp+2358 */ u8 x18;
        /* fp+2359 */ u8 x19;
        /* fp+235A */ u8 x1A;
        /* fp+235B */ u8 x1B;
    } damage;
    struct {
        /* fp+2340 */ s8 x0;
        /* fp+2341 */ s8 x1;
        /* fp+2342 */ s8 x2;
        /* fp+2343 */ s8 x3;
        /* fp+2344 */ float x4;
        /* fp+2348 */ ftCollisionBox x8;
    } damageice;
    struct {
        /* fp+2340 */ float x0;
    } damageicejump;
    struct {
        /* fp+2340 */ float x0;
        /* fp+2344 */ float x4;
        /* fp+2348 */ float x8;
        /* fp+234C */ bool xC;
        /* fp+2350 */ float x10;
        /* fp+2354 */ float x14;
        /* fp+2358 */ float x18;
        /* fp+235C */ int x1C;
        /* fp+2360 */ int x20;
        /* fp+2364 */ int x24;
        /* fp+2368 */ M2C_UNK x28;
        /* fp+236C */ float x2C;
    } guard;
    struct {
        /* fp+2340 */ bool x0;
    } itemget;
    struct {
        /* fp+2340 */ float facing_dir;
        /* fp+2344 */ M2C_UNK x4;
        /* fp+2348 */ M2C_UNK x8;
        /* fp+234C */ M2C_UNK xC;
        /* fp+2350 */ M2C_UNK x10;
        /* fp+2354 */ M2C_UNK x14;
        /* fp+2358 */ M2C_UNK x18;
        /* fp+235C */ M2C_UNK x1C;
        /* fp+2360 */ int x20;
    } itemthrow;
    struct {
        /* fp+2340 */ int unk_timer;
        /* fp+2344 */ float anim_spd;
        /* fp+2348 */ Vec3 x8;
    } itemthrow4;
    struct {
        /* fp+2340 */ int x0;
        /* fp+2344 */ float x4;
        /* fp+2348 */ float x8;
        /* fp+234C */ int xC;
        /* fp+2350 */ bool x10;
        /* fp+2354 */ float x14;
        /* fp+2358 */ bool allow_interrupt;
    } fallspecial;
    struct {
        /* fp+2340 */ bool x0;
        /* fp+2344 */ float x4;
        /* fp+2348 */ bool x8;
    } lift;
    struct {
        /* fp+2340 */ float x0;
    } downwait;
    struct {
        /* fp+2340 */ bool x0;
        /* fp+2344 */ bool x4;
    } escape;
    struct {
        /* fp+2340 */ int timer;
        /* fp+2344 */ Vec3 self_vel;
    } escapeair;
    struct {
        /* fp+2340 */ float x0;
        /* fp+2344 */ float anim_start;
    } rebound;
    struct {
        /* fp+2340 */ bool x0;
        /* fp+2344 */ float x4;
    } pass;
    struct {
        /**
         * Used to check against opponent's #Fighter::213C while they're
         * occupying a ledge within grab range
         */
        /* fp+2340 */ int ledge_id;
        /* fp+2344 */ float x4;
        /* fp+2348 */ bool x8;
    } cliff;
    struct {
        /* fp+2340 */ bool x0;
    } cliffjump;
    struct {
        /* fp+2340 */ bool x0;
    } cargoturn;
    struct {
        /* fp+2340 */ int x0;
        /* fp+2344 */ int x4;
        /* fp+2348 */ float x8;
    } cargokneebend;
    struct {
        /* fp+2340 */ float x0;
        /* fp+2344 */ int x4;
    } shouldered;
    struct {
        /* fp+2340 */ float x0;
    } downdamage;
    struct {
        /* fp+2340 */ ftCo_GObj* x0;
        /* fp+2344 */ bool x4;
        /* fp+2348 */ float x8;
        /* fp+234C */ float xC;
        /* fp+2350 */ float x10;
        /* fp+2354 */ float x14;
        /* fp+2358 */ Vec3 x18;
        /* fp+2364 */ Vec3 scale;
    } yoshiegg;
    struct {
        /* fp+2340 */ bool x0;
        /* fp+2344 */ M2C_UNK x4;
        /* fp+2348 */ float x8;
        /* fp+234C */ float xC;
        /* fp+2350 */ float x10;
    } capturekoopa;
    struct {
        /* fp+2340 */ Vec2 pos_offset;
        /* fp+2348 */ Vec2 x8;
        /* fp+2350 */ Vec2 x10;
        /* fp+2358 */ bool x18;
        /* fp+235C */ M2C_UNK x1C;
        /* fp+2360 */ M2C_UNK x20;
        /* fp+2364 */ M2C_UNK x24;
        /* fp+2368 */ M2C_UNK x28;
        /* fp+236C */ Vec3 scale;
    } capturekirby;
    struct {
        /* fp+2340 */ ftKb_GObj* thrower_gobj;
        /* fp+2344 */ float x4;
        /* fp+2348 */ float x8;
        /* fp+234C */ float xC;
        /* fp+2350 */ float x10;
        /* fp+2354 */ bool x14;
        union {
            u8 x18;
            struct {
                /* fp+2358:0 */ u8 x18_b0 : 1;
                /* fp+2358:1 */ u8 x18_b1 : 1;
                /* fp+2358:2 */ u8 x18_b2 : 1;
                /* fp+2358:3 */ u8 x18_b3 : 1;
                /* fp+2358:4 */ u8 x18_b4 : 1;
                /* fp+2358:5 */ u8 x18_b5 : 1;
                /* fp+2358:6 */ u8 x18_b6 : 1;
                /* fp+2358:7 */ u8 x18_b7 : 1;
            };
        };
        /* fp+235C */ Vec3 scale;
        /* fp+2368 */ ftCollisionBox coll_box;
    } thrownkirby;
    struct {
        /* fp+2340 */ int x0;
        /* fp+2344 */ ftCollisionBox coll_box;
        /* fp+235C */ float x1C;
        /* fp+2360 */ enum_t x20;
        /* fp+2364 */ Vec3 translate;
    } bury;
    struct {
        /* fp+2340 */ float x0;
    } buryjump;
    struct {
        /* fp+2340 */ int timer;
        /* fp+2344 */ int x4;
        /* fp+2348 */ bool x8;
        /* fp+234C */ int vel_y_exponent;
    } passivewall;
    struct {
        /* fp+2340 */ int x0;
        /* fp+2344 */ float x4;
    } aircatchhit;
    struct {
        /* fp+2340 */ float x0;
    } aircatch;
    struct {
        /* fp+2340 */ Vec3 cur_pos;
        /* fp+234C */ Vec3 self_vel;
        /* fp+2358 */ float facing_dir;
        /* fp+235C */ int x1C;
        /* fp+2360 */ ftCollisionBox ecb;
    } warpstar;
    struct {
        /* fp+2340 */ int x0;
        /* fp+2344 */ int x4;
        /* fp+2344 */ float x8;
    } jumpb;
    struct {
        /* fp+2340 */ int x0;
        /* fp+2344 */ int x4;
        /* fp+2348 */ float x8;
    } hammerkneebend;
    struct {
        /* fp+2340 */ M2C_UNK x0;
        /* fp+2344 */ float x4;
    } hammerlanding;
    struct {
        /* fp+2340 */ Item_GObj* x0;
    } captureleadead;
    struct {
        /* fp+2340 */ bool timer;
    } entry;
    struct {
        /* fp+2340 */ Item_GObj* x0;
    } capturelikelike;
};
#define MELEE_FT_CHARA_FTDONKEY_TYPES_H
struct ftDonkey_FighterVars {
    /* 0x222C */ s32 x222C;
    /* 0x2230 */ s32 x2230;
};
union ftDonkey_MotionVars {
    struct ftDonkey_SpecialNVars {
        s32 x0;
        s32 x4;
        s32 x8;
        s32 xC;
        s32 x10;
        s32 x14;
    } specialn;
    struct ftDonkey_SpecialLwVars {
        s32 x0;
    } speciallw;
    /// @todo Rename to correct state.
    struct ftDonkey_State5Vars {
        bool x0;
        s32 x4;
        float x8;
    } unk5;
    /// @todo Rename to correct state.
    struct ftDonkey_State7Vars {
        s32 x0;
        s32 x4;
        float x8;
    } unk7;
    /// @todo Rename to correct state.
    struct ftDonkey_State8Vars {
        s32 x0;
        float x4;
    } unk8;
};
typedef struct _ftDonkeyAttributes {
    s32 motion_state;
    s32 x4_motion_state;
    //// used by ftDk_HeavyWalk.c (maybe Cargo Hold) ////
    float x8;
    float xC;
    float x10;
    float x14;
    float x18;
    float x1C;
    /////////////////////////////////////////////////
    struct {
        float x20_TURN_SPEED;
        float x24_JUMP_STARTUP_LAG;
        float x28_LANDING_LAG;
    } cargo_hold;
    //// Giant Punch
    struct {
        s32 x2C_MAX_ARM_SWINGS;
        s32 x30_DAMAGE_PER_SWING;
        float x34_PUNCH_HORIZONTAL_VEL;
        float x38_LANDING_LAG;
    } SpecialN;
    //// Headbutt
    struct {
        float x3C_MIN_STICK_X_MOMENTUM;
        float x40_MOMENTUM_TRANSITION_MODIFIER;
        float x44_AERIAL_GRAVITY;
    } SpecialS;
    float x48_UNKNOWN;
    //// Spinning Kong
    struct {
        float x4C_AERIAL_VERTICAL_VELOCITY;
        float x50_AERIAL_GRAVITY;
        float x54_GROUNDED_HORIZONTAL_VELOCITY;
        float x58_AERIAL_HORIZONTAL_VELOCITY;
        float x5C_GROUNDED_MOBILITY;
        float x60_AERIAL_MOBILITY;
        float x64_LANDING_LAG;
    } SpecialHi;
    /// Hand Slap
    struct {
        float x68;
        float x6C;
        float x70;
    } SpecialLw;
} ftDonkeyAttributes;
#define MELEE_FT_CHARA_FTFOX_TYPES_H
#define MELEE_FT_CHARA_FTFOX_FORWARD_H
typedef struct ftFox_DatAttrs ftFox_DatAttrs;
static MotionFlags const ftFx_MF_Appeal =
    Ft_MF_KeepGfx | Ft_MF_SkipModel | Ft_MF_SkipAnimVel | Ft_MF_Unk06;
static MotionFlags const ftFx_MF_Special =
    Ft_MF_SkipModel | Ft_MF_SkipItemVis | Ft_MF_UnkUpdatePhys |
    Ft_MF_FreezeState;
static MotionFlags const ftFx_MF_SpecialN =
    ftFx_MF_Special | Ft_MF_KeepFastFall | Ft_MF_SkipThrowException;
static MotionFlags const ftFx_MF_SpecialS =
    ftFx_MF_Special | Ft_MF_KeepGfx | Ft_MF_KeepSfx;
static MotionFlags const ftFx_MF_SpecialHi =
    ftFx_MF_SpecialS | Ft_MF_KeepFastFall;
static MotionFlags const ftFx_MF_SpecialAirN =
    ftFx_MF_SpecialN | Ft_MF_SkipParasol;
static MotionFlags const ftFx_MF_SpecialAirS =
    ftFx_MF_SpecialS | Ft_MF_SkipParasol;
static MotionFlags const ftFx_MF_SpecialAirHiHold =
    ftFx_MF_SpecialHi | Ft_MF_SkipParasol;
static MotionFlags const ftFx_MF_SpecialLw =
    ftFx_MF_Special | Ft_MF_KeepColAnimHitStatus | Ft_MF_SkipColAnim;
static MotionFlags const ftFx_MF_SpecialAirLw =
    ftFx_MF_SpecialLw | Ft_MF_SkipParasol;
static MotionFlags const ftFx_MF_SpecialNLoop = ftFx_MF_SpecialN | Ft_MF_Unk19;
static MotionFlags const ftFx_MF_SpecialAirNLoop =
    ftFx_MF_SpecialNLoop | Ft_MF_SkipParasol;
static MotionFlags const ftFx_MF_SpecialLwLoop =
    ftFx_MF_SpecialLw | Ft_MF_Unk19;
static MotionFlags const ftFx_MF_SpecialAirLwLoop =
    ftFx_MF_SpecialLwLoop | Ft_MF_SkipParasol;
typedef enum ftFox_MotionState {
    ftFx_MS_SpecialNStart = ftCo_MS_Count,
    ftFx_MS_SpecialNLoop,
    ftFx_MS_SpecialNEnd,
    ftFx_MS_SpecialAirNStart,
    ftFx_MS_SpecialAirNLoop,
    ftFx_MS_SpecialAirNEnd,
    ftFx_MS_SpecialSStart,
    ftFx_MS_SpecialS,
    ftFx_MS_SpecialSEnd,
    ftFx_MS_SpecialAirSStart,
    ftFx_MS_SpecialAirS,
    ftFx_MS_SpecialAirSEnd,
    ftFx_MS_SpecialHiHold,
    ftFx_MS_SpecialHiHoldAir,
    ftFx_MS_SpecialHi,
    ftFx_MS_SpecialAirHi,
    ftFx_MS_SpecialHiLanding,
    ftFx_MS_SpecialHiFall,
    ftFx_MS_SpecialHiBound,
    ftFx_MS_SpecialLwStart,
    ftFx_MS_SpecialLwLoop,
    ftFx_MS_SpecialLwHit,
    ftFx_MS_SpecialLwEnd,
    ftFx_MS_SpecialLwTurn,
    ftFx_MS_SpecialAirLwStart,
    ftFx_MS_SpecialAirLwLoop,
    ftFx_MS_SpecialAirLwHit,
    ftFx_MS_SpecialAirLwEnd,
    ftFx_MS_SpecialAirLwTurn,
    ftFx_MS_AppealSStartR,
    ftFx_MS_AppealSStartL,
    ftFx_MS_AppealSR,
    ftFx_MS_AppealSL,
    ftFx_MS_AppealSEndR,
    ftFx_MS_AppealSEndL,
    ftFx_MS_Count,
    ftFx_MS_SelfCount = ftFx_MS_Count - ftCo_MS_Count,
} ftFox_MotionState;
typedef enum ftFx_SpecialNIndex {
    // msid = currASID - ftFx_MS_SpecialNStart;
    ftFx_SpecialNIndex_Start,
    ftFx_SpecialNIndex_Loop,
    ftFx_SpecialNIndex_End,
    ftFx_SpecialNIndex_AirStart,
    ftFx_SpecialNIndex_AirLoop,
    ftFx_SpecialNIndex_AirEnd,
    // msid = currASID - ftCo_MS_CatchDash;
    ftFx_SpecialNIndex_ThrowB,
    ftFx_SpecialNIndex_ThrowHi,
    ftFx_SpecialNIndex_ThrowLw,
    //ftFx_SpecialNIndex_None,
} ftFx_SpecialNIndex;
typedef enum ftFx_Submotion {
    ftFx_SM_SpecialNStart = ftCo_SM_Count,
    ftFx_SM_SpecialNLoop,
    ftFx_SM_SpecialNEnd,
    ftFx_SM_SpecialAirNStart,
    ftFx_SM_SpecialAirNLoop,
    ftFx_SM_SpecialAirNEnd,
    ftFx_SM_SpecialSStart,
    ftFx_SM_SpecialS,
    ftFx_SM_SpecialSEnd,
    ftFx_SM_SpecialAirSStart,
    ftFx_SM_SpecialAirS,
    ftFx_SM_SpecialAirSEnd,
    ftFx_SM_SpecialHiHold,
    ftFx_SM_SpecialHiHoldAir,
    ftFx_SM_SpecialHi,
    ftFx_SM_SpecialHiLanding,
    ftFx_SM_SpecialHiFall,
    ftFx_SM_SpecialHiBound,
    ftFx_SM_SpecialLwStart,
    ftFx_SM_SpecialLwLoop,
    ftFx_SM_SpecialLwHit,
    ftFx_SM_SpecialLwEnd,
    ftFx_SM_SpecialAirLwStart,
    ftFx_SM_SpecialAirLwLoop,
    ftFx_SM_SpecialAirLwHit,
    ftFx_SM_SpecialAirLwEnd,
    ftFx_SM_AppealSStartR,
    ftFx_SM_AppealSStartL,
    ftFx_SM_AppealSR,
    ftFx_SM_AppealSL,
    ftFx_SM_AppealSEndR,
    ftFx_SM_AppealSEndL,
    ftFx_SM_Count,
    ftFx_SM_SelfCount = ftFx_SM_Count - ftCo_SM_Count,
} ftFx_Submotion;
#define MELEE_LB_TYPES_H
#define MELEE_LB_FORWARD_H
typedef struct AbsorbDesc AbsorbDesc;
typedef struct CollData CollData;
typedef struct HitCapsule HitCapsule;
typedef struct HitResult HitResult;
typedef struct HitVictim HitVictim;
typedef struct HurtCapsule HurtCapsule;
typedef struct lb_UnkAnimStruct lb_UnkAnimStruct;
typedef struct lbRefract_CallbackData lbRefract_CallbackData;
typedef struct ReflectDesc ReflectDesc;
typedef struct ShieldDesc ShieldDesc;
typedef enum HurtCapsuleState {
    HurtCapsule_Enabled,
    HurtCapsule_Disabled,
    Intangible
} HurtCapsuleState;
typedef enum HitElement {
    HitElement_Normal,
    HitElement_Fire,
    HitElement_Electric,
    HitElement_Slash,
    HitElement_Coin,
    HitElement_Ice,
    /// Sleep for 103 frames
    HitElement_Nap,
    /// Sleep for 412 frames
    HitElement_Sleep,
    HitElement_Catch,
    HitElement_Ground,
    HitElement_Cape,
    HitElement_Inert,
    HitElement_Disable,
    HitElement_Dark,
    /// Screw Attack
    HitElement_Scball,
    HitElement_Lipstick,
    /// Formerly presumed empty, this hitbox element is used by
    ///  ReDead grab attacks
    HitElement_Leadead,
} HitElement;
typedef enum HitCapsuleState {
    HitCapsule_Disabled,
    HitCapsule_Enabled,
    HitCapsule_Unk2,
    HitCapsule_Unk3,
    HitCapsule_Max = HitCapsule_Unk3,
} HitCapsuleState;
struct { int x[1 - 2 * !(HitCapsule_Max == 3)]; };;
typedef void (*RefractCallbackTypeA)(struct lbRefract_CallbackData*, s32, u32,
                                     s8, s8);
typedef void (*RefractCallbackTypeB)(struct lbRefract_CallbackData*, s32, u32,
                                     s8, s8, s8, s8);
typedef void (*RefractCallbackTypeC)(struct lbRefract_CallbackData*, s32, u32,
                                     s32*, s32*, s32*, s32*);
struct lb_UnkAnimStruct {
    M2C_UNK x0_data;
    size_t x4_size;
};
struct HitResult {
    HSD_JObj* bone;
    /// Follows attach bone position if toggled OFF
    u8 skip_update_pos : 1;
    Vec3 pos;
    Vec3 offset;
    float size;
};
struct HitVictim {
    M2C_UNK victim;
    uint x4;
};
struct HitCapsule {
    /*  +0 */ HitCapsuleState state;
    /*  +4 */ uint x4;
    /*  +8 */ int unk_count;
    /*  +C */ float damage;
    /* +10 */ Vec3 b_offset;
    /* +1C */ float scale;
    /* +20 */ int kb_angle;
    /* +24 */ int x24;
    /* +28 */ int x28;
    /* +2C */ int x2C;
    /* +30 */ uint element;
    /* +34 */ int x34;
    /* +38 */ int sfx_severity;
    /* +3C */ enum_t sfx_kind;
    /* +40 */ u8 x40_b0 : 1;
    /* +40 */ u8 x40_b1 : 1;
    /* +40 */ u8 x40_b2 : 1;
    /* +40 */ u8 x40_b3 : 1;
    /* +40 */ u8 x40_b4 : 1;
    /* +40 */ u8 x40_b5 : 1;
    /* +40 */ u8 x40_b6 : 1;
    /* +40 */ u8 x40_b7 : 1;
    /* +41:0 */ u8 x41_b0 : 1;
    /* +41:1 */ u8 x41_b1 : 1;
    /* +41:2 */ u8 x41_b2 : 1;
    /* +41:3 */ u8 x41_b3 : 1;
    /* +41:4 */ u8 x41_b4 : 1;
    /* +41:5 */ u8 x41_b5 : 1;
    /* +41:6 */ u8 x41_b6 : 1;
    /* +41:7 */ u8 x41_b7 : 1;
    /* +42:0 */ u8 x42_b0 : 1;
    /* +42:1 */ u8 x42_b1 : 1;
    /* +42:2 */ u8 x42_b2 : 1;
    /* +42:3 */ u8 x42_b3 : 1;
    /* +42:4 */ u8 x42_b4 : 1;
    /* +42:5 */ u8 x42_b5 : 1;
    /* +42:6 */ u8 x42_b6 : 1;
    /* +42:7 */ u8 x42_b7 : 1;
    /* +43 */ union {
        /* +43 */ u8 x43;
        struct {
            /* +43:0 */ u8 x43_b0 : 1;
            /* +43:1 */ u8 x43_b1 : 1;
            /* +43:2 */ u8 x43_b2 : 1;
            /* +43:3 */ u8 x43_b3 : 1;
            /* +43:4 */ u8 x43_b4 : 1;
            /* +43:5 */ u8 x43_b5 : 1;
            /* +43:6 */ u8 x43_b6 : 1;
            /* +43:7 */ u8 x43_b7 : 1;
        };
    };
    /* +44 */ u8 x44;
    /* +45 */ u8 x45;
    /* +46 */ u8 x46[0x48 - 0x46];
    /* +48 */ HSD_JObj* jobj;
    /* +4C */ Vec3 x4C;
    /* +58 */ Vec3 x58;
    /* +64 */ Vec3 hurt_coll_pos;
    /* +70 */ float coll_distance;
    /* +74 */ HitVictim victims_1[12];
    /* +D4 */ HitVictim victims_2[12];
    /* +134 */ union {
        HSD_GObj* owner;
        u8 hit_grabbed_victim_only : 1;
    };
};
struct { int x[1 - 2 * !(sizeof(HitCapsule) == 0x138)]; };;
struct HurtCapsule {
    HurtCapsuleState state;
    Vec3 a_offset;
    Vec3 b_offset;
    float scale;
    HSD_JObj* bone; // 0x20
    u8 skip_update_pos : 1;
    u8 x24_b1 : 1; // 0x24 0x40
    u8 x24_b2 : 1; // 0x24 0x20
    u8 x24_b3 : 1; // 0x24 0x10
    u8 x24_b4 : 1; // 0x24 0x08
    u8 x24_b5 : 1; // 0x24 0x04
    u8 x24_b6 : 1; // 0x24 0x02
    u8 x24_b7 : 1; // 0x24 0x01
    Vec3 a_pos;
    Vec3 b_pos;
    int bone_idx; // 0x40
    enum_t kind; // 0x44. 0 = low, 1 = mid, 2 = high
    bool is_grabbable; // 0x48
};
struct { int x[1 - 2 * !(sizeof(HurtCapsule) == 0x4C)]; };;
struct ReflectDesc {
    u32 x0_bone_id;
    s32 x4_max_damage;
    Vec3 x8_offset;
    float x14_size;
    float x18_damage_mul;
    float x1C_speed_mul;
    /// @remarks Setting this to 1 causes the reflector to skip ownership
    /// change
    u8 x20_behavior;
};
struct AbsorbDesc {
    /*  +0 */ int x0_bone_id;
    /*  +4 */ Vec3 x4_offset;
    /* +10 */ float x10_size;
};
struct ShieldDesc {
    int bone;
    Vec3 pos;
    float radius;
    float dmg_mul;
    float vel_mul;
    u8 flags : 8;
};
struct lbRefract_CallbackData {
    s32 unk0; // x00
    s32 unk1; // x04
    s32 unk2; // x08
    s32 unk3; // x08
    s32 unk4; // x10
    s32 unk5; // x14
    void* callback0; // x1C
    void* callback1; // x20
};
typedef struct _ECBFlagStruct {
    union {
        struct {
            u8 b0 : 1;
            u8 b1234 : 4;
            u8 b5 : 1;
            u8 b6 : 1;
            u8 b7 : 1;
        } bits;
        u8 raw;
    };
} ECBFlagStruct;
typedef struct SurfaceData {
    int index;
    u32 unk;
    Vec3 normal;
} SurfaceData;
typedef struct _ftECB {
    Vec2 top;
    Vec2 bottom;
    Vec2 right;
    Vec2 left;
} ftECB;
struct CollData {
    /* fp+6F0 */ HSD_GObj* x0_gobj;
    /* fp+6F4 */ Vec3 cur_topn;
    /* fp+700 */ Vec3 cur_topn_correct;
    /* fp+70C */ Vec3 prev_topn;
    /* fp+718 */ Vec3 x28_vec;
    /* fp+724 */ ECBFlagStruct x34_flags;
    /* fp+725 */ ECBFlagStruct x35_flags;
    /* fp+726 */ s16 x36;
    /* fp+728 */ s32 x38;
    /* fp+72C */ s32 x3C;
    /* fp+730 */ int ledge_id_unk0;
    /* fp+734 */ int ledge_id_unk1;
    /* fp+738 */ u32 x48;
    /* fp+73C */ u32 x4C;
    /* fp+740 */ float x50;
    /* fp+744 */ float x54;
    /* fp+748 */ float x58;
    /* fp+74C */ float x5C;
    /* fp+750 */ s32 x60;
    /* fp+754 */ ftECB x64_ecb;
    /* fp+774 */ ftECB x84_ecb;
    /* fp+794 */ ftECB xA4_ecbCurrCorrect;
    /* fp+7B4 */ ftECB xC4_ecb;
    /* fp+7D4 */ ftECB xE4_ecb;
    /// @todo this is the start of a substruct with size 0x2C
    /* fp+7F4 */ s32 x104;
    /* fp+7F8 */ union {
        /* fp+7F8 */ struct {
            /* fp+7F8 */ HSD_JObj* x108_joint;
            /* fp+7FC */ HSD_JObj* x10C_joint[6];
        };
        /* fp+7F8 */ struct {
            /* fp+7F8 */ float x108_f32;
            /* fp+7FC */ float x10C_f32;
            /* fp+800 */ float x110_f32;
            /* fp+804 */ float x114_f32;
            /* fp+808 */ float x118_f32;
            /* fp+80C */ float x11C_f32;
            /* fp+810 */ float x120_f32;
        };
    };
    /* fp+814 */ float x124;
    /* fp+818 */ float x128;
    /* fp+81C */ float x12C;
    /* fp+820 */ u32 x130_flags;
    /* fp+824 */ s32 env_flags;
    /* fp+828 */ s32 prev_env_flags;
    /* fp+82C */ s32 x13C;
    /* fp+830 */ Vec3 x140;
    /* fp+83C */ SurfaceData floor;
    /* fp+850 */ SurfaceData right_wall;
    /* fp+864 */ SurfaceData left_wall;
    /* fp+878 */ SurfaceData ceiling;
};
struct ftFox_FighterVars {
    /* 0x222C */ HSD_GObj* x222C_blasterGObj;
};
typedef struct ftFoxSpecialN {
    /// 0x2340 - Check to allow repeated blaster shots
    bool isBlasterLoop;
} ftFoxSpecialN;
typedef struct ftFoxSpecialS {
    /// 0x2340 - Number of frames to pass before gravity takes effect
    s32 gravityDelay;
    /// 0x2344 through 0x2370 - Related to Illusion/Phantasm model's position?
    Vec3 ghostEffectPos[4];
    /// 0x2374 through 0x2380 - ColAnim blend frames?
    float blendFrames[4];
    /// 0x2384 - Illusion/Phantasm GObj pointer
    HSD_GObj* ghostGObj;
} ftFoxSpecialS;
typedef struct ftFoxSpecialHi {
    /// 0x2340 - Number of frames to pass before gravity takes effect
    s32 gravityDelay;
    /// 0x2344 - Used to rotate Fox/Falco's model?
    float rotateModel;
    /// 0x2348 - Number of frames Firefox/Firebird's launch animation lasts for
    s32 travelFrames;
    /// 0x234C - ???
    s32 unk;
    /// 0x2350 - ???
    s32 unk2;
} ftFoxSpecialHi;
typedef struct ftFoxSpecialLw {
    /// 0x2340 - Auto lag frames after initializing Reflector if B is not being
    /// held. Reflector is immediately released with no lag once these frames
    /// have passed
    s32 releaseLag;
    /// 0x2344 - Number of frames it takes Fox/Falco to turn around on command
    s32 turnFrames;
    /// 0x2348 - Check if Fox/Falco is no longer holding B
    bool isRelease;
    /// 0x234C - Number of frames to pass before gravity takes effect
    s32 gravityDelay;
} ftFoxSpecialLw;
typedef struct ftFoxAppealS {
    /// 0x2340 - Fox/Falco's facing direction as a boolean variable, used to
    /// load indexed ASIDs from the AppealS struct
    bool facingDir;
    /// 0x2344 - Incremented every time one of the three stages of the AppealS
    /// animation is completed
    s32 animCount;
} ftFoxAppealS;
typedef union ftFox_MotionVars {
    ftFoxSpecialN SpecialN;
    ftFoxSpecialS SpecialS;
    ftFoxSpecialHi SpecialHi;
    ftFoxSpecialLw SpecialLw;
    ftFoxAppealS AppealS;
} ftFox_MotionVars;
struct ftFox_DatAttrs {
    // NEUTRAL SPECIAL - BLASTER
    float x0_FOX_BLASTER_UNK1;
    float x4_FOX_BLASTER_UNK2;
    float x8_FOX_BLASTER_UNK3;
    float xC_FOX_BLASTER_UNK4;
    /// Angle at which Blaster shots are fired
    float x10_FOX_BLASTER_ANGLE;
    /// Velocity at which Blaster shots are fired
    float x14_FOX_BLASTER_VEL;
    float x18_FOX_BLASTER_LANDING_LAG;
    ItemKind x1C_FOX_BLASTER_SHOT_ITKIND;
    ItemKind x20_FOX_BLASTER_GUN_ITKIND;
    // SIDE SPECIAL - FOX ILLUSION / FALCO PHANTASM
    float x24_FOX_ILLUSION_GRAVITY_DELAY; // Frames required to pass before
                                          // gravity is applied
    float x28_FOX_ILLUSION_GROUND_VEL_X; // Horizontal velocity?
    float x2C_FOX_ILLUSION_UNK1;
    float x30_FOX_ILLUSION_UNK2;
    float x34_FOX_ILLUSION_GROUND_END_VEL_X;
    float x38_FOX_ILLUSION_GROUND_FRICTION;
    float x3C_FOX_ILLUSION_AIR_END_VEL_X;
    float x40_FOX_ILLUSION_AIR_MUL_X;
    float x44_FOX_ILLUSION_FALL_ACCEL;
    float x48_FOX_ILLUSION_TERMINAL_VELOCITY;
    float x4C_FOX_ILLUSION_FREEFALL_MOBILITY;
    float x50_FOX_ILLUSION_LANDING_LAG;
    // UP SPECIAL - FIREFOX / FIREBIRD
    float x54_FOX_FIREFOX_GRAVITY_DELAY;
    float x58_FOX_FIREFOX_VEL_X; // Initial velocity
    float x5C_FOX_FIREFOX_AIR_MOMENTUM_PRESERVE_X;
    float x60_FOX_FIREFOX_FALL_ACCEL;
    float x64_FOX_FIREFOX_DIRECTION_STICK_RANGE_MIN; // Minimum control stick
                                                     // range required for
                                                     // direction change
    float
        x68_FOX_FIREFOX_DURATION; // Amount of frames Firefox/Firebird travels
    s32 x6C_FOX_FIREFOX_BOUNCE_VAR;
    float x70_FOX_FIREFOX_DURATION_END;
    float x74_FOX_FIREFOX_SPEED;
    float x78_FOX_FIREFOX_REVERSE_ACCEL; // ???
    float x7C_FOX_FIREFOX_GROUND_MOMENTUM_END;
    float x80_FOX_FIREFOX_UNK2;
    float x84_FOX_FIREFOX_BOUND_VEL_X; // Horizontal velocity of SpecialHiBound
                                       // action state
    float
        x88_FOX_FIREFOX_FACING_STICK_RANGE_MIN; // Minimum control stick range
                                                // required to change
                                                // character's facing direction
    float x8C_FOX_FIREFOX_FREEFALL_MOBILITY;
    float x90_FOX_FIREFOX_LANDING_LAG;
    float x94_FOX_FIREFOX_BOUND_ANGLE;
    // DOWN SPECIAL - REFLECTOR
    /**
     * Auto lag frames after initializing Reflector if B is not being held.
     * Reflector is immediately released with no lag once these frames have
     * passed.
     */
    float x98_FOX_REFLECTOR_RELEASE_LAG;
    /// Amount of turn frames for changing Reflector direction
    float x9C_FOX_REFLECTOR_TURN_FRAMES;
    float xA0_FOX_REFLECTOR_UNK1;
    s32 xA4_FOX_REFLECTOR_GRAVITY_DELAY;
    float xA8_FOX_REFLECTOR_MOMENTUM_PRESERVE_X;
    float xAC_FOX_REFLECTOR_FALL_ACCEL;
    ReflectDesc xB0_FOX_REFLECTOR_REFLECTION;
};
#define MELEE_FT_CHARA_FTGAMEWATCH_TYPES_H
#define MELEE_FT_CHARA_FTGAMEWATCH_FORWARD_H
static MotionFlags const ftGw_MF_Base = Ft_MF_SkipItemVis | Ft_MF_FreezeState;
static MotionFlags const ftGw_MF_Landing = Ft_MF_KeepColAnimHitStatus |
                                           Ft_MF_SkipHit | Ft_MF_KeepSfx |
                                           Ft_MF_SkipParasol;
static MotionFlags const ftGw_MF_LandingAirB = ftGw_MF_Landing | Ft_MF_KeepGfx;
static MotionFlags const ftGw_MF_LandingAirHi =
    ftGw_MF_LandingAirB | Ft_MF_KeepFastFall;
static MotionFlags const ftGw_MF_Attack = ftGw_MF_Base | Ft_MF_KeepSfx;
static MotionFlags const ftGw_MF_AttackLw3 = ftGw_MF_Attack | Ft_MF_SkipHit;
static MotionFlags const ftGw_MF_AttackAirN = ftGw_MF_Attack | ftGw_MF_Landing;
static MotionFlags const ftGw_MF_AttackAirB =
    ftGw_MF_AttackAirN | Ft_MF_KeepGfx;
static MotionFlags const ftGw_MF_AttackAirHi =
    ftGw_MF_AttackAirB | Ft_MF_KeepFastFall;
static MotionFlags const ftGw_MF_AttackS4 =
    ftGw_MF_AttackLw3 | Ft_MF_KeepFastFall | Ft_MF_SkipRumble;
static MotionFlags const ftGw_MF_Attack11 =
    ftGw_MF_Attack | Ft_MF_KeepFastFall | Ft_MF_Unk19;
static MotionFlags const ftGw_MF_Attack100 =
    ftGw_MF_Attack | Ft_MF_KeepColAnimHitStatus | Ft_MF_Unk19;
static MotionFlags const ftGw_MF_Special =
    ftGw_MF_Base | Ft_MF_SkipModel | Ft_MF_UnkUpdatePhys;
static MotionFlags const ftGw_MF_SpecialS = ftGw_MF_Special | Ft_MF_KeepGfx;
static MotionFlags const ftGw_MF_SpecialHi =
    ftGw_MF_Special | Ft_MF_KeepFastFall | Ft_MF_KeepGfx;
static MotionFlags const ftGw_MF_SpecialLwCatch =
    ftGw_MF_Special | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftGw_MF_SpecialN =
    ftGw_MF_Special | Ft_MF_KeepFastFall | Ft_MF_SkipThrowException;
static MotionFlags const ftGw_MF_SpecialAirS =
    ftGw_MF_SpecialS | Ft_MF_SkipParasol;
static MotionFlags const ftGw_MF_SpecialAirHi =
    ftGw_MF_SpecialHi | Ft_MF_SkipParasol;
static MotionFlags const ftGw_MF_SpecialAirLwCatch =
    ftGw_MF_SpecialLwCatch | Ft_MF_SkipParasol;
static MotionFlags const ftGw_MF_SpecialAirN =
    ftGw_MF_SpecialN | Ft_MF_SkipParasol;
static MotionFlags const ftGw_MF_SpecialLw =
    ftGw_MF_SpecialLwCatch | Ft_MF_Unk19;
static MotionFlags const ftGw_MF_SpecialAirLw =
    ftGw_MF_SpecialLw | Ft_MF_SkipParasol;
// Mr. Game & Watch Motion State IDs
typedef enum ftGameWatch_MotionState {
    ftGw_MS_Attack11 = ftCo_MS_Count,
    ftGw_MS_Attack100Start,
    ftGw_MS_Attack100Loop,
    ftGw_MS_Attack100End,
    ftGw_MS_AttackLw3,
    ftGw_MS_AttackS4,
    ftGw_MS_AttackAirN,
    ftGw_MS_AttackAirB,
    ftGw_MS_AttackAirHi,
    ftGw_MS_LandingAirN,
    ftGw_MS_LandingAirB,
    ftGw_MS_LandingAirHi,
    ftGw_MS_SpecialN,
    ftGw_MS_SpecialAirN,
    ftGw_MS_SpecialS1,
    ftGw_MS_SpecialS2,
    ftGw_MS_SpecialS3,
    ftGw_MS_SpecialS4,
    ftGw_MS_SpecialS5,
    ftGw_MS_SpecialS6,
    ftGw_MS_SpecialS7,
    ftGw_MS_SpecialS8,
    ftGw_MS_SpecialS9,
    ftGw_MS_SpecialAirS1,
    ftGw_MS_SpecialAirS2,
    ftGw_MS_SpecialAirS3,
    ftGw_MS_SpecialAirS4,
    ftGw_MS_SpecialAirS5,
    ftGw_MS_SpecialAirS6,
    ftGw_MS_SpecialAirS7,
    ftGw_MS_SpecialAirS8,
    ftGw_MS_SpecialAirS9,
    ftGw_MS_SpecialHi,
    ftGw_MS_SpecialAirHi,
    ftGw_MS_SpecialLw,
    ftGw_MS_SpecialLwCatch,
    ftGw_MS_SpecialLwShoot,
    ftGw_MS_SpecialAirLw,
    ftGw_MS_SpecialAirLwCatch,
    ftGw_MS_SpecialAirLwShoot,
    ftGw_MS_Count,
    ftGw_MS_SelfCount = ftGw_MS_Count - ftCo_MS_Count,
} ftGameWatch_MotionState;
typedef enum ftGw_Submotion {
    ftGw_SM_SpecialN = ftCo_SM_Count,
    ftGw_SM_SpecialAirN,
    ftGw_SM_SpecialS1,
    ftGw_SM_SpecialS2,
    ftGw_SM_SpecialS3,
    ftGw_SM_SpecialS4,
    ftGw_SM_SpecialS5,
    ftGw_SM_SpecialS6,
    ftGw_SM_SpecialS7,
    ftGw_SM_SpecialS8,
    ftGw_SM_SpecialS9,
    ftGw_SM_SpecialAirS1,
    ftGw_SM_SpecialAirS2,
    ftGw_SM_SpecialAirS3,
    ftGw_SM_SpecialAirS4,
    ftGw_SM_SpecialAirS5,
    ftGw_SM_SpecialAirS6,
    ftGw_SM_SpecialAirS7,
    ftGw_SM_SpecialAirS8,
    ftGw_SM_SpecialAirS9,
    ftGw_SM_SpecialHi,
    ftGw_SM_SpecialAirHi,
    ftGw_SM_SpecialLw,
    ftGw_SM_SpecialLwCatch,
    ftGw_SM_SpecialLwShoot,
    ftGw_SM_SpecialAirLw,
    ftGw_SM_SpecialAirLwCatch,
    ftGw_SM_SpecialAirLwShoot,
    ftGw_SM_Count,
    ftGw_SM_SelfCount = ftGw_SM_Count - ftCo_SM_Count,
} ftGw_Submotion;
typedef enum ftGameWatch_PanicLevel {
    ftGw_Panic_Empty,
    ftGw_Panic_Low,
    ftGw_Panic_Mid,
    ftGw_Panic_Full,
} ftGameWatch_PanicLevel;
struct ftGameWatch_FighterVars {
    /* 0x222C */ s32 x222C_judgeVar1;
    /* 0x2230 */ s32 x2230_judgeVar2;
    /* 0x2234 */ u32 x2234;
    /* 0x2238 */ s32 x2238_panicCharge;
    /* 0x223C */ s32 x223C_panicDamage;
    /* 0x2240 */ s32 x2240_chefVar1;
    /* 0x2244 */ s32 x2244_chefVar2;
    /* 0x2248 */ HSD_GObj* x2248_manholeGObj;
    /* 0x224C */ HSD_GObj* x224C_greenhouseGObj;
    /* 0x2250 */ HSD_GObj* x2250_manholeGObj2;
    /* 0x2254 */ HSD_GObj* x2254_fireGObj;
    /* 0x2258 */ HSD_GObj* x2258_parachuteGObj;
    /* 0x225C */ HSD_GObj* x225C_turtleGObj;
    /* 0x2260 */ HSD_GObj* x2260_sparkyGObj;
    /* 0x2264 */ HSD_GObj* x2264_judgementGObj;
    /* 0x2268 */ HSD_GObj* x2268_panicGObj;
    /* 0x226C */ HSD_GObj* x226C_rescueGObj;
};
typedef struct ftGameWatchChef {
    int sausageCount[6];
} ftGameWatchChef;
typedef struct ftGameWatchJudge {
    s32 rollVar[9];
} ftGameWatchJudge;
typedef struct _ftGameWatchAttributes {
    /// MISC. ATTRIBUTES
    /// Mr. Game & Watch's Z-Axis stretch; 0.01 by default
    float x0_GAMEWATCH_WIDTH;
    /// Array of four GXColor values, one for each Mr. Game & Watch costume
    /// color
    GXColor x4_GAMEWATCH_COLOR[4];
    /// Outline color of Mr. Game & Watch's model
    GXColor x14_GAMEWATCH_OUTLINE;
    /// NEUTRAL SPECIAL - CHEF
    /// Allow rapid-firing sausages from this frame onward
    float x18_GAMEWATCH_CHEF_LOOPFRAME;
    /// Maximum amount of sausages created per Chef use
    float x1C_GAMEWATCH_CHEF_MAX;
    /// SIDE SPECIAL - JUDGEMENT
    /// Horizontal momentum preservation value
    float x20_GAMEWATCH_JUDGE_MOMENTUM_PRESERVE;
    /// Multiplies momentum preservation value
    float x24_GAMEWATCH_JUDGE_MOMENTUM_MUL;
    float x28_GAMEWATCH_JUDGE_VEL_Y;
    float x2C_GAMEWATCH_JUDGE_FRICTION1;
    float x30_GAMEWATCH_JUDGE_FRICTION2;
    /// Array of BOOLs that toggle respective Judgement numbers ON/OFF. If a
    /// number is OFF, it is excluded from RNG rolls. Game panics if less than
    /// 2 numbers are ON.
    s32 x34_GAMEWATCH_JUDGE_ROLL[9];
    /// UP SPECIAL - FIRE RESCUE
    /// Minimum control stick range required for directional influence? Also
    /// affects how far Mr. Game & Watch flings horizontally (?)
    float x58_GAMEWATCH_RESCUE_STICK_RANGE;
    /// Radians -- controls how far Mr. Game & Watch can angle Fire Rescue?
    float x5C_GAMEWATCH_RESCUE_ANGLE_UNK;
    /// Landing lag / Freefall toggle
    float x60_GAMEWATCH_RESCUE_LANDING;
    /// DOWN SPECIAL - OIL PANIC
    /// Horizontal momentum preservation value
    float x64_GAMEWATCH_PANIC_MOMENTUM_PRESERVE;
    /// Multiplies momentum preservation value
    float x68_GAMEWATCH_PANIC_MOMENTUM_MUL;
    /// Falling acceleration
    float x6C_GAMEWATCH_PANIC_FALL_ACCEL;
    /// Terminal Y velocity?
    float x70_GAMEWATCH_PANIC_VEL_Y_MAX;
    /// Extra damage added to Oil Panic after formula
    float x74_GAMEWATCH_PANIC_DAMAGE_ADD;
    /// Damage multiplier
    float x78_GAMEWATCH_PANIC_DAMAGE_MUL;
    float x7C_GAMEWATCH_PANIC_TURN_FRAMES;
    /// Oil Panic absorption attributes
    AbsorbDesc x80_GAMEWATCH_PANIC_ABSORPTION;
} ftGameWatchAttributes;
typedef union ftGameWatch_MotionVars {
    struct ftGameWatch_Attack11Vars {
        /// 0x2340 - Set to 0 but never used?
        bool unk;
    } Attack11;
    struct ftGameWatch_SpecialNVars {
        /// 0x2340
        bool isChefLoopDisable;
        /// 0x2344 - Maximum number of sausages able to be spawned per Chef use
        s32 maxSausage;
    } SpecialN;
    struct ftGameWatch_SpecialLwVars {
        /// 0x2340 - bool to check if Mr. Game & Watch is no longer holding B
        bool isRelease;
        /// 0x2344 - Number of frames it takes Mr. Game & Watch to turn around
        /// on command
        s32 turnFrames;
    } SpecialLw;
} ftGameWatch_MotionVars;
#define MELEE_FT_CHARA_FTKIRBY_TYPES_H
struct ftKb_FighterVars {
    /* fp+222C */ struct ftKb_Hat {
        /* fp+222C */ M2C_UNK x0;
        /* fp+2230 */ uint x4;
        /* fp+2234:0 */ u8 x8_b0 : 1;
        /* fp+2235 */ u8 x9[3];
        /* fp+2238 */ FighterKind kind;
        /* fp+223C */ HSD_JObj* jobj;
        /* fp+2240 */ u32 x14;
        /* fp+2244 */ M2C_UNK unk_hsd_obj;
        /* fp+2248 */ M2C_UNK x1C;
        /* fp+224C */ M2C_UNK x20;
        /* fp+2250 */ M2C_UNK x24;
    } hat;
    /* fp+224C */ u8 _28[0x60 - 0x28];
    /* fp+228C */ M2C_UNK x60;
    /* fp+2290 */ M2C_UNK x64;
    /* fp+2294 */ u8 _68[0x7C - 0x68];
    /* fp+22A8 */ Item_GObj* ns_flash_gobj;
    /* fp+2294 */ u8 x80[0x9C - 0x80];
    /* fp+22C8 */ int x9C;
    /* fp+22CC */ M2C_UNK xA0;
    /* fp+22D0 */ M2C_UNK xA4;
    /* fp+22D4 */ int xA8;
    /* fp+22D8 */ M2C_UNK xAC;
    /* fp+22DC */ M2C_UNK xB0;
    /* fp+22E0 */ int xB4;
    /* fp+22E4 */ M2C_UNK xB8;
    /* fp+22E8 */ int xBC;
    /* fp+22EC */ M2C_UNK xC0;
    /* fp+22F0 */ M2C_UNK xC4;
    /* fp+22F4 */ M2C_UNK xC8;
    /* fp+22F8 */ bool xCC;
    /* fp+22FC */ Item_GObj* xD0;
    /* fp+2300 */ M2C_UNK xD4;
    /* fp+2304 */ M2C_UNK xD8;
    /* fp+2308 */ M2C_UNK xDC;
    /* fp+230C */ int xE0;
    /* fp+2310 */ short xE4;
    /* fp+2314 */ float xE8;
    /* fp+2318 */ float xEC;
    /* fp+231C */ float xF0;
    /* fp+2320:0 */ u8 xF4_b0 : 1;
};
struct { int x[1 - 2 * !(sizeof(struct ftKb_FighterVars) == 0xF8)]; };;
struct ftKb_SpecialNMs_DatAttrs {
    /* da+35C */ u32 charge_iterations;
    /* da+360 */ u32 base_damage;
    /* da+364 */ u32 additional_damage_per_iteration;
    /* da+368 */ float air_horizontal_momentum_preservation;
    /* da+36C */ float air_horizontal_deceleration_rate;
};
struct { int x[1 - 2 * !(sizeof(struct ftKb_SpecialNMs_DatAttrs) == 0x14)]; };;
/// @todo Every hat is its own struct.
struct ftKb_DatAttrs {
    // Midair Jumps
    /*   +0 */ u32 jumpaerial_turn_duration;
    /*   +4 */ float jumpaerial_horizontal_momentum_backwards;
    /*   +8 */ float jumpaerial_horizontal_momentum_forwards;
    /*   +C */ float jumpaerial_momentum_from_turning;
    /*  +10 */ float jumpaerial_horizontal_momentum;
    /*  +14 */ float jumpaerial_jump1_vertical_momentum;
    /*  +18 */ float jumpaerial_jump2_vertical_momentum;
    /*  +1C */ float jumpaerial_jump3_vertical_momentum;
    /*  +20 */ float jumpaerial_jump4_vertical_momentum;
    /*  +24 */ float jumpaerial_jump5_vertical_momentum;
    /*  +28 */ u32 jumpaerial_number_of_jumps;
    /*  +2C */ u32 jumpaerial_first_jump_action_state;
    /*  +30 */ u32 jumpaerial_final_jump_action_state;
    /*  +34 */ s16 jumpaerial_unk;
    // Neutral B (no hat)
    /*  +38 */ float specialn_x_offset_inhaled;
    /*  +3C */ float specialn_y_offset_inhaled;
    /*  +40 */ float specialn_z_offset_inhaled;
    /*  +44 */ float specialn_gravity_of_inhaled;
    /*  +48 */ float specialn_velocity_outer_grab_box;
    /*  +4C */ float specialn_velocity_inner_grab_box;
    /*  +50 */ float specialn_inhale_velocity;
    /*  +54 */ float specialn_inhale_resistance;
    /*  +58 */ float specialn_duration_divisor;
    /*  +5C */ float specialn_base_duration;
    /*  +60 */ float specialn_star_deceleration_rate;
    /*  +64 */ float specialn_star_duration_divisor;
    /*  +68 */ float specialn_star_base_duration;
    /*  +6C */ float specialn_frames_in_swallow_star;
    /*  +70 */ float specialn_spit_spin;
    /*  +74 */ float specialn_x_axis_range_walk;
    /*  +78 */ float specialn_y_axis_range_jump;
    /*  +7C */ float specialn_walk_speed;
    /*  +80 */ float specialn_jump_height;
    /*  +84 */ float specialn_stop_momentum;
    /*  +88 */ float specialn_ground_spit_initial_horizontal_velocity;
    /*  +8C */ float specialn_spit_deceleration_rate;
    /*  +90 */ float specialn_spit_out_release_angle; // In radians
    /*  +94 */ float specialn_swallow_star_vertical_velocity;
    /*  +98 */ float specialn_swallow_star_gravity;
    /*  +9C */ float specialn_opponent_horizontal_velocity;
    /*  +A0 */ float specialn_opponent_vertical_velocity;
    /*  +A4 */ float specialn_ability_loss_star_x;
    /*  +A8 */ float specialn_ability_loss_star_y;
    /*  +AC */ float specialn_ability_loss_star_z;
    /*  +B0 */ float specialn_odds_lose_ability_on_hit;
    /*  +B4 */ float specialn_unk1;
    /*  +B8 */ float specialn_swallow_star_y_release;
    /*  +BC */ float specialn_unk2;
    /*  +C0 */ float specialn_unk3;
    /*  +C4 */ float specialn_unk4;
    /*  +C8 */ float specialn_unk5;
    // Side B
    /*  +CC */ float specials_aerial_vertical_momentum;
    /*  +D0 */ float specials_landing_lag;
    // Up B
    /*  +D4 */ float specialhi_vertical_momentum;
    /*  +D8 */ float specialhi_horizontal_momentum;
    /*  +DC */ float specialhi_projectile_spawn_x;
    /*  +E0 */ float specialhi_projectile_spawn_y;
    /*  +E4 */ float specialhi_reverse_upb_stick_range;
    /*  +E8 */ float specialhi_unk;
    // Down B
    /*  +EC */ u32 speciallw_max_time_in_stone;
    /*  +F0 */ u32 speciallw_min_time_in_stone;
    /*  +F4 */ float speciallw_min_slant_angle_slide;
    /*  +F8 */ float speciallw_max_slant_angle_slide;
    /*  +FC */ float speciallw_slide_acceleration;
    /* +100 */ float speciallw_slide_max_speed;
    /* +104 */ float speciallw_gravity;
    /* +108 */ u32 speciallw_hp;
    /* +10C */ u32 speciallw_resistance;
    /* +110 */ u32 speciallw_unk;
    /* +114 */ float speciallw_freefall_toggle;
    // Bowser
    // In frames, checked in this many frame intervals
    /* +118 */ u32 specialn_kp_b_button_check_frequency;
    /* +11C */ float specialn_kp_fuel_recharge_rate;
    /* +120 */ float specialn_kp_flame_size_recharge_rate;
    /* +124 */ float specialn_kp_max_fuel;
    /* +128 */ float specialn_kp_spew_flame_velocity;
    /* +12C */ float specialn_kp_flame_scale;
    /* +130 */ float specialn_kp_lowest_charge_graphic_size;
    /* +134 */ u32 specialn_kp_screen_shake_frequency;
    /* +138 */ float specialn_kp_breath_x_offset;
    // Values repeat below here
    /* +13C */ float specialn_kp_breath_y_offset;
    // Giga Bowser
    // In frames, checked in this many frame intervals
    /* +140 */ u32 specialn_gk_b_button_check_frequency;
    /* +144 */ float specialn_gk_fuel_recharge_rate;
    /* +148 */ float specialn_gk_flame_size_recharge_rate;
    /* +14C */ float specialn_gk_max_fuel;
    /* +150 */ float specialn_gk_spew_flame_velocity;
    /* +154 */ float specialn_gk_flame_scale;
    /* +158 */ float specialn_gk_lowest_charge_graphic_size;
    /* +15C */ u32 specialn_gk_screen_shake_frequency;
    /* +160 */ float specialn_gk_breath_x_offset;
    /* +164 */ float specialn_gk_breath_y_offset;
    // Samus
    /* +168 */ float specialn_ss_charge_time;
    /* +16C */ float specialn_ss_aerial_shot_recoil;
    /* +170 */ u32 specialn_ss_frames_per_charge_level;
    /* +174 */ float specialn_ss_freefall_toggle;
    // Peach
    /* +178 */ float specialn_pe_friction;
    /* +17C */ float specialn_pe_air_horizontal_momentum_preservation;
    /* +180 */ float specialn_pe_air_initial_vertical_momentum;
    /* +184 */ float specialn_pe_fall_acceleration;
    /* +188 */ float specialn_pe_unk2;
    /* +18C */ float specialn_pe_unk3;
    // Donkey Kong
    /* +190 */ int specialn_dk_swings_to_full_charge;
    /* +194 */ u32 specialn_dk_damage_increase_per_swing;
    /* +198 */ float specialn_dk_grounded_punch_horizontal_velocity;
    /* +19C */ float specialn_dk_freefall_toggle;
    // Ness
    /* +1A0 */ int specialn_ns_frames_to_loop_charge_ground;
    /* +1A4 */ int specialn_ns_frames_to_loop_charge_air;
    /* +1A8 */ int specialn_ns_falling_acceleration_delay;
    /* +1AC */ int specialn_ns_charge_release_delay;
    /* +1B0 */ float specialn_ns_unk1;
    /* +1B4 */ float specialn_ns_gravity;
    /* +1B8 */ float specialn_ns_unk2;
    /* +1BC */ float specialn_ns_freefall_toggle;
    // Pikachu
    /* +1C0 */ float specialn_pk_ground_spawn_offset_x;
    /* +1C4 */ float specialn_pk_ground_spawn_offset_y;
    /* +1C8 */ float specialn_pk_air_spawn_offset_x;
    /* +1CC */ float specialn_pk_air_spawn_offset_y;
    /* +1D0 */ float specialn_pk_freefall_toggle;
    /* +1D4 */ u32 specialn_pk_grounded_item_id;
    /* +1D8 */ u32 specialn_pk_air_item_id;
    // Pichu
    /* +1DC */ float specialn_pc_ground_spawn_offset_x;
    /* +1E0 */ float specialn_pc_ground_spawn_offset_y;
    /* +1E4 */ float specialn_pc_air_spawn_offset_x;
    /* +1E8 */ float specialn_pc_air_spawn_offset_y;
    /* +1EC */ float specialn_pc_freefall_toggle;
    /* +1F0 */ u32 specialn_pc_grounded_item_id;
    /* +1F4 */ u32 specialn_pc_air_item_id;
    // Captain Falcon
    /* +1F8 */ float specialn_ca_x_axis_range;
    /* +1FC */ float specialn_ca_y_axis_range;
    /* +200 */ float specialn_ca_angle_difference;
    /* +204 */ float specialn_ca_forward_momentum;
    /* +208 */ float specialn_ca_additional_vertical_momentum;
    // Ganondorf
    /* +20C */ float specialn_gn_x_axis_range;
    /* +210 */ float specialn_gn_y_axis_range;
    /* +214 */ float specialn_gn_angle_difference;
    /* +218 */ float specialn_gn_forward_momentum;
    /* +21C */ float specialn_gn_additional_vertical_momentum;
    // Fox
    /* +220 */ float specialn_fx_unk1;
    /* +224 */ float specialn_fx_unk2;
    /* +228 */ float specialn_fx_unk3;
    /* +22C */ float specialn_fx_unk4;
    /* +230 */ float specialn_fx_launch_angle;
    /* +234 */ float specialn_fx_launch_speed;
    /* +238 */ float specialn_fx_freefall_toggle;
    /* +23C */ u32 specialn_fx_blaster_projectile_id;
    /* +240 */ u32 specialn_fx_blaster_item_id;
    // Falco
    /* +244 */ float specialn_fc_unk1;
    /* +248 */ float specialn_fc_unk2;
    /* +24C */ float specialn_fc_unk3;
    /* +250 */ float specialn_fc_unk4;
    /* +254 */ float specialn_fc_launch_angle;
    /* +258 */ float specialn_fc_launch_speed;
    /* +25C */ float specialn_fc_freefall_toggle;
    /* +260 */ u32 specialn_fc_blaster_projectile_id;
    /* +264 */ u32 specialn_fc_blaster_item_id;
    // Link
    /// In frames
    /* +268 */ float specialn_lk_max_charge;
    /* +26C */ float specialn_lk_arrow_charge_speed;
    /* +270 */ float specialn_lk_freefall_toggle;
    /* +274 */ u32 specialn_lk_bow_item_loader_id;
    /* +278 */ u32 specialn_lk_bow_item_id;
    // Young Link
    // In frames
    /* +27C */ float specialn_cl_max_charge;
    /* +280 */ float specialn_cl_arrow_charge_speed;
    /* +284 */ float specialn_cl_freefall_toggle;
    /* +288 */ u32 specialn_cl_bow_item_loader_id;
    /* +28C */ u32 specialn_cl_bow_item_id;
    // Sheik
    /* +290 */ float specialn_sk_graphic_x_offset_ground;
    /* +294 */ float specialn_sk_graphic_y_offset_ground;
    /* +298 */ float specialn_sk_graphic_x_offset_air;
    /* +29C */ float specialn_sk_graphic_y_offset_air;
    /* +2A0 */ float specialn_sk_freefall_toggle;
    // Zelda
    /* +2A4 */ float specialn_zd_unk1;
    /* +2A8 */ u32 specialn_zd_frames_before_gravity;
    /* +2AC */ float specialn_zd_horizontal_momentum_preservation;
    /* +2B0 */ float specialn_zd_fall_acceleration;
    // Jigglypuff
    /* +2B4 */ u32 specialn_pr_duration;
    /* +2B8 */ u32 specialn_pr_unk;
    /* +2BC */ float specialn_pr_air_height_offset_at_start;
    /* +2C0 */ float specialn_pr_bounciness;
    /* +2C4 */ float specialn_pr_unk1;
    /* +2C8 */ float specialn_pr_gravity_during_roll;
    /* +2CC */ float specialn_pr_base_speed;
    /* +2D0 */ float specialn_pr_max_speed;
    /* +2D4 */ float specialn_pr_unk2;
    /* +2D8 */ float specialn_pr_air_x_axis_momentum;
    /* +2DC */ float specialn_pr_air_y_axis_momentum;
    /* +2E0 */ float specialn_pr_air_initial_momentum;
    /* +2E4 */ float specialn_pr_max_momentum;
    /* +2E8 */ float specialn_pr_spinning_speed;
    /* +2EC */ float specialn_pr_spinning_speed_turn;
    /* +2F0 */ u32 specialn_pr_delay_per_smoke;
    /* +2F4 */ float specialn_pr_unk3;
    /* +2F8 */ float specialn_pr_bounce1;
    /* +2FC */ float specialn_pr_bounce2;
    /* +300 */ float specialn_pr_base_damage;
    /* +304 */ float specialn_pr_damage_multiplier;
    /* +308 */ float specialn_pr_horizontal_bounce_momentum_on_hit;
    /* +30C */ float specialn_pr_vertical_bounce_momentum_on_hit;
    /* +310 */ float specialn_pr_forward_momentum_from_stick;
    /* +314 */ float specialn_pr_unk4;
    /* +318 */ float specialn_pr_unk5;
    /* +31C */ u32 specialn_pr_unk6;
    /* +320 */ float specialn_pr_charge_rate1;
    /* +324 */ float specialn_pr_charge_time;
    /* +328 */ float specialn_pr_charge_rate2;
    /* +32C */ float specialn_pr_charge_spin_animation;
    /* +330 */ float specialn_pr_unk7;
    /* +334 */ float specialn_pr_unk8;
    /* +338 */ float specialn_pr_some_speed_var;
    /* +33C */ float specialn_pr_spin_anim_speed_after_collision;
    /* +340 */ float specialn_pr_air_speed;
    /* +344 */ float specialn_pr_turn_rate_related;
    /* +348 */ float specialn_pr_unk9;
    /* +34C */ float specialn_pr_unk10;
    /* +350 */ float specialn_pr_unk11;
    /* +354 */ float specialn_pr_unk12;
    /* +358 */ float specialn_pr_freefall_toggle;
    struct ftKb_SpecialNMs_DatAttrs ms, fe;
    // Mewtwo
    /* +384 */ float specialn_mt_charge_time;
    /* +388 */ float specialn_mt_ground_horizontal_momentum;
    /* +38C */ float specialn_mt_air_horizontal_momentum;
    /* +390 */ u32 specialn_mt_loops_to_full_charge;
    /* +394 */ float specialn_mt_frames_to_transition;
    /* +398 */ float specialn_mt_freefall_toggle;
    // Ice Climbers
    /* +39C */ float specialn_pp_air_vertical_momentum;
    /* +3A0 */ float specialn_pp_landing_lag;
    /* +3A4 */ float specialn_pp_x_spawn;
    /* +3A8 */ float specialn_pp_y_spawn;
    // Yoshi
    /* +3AC */ float specialn_ys_initial_horizontal_momentum;
    /* +3B0 */ float specialn_ys_initial_vertical_momentum;
    /* +3B4 */ float specialn_ys_damage_multiplier;
    /* +3B8 */ float specialn_ys_unk;
    /* +3BC */ float specialn_ys_growth_time;
    /* +3C0 */ float specialn_ys_base_duration;
    /* +3C4 */ float specialn_ys_egg_breakout_resistance;
    /* +3C8 */ float specialn_ys_frames_reduced_per_input;
    /* +3CC */ float specialn_ys_unk1;
    /* +3D0 */ float specialn_ys_unk2;
    /* +3D4 */ u32 specialn_ys_iframes_on_release;
    /* +3D8 */ float specialn_ys_horizontal_velocity_on_breakout;
    /* +3DC */ float specialn_ys_vertical_velocity_on_breakout;
    /* +3E0 */ float specialn_ys_unk3;
    // Mr. Game & Watch
    /* +3E4 */ float specialn_gw_frame_on_repeat;
    /* +3E8 */ float specialn_gw_max_sausages_per_use;
    /* +3EC */ AbsorbDesc specialn_pe_absorbdesc;
    /* +400 */ ReflectDesc specialn_zd_reflectdesc;
    // Final Cutter
    /* +424 */ float specialhi_initial_velocity;
    /* +428 */ float specialhi_unk2;
    /* +42C */ float specialhi_duration;
    /* +430 */ float specialhi_deceleration_rate;
};
struct { int x[1 - 2 * !(sizeof(struct ftKb_DatAttrs) == 0x434)]; };;
union ftKb_MotionVars {
    struct ftKb_SpecialNNs_Vars {
        /* fp+2340 */ int frames_to_loop_charge_ground;
        /* fp+2344 */ int frames_to_loop_charge_air;
        /* fp+2348 */ int falling_acceleration_delay;
        /* fp+234C */ int charge_release_delay;
    } specialn_ns;
    struct ftKb_SpecialNPe_Vars {
        /* fp+2340 */ int facing_dir;
    } specialn_pe;
    struct ftKb_SpecialNGw_Vars {
        /* fp+2340 */ M2C_UNK x0;
        /* fp+2344 */ M2C_UNK x4;
    } specialn_gw;
};
#define MELEE_FT_CHARA_FTKOOPA_TYPES_H
struct ftKoopa_FighterVars {
    /* 0x222C */ float x222C;
    /* 0x2230 */ float x2230;
};
union ftKoopa_MotionVars {
    /// @todo Proper state name.
    struct ftKoopa_State1Vars {
        M2C_UNK x0;
        bool x4;
        M2C_UNK x8;
        bool xC;
    } unk1;
    /// @todo Possibly #ftKoopa_State1Vars.
    struct ftKoopa_SpecialSVars {
        /* fp+2340 */ bool b_held;
        /* fp+2344 */ bool x4;
        /* fp+2348 */ int facing_dir;
        /* fp+2348 */ bool xC;
    } specials;
};
typedef struct _ftKoopaAttributes {
    float x0;
    u32 x4;
    float x8;
    float xC;
    float x10;
    float x14;
    float x18;
    float x1C;
    u32 x20;
    float x24;
    float x28;
    u32 x2C;
    float x30;
    float x34;
    float x38;
    float x3C;
    float x40;
    float x44;
    float x48;
    float x4C;
    u32 unk50;
    float x54;
    float x58;
    float x5C;
    float x60;
    float x64;
    float x68;
    float x6C;
    float x70;
    float x74;
    float x78;
    float x7C;
    float x80;
    float x84;
    float x88;
    float x8C;
    float x90;
    float x94;
    float x98;
    float x9C;
} ftKoopaAttributes;
typedef struct _ftKoopaVars {
    float x0;
    float x4;
} ftKoopaVars;
#define MELEE_FT_CHARA_FTLINK_TYPES_H
struct ftLk_DatAttrs {
    /* +0 */ float x0;
    /* +4 */ float specialn_anim_rate;
    /* +8 */ float x8;
    /* +C */ int xC;
    /* +10 */ int x10;
    /* +14 */ float x14;
    /* +18 */ float x18;
    /* +1C */ float x1C;
    /* +20 */ float x20;
    /* +24 */ float x24;
    /* +28 */ float specialhi_pos_y_offset;
    /* +2C */ int x2C;
    /* +30 */ float x30;
    /* +34 */ float x34;
    /* +38 */ float specialairhi_drift_stick_mul;
    /* +3C */ float specialairhi_drift_max_mul;
    /* +40 */ float x40;
    /* +44 */ float specialhi_grav_mul;
    /* +48 */ int x48;
    /* +4C */ float attackairlw_hit_vel_y;
    /* +50 */ float attackairlw_hit_anim_frame_start;
    /* +54 */ float attackairlw_hit_anim_frame_end;
    /* +58 */ u32 attackairlw_anim_flags[3];
    /* +64 */ M2C_UNK x64;
    /* +68 */ M2C_UNK x68;
    /* +6C */ M2C_UNK x6C;
    /* +70 */ M2C_UNK x70;
    /* +74 */ M2C_UNK x74;
    /* +78 */ M2C_UNK x78;
    /* +7C */ M2C_UNK x7C;
    /* +80 */ M2C_UNK x80;
    /* +84 */ M2C_UNK x84;
    /* +88 */ s32 x88;
    /* +8C */ M2C_UNK x8C;
    /* +90 */ M2C_UNK x90;
    /* +94 */ M2C_UNK x94;
    /* +98 */ s32 x98;
    /* +9C */ M2C_UNK x9C;
    /* +A0 */ M2C_UNK xA0;
    /* +A4 */ int xA4;
    /* +A8 */ s32 xA8;
    /* +AC */ M2C_UNK xAC;
    /* +B0 */ int xB0;
    /* +B4 */ float xB4;
    /* +B8 */ int xB8;
    /* +BC */ int xBC;
    /* +C0 */ u8 xC0_filler[0xC4 - 0xC0];
    /* +C4 */ AbsorbDesc xC4;
    /* +D8 */ float xD8;
};
struct ftLk_FighterVars {
    /* fp+222C */ bool used_boomerang;
    /* fp+2230 */ bool x4;
    /* fp+2234 */ Item_GObj* boomerang_gobj;
    /* fp+2238 */ Item_GObj* xC;
    /* fp+223C */ Item_GObj* arrow_gobj;
    /* fp+2240 */ Item_GObj* x14;
    /* fp+2244 */ Item_GObj* x18;
    /* fp+2248 */ u32 x1C;
    u8 _[0xF8 - 0x20];
};
union ftLk_MotionVars {
    struct ftLk_AttackAirVars {
        /* fp+2340 */ float lw_frame_start;
    } attackair;
    struct ftLk_SpecialNVars {
        /* fp+2340 */ Vec2 x0;
        /* fp+2348 */ Vec3 x8;
        /* fp+2354 */ float x14;
        /* fp+2358 */ int unk_timer;
    } specialn;
};
struct ftLk_SpecialN_Vec3Group {
    /*  +0 */ Vec3 a;
    /*  +C */ Vec3 b;
    /* +18 */ Vec3 c;
};
#define MELEE_FT_CHARA_FTLUIGI_TYPES_H
struct ftLuigi_FighterVars {
    /* 0x222C */ bool x222C_cycloneCharge;
    /* 0x2230 */ u32 x2230;
    /* 0x2234 */ u32 x2234;
    u8 _[0xF8 - 0xC];
};
typedef struct _ftLuigiAttributes {
    /// SIDE SPECIAL - GREEN MISSILE
    float x0_LUIGI_GREENMISSILE_UNK1;
    float x4_LUIGI_GREENMISSILE_SMASH;
    float x8_LUIGI_GREENMISSILE_CHARGE_RATE;
    float xC_LUIGI_GREENMISSILE_MAX_CHARGE_FRAMES;
    float x10_LUIGI_GREENMISSILE_DAMAGE_TILT;
    /// (base damage + charge duration) * this value?
    float x14_LUIGI_GREENMISSILE_DAMAGE_SLOPE;
    float x18_LUIGI_GREENMISSILE_TRACTION;
    float x1C_LUIGI_GREENMISSILE_UNK2;
    float x20_LUIGI_GREENMISSILE_FALLING_SPEED;
    float x24_LUIGI_GREENMISSILE_VEL_X;
    float x28_LUIGI_GREENMISSILE_MUL_X;
    float x2C_LUIGI_GREENMISSILE_VEL_Y;
    float x30_LUIGI_GREENMISSILE_MUL_Y;
    float x34_LUIGI_GREENMISSILE_GRAVITY_START;
    float x38_LUIGI_GREENMISSILE_FRICTION_END;
    float x3C_LUIGI_GREENMISSILE_X_DECEL;
    float x40_LUIGI_GREENMISSILE_GRAVITY_MUL;
    /// 1.0f divided by this value
    float x44_LUIGI_GREENMISSILE_MISFIRE_CHANCE;
    float x48_LUIGI_GREENMISSILE_MISFIRE_VEL_X;
    float x4C_LUIGI_GREENMISSILE_MISFIRE_VEL_Y;
    /// UP SPECIAL - SUPER JUMP PUNCH
    /// Multiplies Luigi's max horionztal aerial mobility
    float x50_LUIGI_SUPERJUMP_FREEFALL_MOBILITY;
    float x54_LUIGI_SUPERJUMP_LANDING_LAG;
    /// Minimum stick range required for turnaround
    float x58_LUIGI_SUPERJUMP_REVERSE_STICK_RANGE;
    /// Minimum stick range required for horionztal momentum?
    float x5C_LUIGI_SUPERJUMP_MOMENTUM_STICK_RANGE;
    float x60_LUIGI_SUPERJUMP_ANGLE_DIFF;
    float x64_LUIGI_SUPERJUMP_VEL_X;
    float x68_LUIGI_SUPERJUMP_GRAVITY_START;
    float x6C_LUIGI_SUPERJUMP_VEL_Y;
    /// DOWN SPECIAL - LUIGI CYCLONE
    /// Vertical momentum from (first?) B button tap
    float x70_LUIGI_CYCLONE_TAP_MOMENTUM;
    float x74_LUIGI_CYCLONE_MOMENTUM_X_GROUND;
    float x78_LUIGI_CYCLONE_MOMENTUM_X_AIR;
    float x7C_LUIGI_CYCLONE_MOMENTUM_X_MUL_GROUND;
    float x80_LUIGI_CYCLONE_MOMENTUM_X_MUL_AIR;
    float x84_LUIGI_CYCLONE_FRICTION_END;
    s32 x88_LUIGI_CYCLONE_UNK;
    float x8C_LUIGI_CYCLONE_TAP_Y_VEL_MAX;
    float x90_LUIGI_CYCLONE_TAP_GRAVITY;
    s32 x94_LUIGI_CYCLONE_LANDING_LAG;
} ftLuigiAttributes;
typedef struct ftLuigiSpecialS {
    /// 0x2340 - Number of frames Green Missile has been charged
    s32 chargeFrames;
    /// 0x2344 - Check if Green Missile will misfire
    bool isMisfire;
} ftLuigiSpecialS;
typedef struct ftLuigiSpecialLw {
    /// 0x2340 - Grounded momentum of Luigi Cyclone
    float groundVelX;
    /// 0x2344 - Set but never used?
    s32 unk;
    /// 0x2348 - Skipped entirely
    s32 _;
    /// 0x234C - Checked in collision, related to some angle calculation
    bool isUnkColl;
} ftLuigiSpecialLw;
typedef union ftLuigi_MotionVars {
    ftLuigiSpecialS SpecialS;
    ftLuigiSpecialLw SpecialLw;
} ftLuigi_MotionVars;
#define MELEE_FT_CHARA_FTMARIO_TYPES_H
#define MELEE_FT_CHARA_FTMARIO_FORWARD_H
static MotionFlags const ftMr_MF_Special =
    Ft_MF_SkipModel | Ft_MF_SkipItemVis | Ft_MF_UnkUpdatePhys |
    Ft_MF_FreezeState;
static MotionFlags const ftMr_MF_SpecialN =
    ftMr_MF_Special | Ft_MF_KeepFastFall | Ft_MF_SkipThrowException;
static MotionFlags const ftMr_MF_SpecialHi =
    ftMr_MF_Special | Ft_MF_KeepFastFall | Ft_MF_KeepGfx | Ft_MF_KeepSfx;
static MotionFlags const ftMr_MF_SpecialLw =
    ftMr_MF_Special | Ft_MF_KeepColAnimHitStatus | Ft_MF_KeepSfx;
static MotionFlags const ftMr_MF_SpecialAirN =
    ftMr_MF_SpecialN | Ft_MF_SkipParasol;
static MotionFlags const ftMr_MF_SpecialAirHi =
    ftMr_MF_SpecialHi | Ft_MF_SkipParasol;
static MotionFlags const ftMr_MF_SpecialAirLw =
    ftMr_MF_SpecialLw | Ft_MF_SkipParasol;
static MotionFlags const ftMr_MF_SpecialS =
    ftMr_MF_Special | Ft_MF_KeepGfx | Ft_MF_SkipModel | Ft_MF_SkipColAnim;
typedef enum ftMario_MotionState {
    ftMr_MS_AppealSR = ftCo_MS_Count,
    ftMr_MS_AppealSL,
    ftMr_MS_SpecialN,
    ftMr_MS_SpecialAirN,
    ftMr_MS_SpecialS,
    ftMr_MS_SpecialAirS,
    ftMr_MS_SpecialHi,
    ftMr_MS_SpecialAirHi,
    ftMr_MS_SpecialLw,
    ftMr_MS_SpecialAirLw,
    ftMr_MS_Count,
    ftMr_MS_SelfCount = ftMr_MS_Count - ftCo_MS_Count,
} ftMario_MotionState;
typedef enum ftMr_Submotion {
    ftMr_SM_SpecialN = ftCo_SM_Count,
    ftMr_SM_SpecialAirN,
    ftMr_SM_SpecialS,
    ftMr_SM_SpecialAirS,
    ftMr_SM_SpecialHi,
    ftMr_SM_SpecialAirHi,
    ftMr_SM_SpecialLw,
    ftMr_SM_SpecialAirLw,
    ftMr_SM_Count,
    ftMr_SM_SelfCount = ftMr_SM_Count - ftCo_SM_Count,
} ftMr_Submotion;
struct ftMario_FighterVars {
    /// Current Megavitamin color combo
    /* 0x222C */ int x222C_vitaminCurr;
    /// Previous Megavitamin color combo
    /* 0x2230 */ int x2230_vitaminPrev;
    /* 0x2234 */ bool x2234_tornadoCharge;
    /* 0x2238 */ bool x2238_isCapeBoost;
    /* 0x223C */ HSD_GObj* x223C_capeGObj;
    /* 0x2240 */ uint x2240;
    u8 _[0xF8 - 0x18];
};
typedef struct ftMario_DatAttrs {
    struct ftMario_SpecialS_DatAttrs {
        float vel_x_decay;
        Vec2 vel;
        float grav;
        float terminal_vel;
        ItemKind cape_kind;
    } specials;
    struct ftMario_SpecialHi_DatAttrs {
        float freefall_mobility;
        float landing_lag;
        float reverse_stick_range;
        float momentum_stick_range;
        float angle_diff;
        float vel_x;
        float grav;
        float vel_mul;
    } specialhi;
    struct ftMario_SpecialLw_DatAttrs {
        float vel_y;
        float momentum_x;
        float air_momentum_x;
        float momentum_x_mul;
        float air_momentum_x_mul;
        float friction_end;
        s32 unk0;
        float tap_y_vel_max;
        float tap_grav;
        s32 landing_lag;
    } speciallw;
    ReflectDesc cape_reflection;
} ftMario_DatAttrs;
typedef struct ftMario_SpecialLw_ECB {
    u8 x0_str_arr[3];
    u8 x3_balign;
    uint x4;
    uint x8;
    uint xC;
    uint x10;
    uint x14;
} ftMario_SpecialLw_ECB;
typedef struct ftMarioSpecialS {
    /// 0x2340 - bool to check if reflect bubble should be enabled
    bool reflecting;
} ftMarioSpecialS;
typedef struct ftMarioSpecialLw {
    /// 0x2340 - Grounded momentum of Mario / Dr. Tornado
    float groundVelX;
    /// 0x2344 - Set but never used?
    s32 unk;
    /// 0x2348 - Skipped entirely
    s32 _;
    /// 0x234C - Checked in collision, related to some angle calculation
    bool isUnkColl;
} ftMarioSpecialLw;
typedef union ftMario_MotionVars {
    ftMarioSpecialS SpecialS;
    ftMarioSpecialLw SpecialLw;
} ftMario_MotionVars;
#define MELEE_FT_CHARA_FTMARS_TYPES_H
struct ftMars_FighterVars {
    /* 0x222C */ u32 x222C;
    u8 _[0xF8 - 4];
};
typedef struct _MarsAttributes {
    int x0;
    int x4;
    int x8;
    float specialn_friction;
    float x10;
    float x14;
    float x18;
    float x1C;
    float x20;
    float x24;
    float x28;
    float x2C;
    float x30;
    float x34;
    float x38;
    float x3C;
    float x40;
    float x44;
    float x48;
    float x4C;
    float x50;
    float x54;
    float x58;
    float x5C;
    float x60;
    AbsorbDesc x64;
    u8 x78[0x98 - 0x78];
} MarsAttributes;
union ftMars_MotionVars {
    struct ftMars_Unk0MotionVars {
        bool x0;
    } unk0;
    struct ftMars_SpecialNVars {
        int cur_frame;
    } specialn;
    struct ftMars_SpecialSVars {
        int x0;
    } specials;
    struct ftMars_SpecialLwVars {
        int x0;
    } speciallw;
};
#define MELEE_FT_CHARA_FTMASTERHAND_TYPES_H
#define MELEE_FT_CHARA_FTMASTERHAND_FORWARD_H
typedef struct ftMasterHand_SpecialAttrs ftMasterHand_SpecialAttrs;
typedef enum ftMasterHand_UnkEnum0 {
    ftMh_UnkEnum0_Unk00,
    ftMh_UnkEnum0_Unk01,
    ftMh_UnkEnum0_Unk02,
    ftMh_UnkEnum0_Unk03,
    ftMh_UnkEnum0_Unk04,
    ftMh_UnkEnum0_Unk05,
    ftMh_UnkEnum0_Unk06,
    ftMh_UnkEnum0_Unk07,
    ftMh_UnkEnum0_Unk08,
    ftMh_UnkEnum0_Unk09,
    ftMh_UnkEnum0_Unk10,
} ftMasterHand_UnkEnum0;
typedef enum ftMasterhand_MotionState {
    ftMh_MS_Wait1_0 = ftCo_MS_Count,
    ftMh_MS_Wait2_0,
    ftMh_MS_Entry,
    ftMh_MS_Damage,
    ftMh_MS_Damage2,
    ftMh_MS_WaitSweep,
    ftMh_MS_SweepLoop,
    ftMh_MS_SweepWait,
    ftMh_MS_Slap,
    ftMh_MS_Walk2,
    ftMh_MS_WalkLoop,
    ftMh_MS_WalkWait,
    ftMh_MS_WalkShoot,
    ftMh_MS_Drill,
    ftMh_MS_RockCrushUp,
    ftMh_MS_RockCrushWait,
    ftMh_MS_RockCrushDown,
    ftMh_MS_PaperCrush,
    ftMh_MS_Poke1,
    ftMh_MS_Poke2,
    ftMh_MS_FingerBeamStart,
    ftMh_MS_FingerBeamLoop,
    ftMh_MS_FingerBeamEnd,
    ftMh_MS_FingerGun1,
    ftMh_MS_FingerGun2,
    ftMh_MS_FingerGun3,
    ftMh_MS_BackAirplane1,
    ftMh_MS_BackAirplane2,
    ftMh_MS_BackAirplane3,
    ftMh_MS_BackPunch,
    ftMh_MS_BackCrush,
    ftMh_MS_BackDisappear,
    ftMh_MS_Wait1_1,
    ftMh_MS_Grab,
    ftMh_MS_Cancel,
    ftMh_MS_Squeezing0,
    ftMh_MS_Squeezing1,
    ftMh_MS_Squeeze,
    ftMh_MS_Throw,
    ftMh_MS_Slam,
    ftMh_MS_Fail,
    ftMh_MS_TagCrush,
    ftMh_MS_TagApplaud,
    ftMh_MS_TagRockPaper,
    ftMh_MS_TagGrab,
    ftMh_MS_TagSqueeze,
    ftMh_MS_TagFail,
    ftMh_MS_TagCancel,
    ftMh_MS_Wait1_2,
    ftMh_MS_Wait2_1,
    ftMh_MS_Count,
    ftMh_MS_SelfCount = ftMh_MS_Count - ftCo_MS_Count,
} ftMasterhand_MotionState;
typedef enum ftMh_Submotion {
    ftMh_SM_Wait1_0 = ftCo_SM_Count,
    ftMh_SM_Wait2_0,
    ftMh_SM_Entry,
    ftMh_SM_Damage,
    ftMh_SM_Damage2,
    ftMh_SM_WaitSweep,
    ftMh_SM_SweepLoop,
    ftMh_SM_SweepWait,
    ftMh_SM_Slap,
    ftMh_SM_Walk2,
    ftMh_SM_WalkLoop,
    ftMh_SM_WalkWait,
    ftMh_SM_WalkShoot,
    ftMh_SM_Drill,
    ftMh_SM_RockCrushUp,
    ftMh_SM_RockCrushWait,
    ftMh_SM_RockCrushDown,
    ftMh_SM_PaperCrush,
    ftMh_SM_Poke1,
    ftMh_SM_Poke2,
    ftMh_SM_FingerBeamStart,
    ftMh_SM_FingerBeamLoop,
    ftMh_SM_FingerBeamEnd,
    ftMh_SM_FingerGun1,
    ftMh_SM_FingerGun2,
    ftMh_SM_FingerGun3,
    ftMh_SM_BackAirplane1,
    ftMh_SM_BackAirplane2,
    ftMh_SM_BackAirplane3,
    ftMh_SM_BackPunch,
    ftMh_SM_BackCrush,
    ftMh_SM_BackDisappear,
    ftMh_SM_Wait1_1,
    ftMh_SM_Grab,
    ftMh_SM_Cancel,
    ftMh_SM_Squeezing0,
    ftMh_SM_Squeezing1,
    ftMh_SM_Squeeze,
    ftMh_SM_Throw,
    ftMh_SM_Slam,
    ftMh_SM_Fail,
    ftMh_SM_TagCrush,
    ftMh_SM_TagApplaud,
    ftMh_SM_TagRockPaper,
    ftMh_SM_TagGrab,
    ftMh_SM_TagSqueeze,
    ftMh_SM_TagFail,
    ftMh_SM_TagCancel,
    ftMh_SM_Wait1_2,
    ftMh_SM_Wait2_1,
    ftMh_SM_Count,
    ftMh_SM_SelfCount = ftMh_SM_Count - ftCo_SM_Count,
} ftMh_Submotion;
struct ftMasterhand_FighterVars {
    /* 0x222C */ HSD_GObj* x222C;
    /* 0x2230 */ u32 x2230;
    /* 0x2234 */ u32 x2234;
    /* 0x2238 */ float x2238;
    /* 0x223C */ float x223C;
    /* 0x2240 */ Vec3 x2240_pos;
    /* 0x224C */ u32 x224C;
    /* 0x2250 */ s32 x2250;
    /* 0x2254 */ s32 x2254;
    /* 0x2258 */ s32 x2258;
};
struct ftMasterHand_SpecialAttrs {
    s32 x0;
    s32 x4;
    s32 x8;
    s32 xC;
    s32 x10;
    s32 x14;
    s32 x18;
    s32 x1C;
    s32 x20;
    s32 x24;
    float x28;
    float x2C;
    Vec2 x30_pos2;
    float x38;
    float x3C;
    Vec3 x40_pos;
    float x4C;
    Vec2 x50;
    float x58;
    float x5C;
    float x60;
    float x64;
    float x68;
    s32 x6C;
    s32 x70;
    s32 x74;
    float x78;
    s32 x7C;
    float x80;
    s32 x84;
    Vec2 x88_pos;
    s32 x90;
    s32 x94;
    float x98;
    float x9C;
    s32 xA0;
    float xA4;
    Vec2 xA8_pos;
    s32 xB0;
    s32 xB4;
    float xB8;
    Vec2 xBC_pos;
    Vec2 xC4_pos;
    Vec2 xCC_pos;
    float xD4;
    float xD8;
    float xDC;
    float xE0;
    float xE4;
    float xE8;
    s32 xEC;
    s32 xF0;
    float xF4;
    float xF8;
    float xFC;
    float x100;
    float x104;
    float x108;
    float x10C;
    Vec2 x110_pos;
    Vec2 x118_pos;
    float x120;
    Vec2 x124_pos;
    Vec2 x12C_pos;
    Vec2 x134_pos;
    Vec2 x13C_pos;
    s32 x144;
    s32 x148;
    float x14C;
    float x150;
    float x154;
    float x158;
    float x15C;
    s32 x160;
    s32 x164;
    s32 x168;
    s32 x16C;
    s32 x170;
    s32 x174;
    float x178;
};
union ftMasterHand_MotionVars {
    struct ftMasterHand_Unk0Vars {
        float x0;
        HSD_GObjEvent x4;
        int x8;
        Vec3 xC;
        float x18;
        float x1C;
        int x20;
        float x24;
        int x28;
        int x2C;
        int x30;
        int x34;
        int x38;
        int x3C;
        int x40;
        int x44;
        int x48;
        int x4C;
        float x50;
        int x54;
        Vec3 x58;
        Vec3 x64;
        int x70;
        int x74;
        int x78;
    } unk0;
    struct ftMasterHand_Unk4Vars {
        ftMasterHand_UnkEnum0 x0;
        int x4;
        int x8;
    } unk4;
    struct ftMasterHand_Unk13Vars {
        float x0;
        float x4;
    } unk13;
};
#define MELEE_FT_CHARA_FTMEWTWO_TYPES_H
struct ftMewtwo_FighterVars {
    /* 0x222C */ HSD_GObj* x222C_disableGObj;
    /* 0x2230 */ HSD_GObj*
        x2230_shadowHeldGObj; // GObj of Shadow Ball while in Mewtwo's hands?
    /* 0x2234 */ s32 x2234_shadowBallCharge; // Number of cycles Shadow Ball
                                             // has been charged
    /* 0x2238 */ HSD_GObj* x2238_shadowBallGObj;
    /* 0x223C */ bool x223C_isConfusionBoost;
};
typedef struct ftMewtwoSpecialHi {
    /// 0x2340 - Number of frames Teleport's zoom animation lasts for
    s32 travelFrames;
    float stickX;
    float stickY;
    /// 0x234C - ???
    s32 unk4;
    float velX;
    float velY;
    float groundVelX;
} ftMewtwoSpecialHi;
typedef struct ftMewtwoSpecialS {
    /// 0x2340 - ???
    u8 isConfusionReflect : 1;
} ftMewtwoSpecialS;
typedef struct ftMewtwoSpecialN {
    bool isFull;
    s32 x2344;
    bool x2348;
    s32 releaseLag;
    /// 0x2350 - Charge level of Shadow Ball
    float chargeLevel;
} ftMewtwoSpecialN;
typedef union ftMewtwo_MotionVars {
    ftMewtwoSpecialN SpecialN;
    ftMewtwoSpecialS SpecialS;
    ftMewtwoSpecialHi SpecialHi;
} ftMewtwo_MotionVars;
typedef struct _ftMewtwoAttributes {
    // NEUTRAL SPECIAL - SHADOW BALL (SpecialN/SpecialAirN)
    float x0_MEWTWO_SHADOWBALL_CHARGE_CYCLES; // Number of frames each
                                              // iteration cycle lasts?
    float x4_MEWTWO_SHADOWBALL_GROUND_RECOIL_X;
    float x8_MEWTWO_SHADOWBALL_AIR_RECOIL_X;
    s32 xC_MEWTWO_SHADOWBALL_CHARGE_ITERATIONS; // Number of iterations
                                                // required for full charge
    s32 x10_MEWTWO_SHADOWBALL_RELEASE_LAG;
    float x14_MEWTWO_SHADOWBALL_LANDING_LAG;
    // SIDE SPECIAL - CONFUSION (SpecialS/SpecialAirS)
    float x18_MEWTWO_CONFUSION_AIR_BOOST;
    ReflectDesc x1C_MEWTWO_CONFUSION_REFLECTION;
    // UP SPECIAL - TELEPORT (SpecialHi/SpecialAirHi)
    float x40_MEWTWO_TELEPORT_VEL_DIV_X;
    float x44_MEWTWO_TELEPORT_VEL_DIV_Y;
    float x48_MEWTWO_TELEPORT_GRAVITY;
    float x4C_MEWTWO_TELEPORT_TERMINAL_VELOCITY;
    s32 x50_MEWTWO_TELEPORT_DURATION;
    float x54_MEWTWO_TELEPORT_UNK2;
    float x58_MEWTWO_TELEPORT_STICK_RANGE_MIN;
    float x5C_MEWTWO_TELEPORT_MOMENTUM;
    float x60_MEWTWO_TELEPORT_MOMENTUM_ADD;
    float x64_MEWTWO_TELEPORT_DRIFT;
    s32 x68_MEWTWO_TELEPORT_ANGLE_CLAMP; // Clamp teleport travel if surface
                                         // angle is greater than this value
    float x6C_MEWTWO_TELEPORT_MOMENTUM_END_MUL;
    float x70_MEWTWO_TELEPORT_FREEFALL_MOBILITY;
    float x74_MEWTWO_TELEPORT_LANDING_LAG;
    // DOWN SPECIAL - DISABLE (SpecialLw/SpecialAirLw)
    float x78_MEWTWO_DISABLE_GRAVITY;
    float x7C_MEWTWO_DISABLE_TERMINAL_VELOCITY;
    float x80_MEWTWO_DISABLE_OFFSET_X;
    float x84_MEWTWO_DISABLE_OFFSET_Y;
} ftMewtwoAttributes;
#define MELEE_FT_CHARA_FTNESS_TYPES_H
#define MELEE_FT_CHARA_FTNESS_FORWARD_H
static MotionFlags const ftNs_MF_Attack4 =
    Ft_MF_SkipHit | Ft_MF_SkipRumble | Ft_MF_SkipItemVis | Ft_MF_FreezeState;
static MotionFlags const ftNs_MF_AttackHi4 = ftNs_MF_Attack4 | Ft_MF_KeepGfx;
static MotionFlags const ftNs_MF_AttackLw4 =
    ftNs_MF_AttackHi4 | Ft_MF_KeepFastFall;
static MotionFlags const ftNs_MF_AttackHi4Start =
    ftNs_MF_AttackHi4 | Ft_MF_KeepSfx;
static MotionFlags const ftNs_MF_AttackLw4Start =
    ftNs_MF_AttackLw4 | Ft_MF_KeepSfx;
static MotionFlags const ftNs_MF_AttackS4 =
    ftNs_MF_Attack4 | Ft_MF_KeepFastFall | Ft_MF_KeepSfx | Ft_MF_SkipColAnim;
static MotionFlags const ftNs_MF_Special =
    Ft_MF_SkipModel | Ft_MF_SkipItemVis | Ft_MF_UnkUpdatePhys |
    Ft_MF_FreezeState;
static MotionFlags const ftNs_MF_SpecialLw =
    ftNs_MF_Special | Ft_MF_KeepColAnimHitStatus;
static MotionFlags const ftNs_MF_Special_SkipUpdateThrowException =
    ftNs_MF_Special | Ft_MF_SkipThrowException;
static MotionFlags const ftNs_MF_SpecialN =
    ftNs_MF_Special_SkipUpdateThrowException | Ft_MF_KeepFastFall;
static MotionFlags const ftNs_MF_SpecialS =
    ftNs_MF_Special_SkipUpdateThrowException | Ft_MF_KeepGfx;
static MotionFlags const ftNs_MF_SpecialHi = ftNs_MF_SpecialN | Ft_MF_KeepGfx;
static MotionFlags const ftNs_MF_SpecialAirLw =
    ftNs_MF_SpecialLw | Ft_MF_SkipParasol;
static MotionFlags const ftNs_MF_SpecialAirN =
    ftNs_MF_SpecialN | Ft_MF_SkipParasol;
static MotionFlags const ftNs_MF_SpecialAirS =
    ftNs_MF_SpecialS | Ft_MF_SkipParasol;
static MotionFlags const ftNs_MF_SpecialAirHi =
    ftNs_MF_SpecialHi | Ft_MF_SkipParasol;
static MotionFlags const ftNs_MF_SpecialLwLoop =
    ftNs_MF_SpecialLw | Ft_MF_Unk19;
static MotionFlags const ftNs_MF_SpecialAirLwLoop =
    ftNs_MF_SpecialLwLoop | Ft_MF_SkipParasol;
typedef enum ftNess_MotionState {
    ftNs_MS_AttackS4 = ftCo_MS_Count,
    ftNs_MS_AttackHi4,
    ftNs_MS_AttackHi4Charge,
    ftNs_MS_AttackHi4Release,
    ftNs_MS_AttackLw4,
    ftNs_MS_AttackLw4Charge,
    ftNs_MS_AttackLw4Release,
    ftNs_MS_SpecialNStart,
    ftNs_MS_SpecialNHold,
    ftNs_MS_SpecialNRelease,
    ftNs_MS_SpecialNEnd,
    ftNs_MS_SpecialAirNStart,
    ftNs_MS_SpecialAirNHold,
    ftNs_MS_SpecialAirNRelease,
    ftNs_MS_SpecialAirNEnd,
    ftNs_MS_SpecialS,
    ftNs_MS_SpecialAirS,
    ftNs_MS_SpecialHiStart,
    ftNs_MS_SpecialHiHold,
    ftNs_MS_SpecialHiEnd,
    ftNs_MS_SpecialHi,
    ftNs_MS_SpecialAirHiStart,
    ftNs_MS_SpecialAirHiHold,
    ftNs_MS_SpecialAirHiEnd,
    ftNs_MS_SpecialAirHi,
    ftNs_MS_SpecialAirHiRebound,
    ftNs_MS_SpecialLwStart,
    ftNs_MS_SpecialLwHold,
    ftNs_MS_SpecialLwHit,
    ftNs_MS_SpecialLwEnd,
    ftNs_MS_SpecialLwTurn,
    ftNs_MS_SpecialAirLwStart,
    ftNs_MS_SpecialAirLwHold,
    ftNs_MS_SpecialAirLwHit,
    ftNs_MS_SpecialAirLwEnd,
    ftNs_MS_SpecialAirLwTurn,
    ftNs_MS_Count,
    ftNs_MS_SelfCount = ftNs_MS_Count - ftCo_MS_Count,
} ftNess_MotionState;
typedef enum ftNs_Submotion {
    ftNs_SM_AttackHi4Charge = ftCo_SM_Count,
    ftNs_SM_AttackHi4Release,
    ftNs_SM_AttackLw4Charge,
    ftNs_SM_AttackLw4Release,
    ftNs_SM_SpecialNStart,
    ftNs_SM_SpecialNHold0,
    ftNs_SM_SpecialNHold1,
    ftNs_SM_SpecialNEnd,
    ftNs_SM_SpecialAirNStart,
    ftNs_SM_SpecialAirNHold0,
    ftNs_SM_SpecialAirNHold1,
    ftNs_SM_SpecialAirNEnd,
    ftNs_SM_SpecialS,
    ftNs_SM_SpecialAirS,
    ftNs_SM_SpecialHiStart,
    ftNs_SM_SpecialHiHold,
    ftNs_SM_SpecialHiEnd,
    ftNs_SM_SpecialHi,
    ftNs_SM_SpecialAirHiStart,
    ftNs_SM_SpecialAirHiHold,
    ftNs_SM_SpecialAirHiEnd,
    ftNs_SM_SpecialAirHi,
    ftNs_SM_SpecialAirHiRebound,
    ftNs_SM_SpecialLwStart,
    ftNs_SM_SpecialLwHold,
    ftNs_SM_SpecialLwHit,
    ftNs_SM_SpecialLwEnd,
    ftNs_SM_SpecialAirLwStart,
    ftNs_SM_SpecialAirLwHold,
    ftNs_SM_SpecialAirLwHit,
    ftNs_SM_SpecialAirLwEnd,
    ftNs_SM_Count,
    ftNs_SM_SelfCount = ftNs_SM_Count - ftCo_SM_Count,
} ftNs_Submotion;
struct ftNess_FighterVars {
    /* 0x222C */ HSD_GObj* yoyo_gobj;
    /* 0x2230 */ Vec3 yoyo_hitbox_pos;
    /* 0x223C */ float x223C;
    /* 0x2240 */ HSD_GObj* pkflash_gobj;
    /* 0x2244 */ HSD_GObj* pkthunder_gobj;
    /* 0x2248 */ HSD_GObj* bat_gobj;
    /// bool for PK Thunder GFX?
    /* 0x224C */ u32 pkthunder_gfx;
};
union ftNess_MotionVars {
    struct ftNess_YoyoVars {
        /// 0x2340 - Current frame of Up/Down Smash animation as an integer
        s32 yoyoCurrentFrame;
        /// 0x2344 - Frames until Up/Down Smash hitbox automatically refreshes;
        /// part of why the Yo-Yo Glitch occurs
        s32 yoyoRehitTimer;
        /// 0x2348 - bool to indicate whether Ness can charge the Yo-Yo
        bool isChargeDisable;
        /// 0x234C - bool to indicate whether Yo-Yo hitbox position should
        /// update based on raw Vec3 input (false) or modified calculations
        /// (true)
        bool isPosUpdateMod;
    } attackhi4, attacklw4;
    struct ftNess_SpecialNVars {
        /// 0x2340 - Number of frames Ness remains in the "charge loop"
        /// animation after releasing PK Flash
        s32 flashTimerLoop1;
        /// 0x2344 - Number of extra frames Ness remains in the "charge loop"
        /// animation after releasing PK Flash?
        s32 flashTimerLoop2;
        /// 0x2348 - Number of frames to pass before gravity takes effect
        s32 gravityDelay;
        /// 0x234C - Minimum number of frames required to pass for PK Flash to
        /// auto-release if B is not being held
        s32 flashTimerMin;
    } specialn;
    struct ftNess_SpecialHiVars {
        /// 0x2340 - PK Thunder collision type? Used to check if PK Thunder is
        /// colliding with Ness
        s32 thunderColl;
        /// 0x2344 - Number of frames Ness remains in the "control loop"
        /// animation after PK Thunder despawns
        s32 thunderTimerLoop1;
        /// 0x2348 - Number of extra frames Ness remains in the "control loop"
        /// animation after PK Thunder despawns?
        s32 thunderTimerLoop2;
        /// 0x234C - Number of frames to pass before gravity takes effect
        s32 gravityDelay;
        /// 0x2350 - ???
        Vec3 collPos1;
        /// 0x235C - ???
        Vec3 collPos2;
        /// 0x2368 - Aerial velocity of PK Thunder 2 (Self-Hit)
        float aerialVel;
        /// 0x236C - Set various times but never actually used?
        float unkVar;
        /// 0x2370 - Facing direction change frorm PK Thunder collision
        float facingDir;
        /// 0x2374 through 0x237C - Unused vector
        Vec3 unkVector1;
        /// 0x2380 - bool used in a weird way to switch to PK Thunder 2 GFX
        s32 jibakuGFX;
        /// 0x2384 - Fall acceleration of PK Thunder 2 (Self-Hit)
        float fallAccel;
        /// 0x2388 - Set various times but never actually used?
        float unkVar3;
        /// 0x238C - Set various times but never actually used?
        float unkVar4;
    } specialhi;
    struct ftNess_SpecialLwVars {
        /// 0x2340 - Auto lag frames after initializing PSI Magnet if B is not
        /// being held; PSI Magnet is immediately released with no lag once
        /// these frames have passed
        s32 releaseLag;
        /// 0x2344 - Unused turnaround timer
        s32 turnFrames;
        /// 0x2348 - Check if Ness is no longer holding B
        bool isRelease;
        /// 0x234C - Number of frames to pass before gravity takes effect
        s32 gravityDelay;
        s32 x10;
    } speciallw;
};
// Special Attributes
typedef struct ftNessAttributes {
    // Neutral Special - PK Flash
    s32 x0_PKFLASH_TIMER1_LOOPFRAMES;
    s32 x4_PKFLASH_TIMER2_LOOPFRAMES;
    s32 x8_PKFLASH_GRAVITY_DELAY;
    s32 xC_PKFLASH_MINCHARGEFRAMES;
    float x10_PKFLASH_UNK1;
    float x14_PKFLASH_FALL_ACCEL;
    float x18_PKFLASH_UNK2;
    float x1C_PKFLASH_LANDING_LAG; // If set to 0, Ness does not enter freefall
                                   // after aerial PK Flash, but loses his
                                   // double jump.
    // Side Special - PK Fire
    float x20_PKFIRE_AERIAL_LAUNCH_TRAJECTORY; // Radians
    float x24_PKFIRE_AERIAL_VELOCITY;
    float x28_PKFIRE_GROUNDED_LAUNCH_TRAJECTORY; // Radians
    float x2C_PKFIRE_GROUNDED_VELOCITY;
    float x30_PKFIRE_SPAWN_X;
    float x34_PKFIRE_SPAWN_Y;
    float x38_PKFIRE_LANDING_LAG;
    // Up Special - PK Thunder
    float x3C_PK_THUNDER_UNK1;
    u32 x40_PK_THUNDER_LOOP1;
    u32 x44_PK_THUNDER_LOOP2;
    u32 x48_PK_THUNDER_GRAVITY_DELAY;
    float x4C_PK_THUNDER_UNK2;
    float x50_PK_THUNDER_FALL_ACCEL;
    // Up Special - PK Thunder 2 (Self-Hit)
    float x54_PK_THUNDER_2_MOMENTUM;
    float x58_PK_THUNDER_2_UNK1;
    float x5C_PK_THUNDER_2_DECELERATION_RATE;
    float x60_PK_THUNDER_2_KNOCKDOWN_ANGLE; // Angle to determine whether to
                                            // enter PK Thunder 2 or DownBound
                                            // state (Ground Only)
    float x64_PK_THUNDER_2_WALLHUG_ANGLE; // Surface angle to determine whether
                                          // PK Thunder 2 wallhugs or bounces
    float x68_PK_THUNDER_2_UNK2;
    float
        x6C_PK_THUNDER_2_FREEFALL_ANIM_BLEND; // Amount of animation blend
                                              // frames Ness goes through when
                                              // entering FallSpecial through
                                              // his SpecialHi Motion States
    float x70_PK_THUNDER_2_LANDING_LAG; // If set to 0, Ness does not enter
                                        // freefall after aerial PK Thunder,
                                        // but loses his double jump.
    // Down Special - PSI Magnet
    float x74_PSI_MAGNET_RELEASE_LAG; // Auto lag frames after initializing PSI
                                      // Magnet if B is not being held. PSI
                                      // Magnet is immediately released with no
                                      // lag once these frames have passed.
    float x78_PSI_MAGNET_UNK1; // Note: Reminiscent of Fox and Falco's
                               // Reflector turn duration attribute? Unused.
    float x7C_PSI_MAGNET_UNK2; // Note: Reminiscent of Fox and Falco's
                               // Reflector Unk1 attribute? Unused.
    float x80_PSI_MAGNET_UNK3; // Unused.
    s32 x84_PSI_MAGNET_FRAMES_BEFORE_GRAVITY;
    float x88_PSI_MAGNET_MOMENTUM_PRESERVATION;
